#### Create Method (XYZ, ElementId)

---

|  |
| --- |
| Point Class   See Also |

Creates a point at the given coordinates and assigns it the specified GraphicsStyle.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static Point Create( 	XYZ coord, 	ElementId id ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	coord As XYZ, _ 	id As ElementId _ ) As Point ``` |

| Visual C++ |
| --- |
| ``` public: static Point^ Create( 	XYZ^ coord,  	ElementId^ id ) ``` |

#### Parameters

coord
:   Type:  Autodesk.Revit.DB XYZ
     The coordinates where the point will be created.

id
:   Type:  Autodesk.Revit.DB ElementId
     The id of the GraphicsStyle element from which to apply the point properties.

#### Return Value

A Point object.

# See Also

Point Class

Create Overload

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ThinLinesOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ThinLinesOptions Class

Autodesk.Revit.UI Namespace

#### GradientNoiseSize Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "Size" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string GradientNoiseSize { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GradientNoiseSize As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ GradientNoiseSize { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### BuiltInFailures.EditingFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures related to editing operations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class EditingFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class EditingFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class EditingFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures EditingFailures

# See Also

BuiltInFailures EditingFailures Members

Autodesk.Revit.DB Namespace

#### SpaceSeparationLinesOverlap Property

---

|  |
| --- |
| BuiltInFailures OverlapFailures Class   See Also |

Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SpaceSeparationLinesOverlap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceSeparationLinesOverlap As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SpaceSeparationLinesOverlap { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures OverlapFailures Class

Autodesk.Revit.DB Namespace

#### FbxLightTemperatureLoss Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Temperature Loss"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightTemperatureLoss { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightTemperatureLoss As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightTemperatureLoss { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DividedSurfaceLoopsOfSplittingCurves Property

---

|  |
| --- |
| BuiltInFailures DividedSurfaceFailures Class   See Also |

Curve elements forming a closed loop currently cannot be used as splitters and are ignored.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DividedSurfaceLoopsOfSplittingCurves { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceLoopsOfSplittingCurves As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DividedSurfaceLoopsOfSplittingCurves { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DividedSurfaceFailures Class

Autodesk.Revit.DB Namespace

#### AnalyticalVisualLightTransmittance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Visual Light Transmittance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalVisualLightTransmittance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalVisualLightTransmittance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalVisualLightTransmittance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| PipeFittingAndAccessoryPressureDropUIData Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.UI.Plumbing
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

PipeFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Plumbing Namespace

#### RemoveFilter Method

---

|  |
| --- |
| View Class   See Also |

Removes a filter from the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void RemoveFilter( 	ElementId filterElementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveFilter ( _ 	filterElementId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveFilter( 	ElementId^ filterElementId ) ``` |

#### Parameters

filterElementId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of the filter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Filter is not applied to the view. -or- ElementId is not associated with a FilterElement. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### TextureVRepeat Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "V Repeat" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureVRepeat { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureVRepeat As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureVRepeat { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### Insert Method

---

|  |
| --- |
| GroupSet Class   See Also |

Insert the specified group into the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	Group item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As Group _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	Group^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB Group
     The group to be inserted into the set.

#### Return Value

Returns whether the group was inserted into the set.

# See Also

GroupSet Class

Autodesk.Revit.DB Namespace

#### CdPerMSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol cd/mÂ², indicating unit Candelas per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CdPerMSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CdPerMSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CdPerMSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| BRepBuilderSurfaceGeometry Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

BRepBuilderSurfaceGeometry Class

Autodesk.Revit.DB Namespace

#### SpaceSet Constructor

---

|  |
| --- |
| SpaceSet Class   See Also |

Initializes a new instance of the  SpaceSet  class

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SpaceSet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: SpaceSet() ``` |

# See Also

SpaceSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### Current Property

---

|  |
| --- |
| CurveArrArrayIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

CurveArrArrayIterator Class

Autodesk.Revit.DB Namespace

#### TextureScaleLock Property

---

|  |
| --- |
| Checker Class   See Also |

The property labeled "Scale Lock" from the "Checker" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureScaleLock { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureScaleLock As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureScaleLock { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Checker Class

Autodesk.Revit.DB.Visual Namespace

#### ExportLinetypeKey Constructor

---

|  |
| --- |
| ExportLinetypeKey Class   See Also |

Constructs a new default ExportLinetypeKey.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExportLinetypeKey() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ExportLinetypeKey() ``` |

# See Also

ExportLinetypeKey Class

ExportLinetypeKey Overload

Autodesk.Revit.DB Namespace

#### NoElementSelected Property

---

|  |
| --- |
| BuiltInFailures SelectionFailures Class   See Also |

No element selected.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoElementSelected { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoElementSelected As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoElementSelected { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SelectionFailures Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| FillGrid Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

FillGrid Class

Autodesk.Revit.DB Namespace

#### FailedToChangeWallJointsTypeFailure Property

---

|  |
| --- |
| BuiltInFailures WallJoinFailures Class   See Also |

Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FailedToChangeWallJointsTypeFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FailedToChangeWallJointsTypeFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FailedToChangeWallJointsTypeFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallJoinFailures Class

Autodesk.Revit.DB Namespace

#### CanExecuteEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by AddInCommandBinding's CanExecute event.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class CanExecuteEventArgs : CommandEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class CanExecuteEventArgs _ 	Inherits CommandEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class CanExecuteEventArgs : public CommandEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitEventArgs
  Autodesk.Revit.UI.Events CommandEventArgs
  Autodesk.Revit.UI.Events CanExecuteEventArgs

# See Also

CanExecuteEventArgs Members

Autodesk.Revit.UI.Events Namespace

#### SetTypeId Method

---

|  |
| --- |
| DirectShape Class   See Also |

Sets the DirectShapeType for the DirectShape element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void SetTypeId( 	ElementId typeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetTypeId ( _ 	typeId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetTypeId( 	ElementId^ typeId ) ``` |

#### Parameters

typeId
:   Type:  Autodesk.Revit.DB ElementId
     The ID of the type corresponding to this DirectShape element. May only be set once.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | typeId is not a valid Element identifier. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShape Class

Autodesk.Revit.DB Namespace

#### GetAnalyticalShadingSurfaces Method

---

|  |
| --- |
| EnergyAnalysisDetailModel Class   See Also |

The collection of analytical shading surfaces.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<EnergyAnalysisSurface> GetAnalyticalShadingSurfaces() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAnalyticalShadingSurfaces As IList(Of EnergyAnalysisSurface) ``` |

| Visual C++ |
| --- |
| ``` public: IList<EnergyAnalysisSurface^>^ GetAnalyticalShadingSurfaces() ``` |

#### Return Value

Returns the analytical shading surfaces after model calculation.

# See Also

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace

#### BendWidth Property

---

|  |
| --- |
| StructuralSectionSigmaProfile Class   See Also |

Bend segment width.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double BendWidth { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BendWidth As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BendWidth { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionSigmaProfile Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### TextPosition Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Text Position"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TextPosition { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextPosition As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TextPosition { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### UnresolvableErrorInFamilyWarn Property

---

|  |
| --- |
| BuiltInFailures GeneralFailures Class   See Also |

An error occurred in family "[Name]" that cannot be automatically resolved.\nError Information:\n"[Text]"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UnresolvableErrorInFamilyWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnresolvableErrorInFamilyWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UnresolvableErrorInFamilyWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeneralFailures Class

Autodesk.Revit.DB Namespace

#### NewtonsPerSquareMillimeter Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Newtons per square millimeter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NewtonsPerSquareMillimeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NewtonsPerSquareMillimeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NewtonsPerSquareMillimeter { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### ToggleButtonData Constructor (String, String, String, String)

---

|  |
| --- |
| ToggleButtonData Class   See Also |

Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ToggleButtonData( 	string name, 	string text, 	string assemblyName, 	string className ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	name As String, _ 	text As String, _ 	assemblyName As String, _ 	className As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ToggleButtonData( 	String^ name,  	String^ text,  	String^ assemblyName,  	String^ className ) ``` |

#### Parameters

name
:   Type:  System String
     The internal name of the new button.

text
:   Type:  System String
     The user visible text seen on the new button.

assemblyName
:   Type:  System String
     The assembly path of the button.

className
:   Type:  System String
     The name of the class containing the implementation for the command.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when    a null reference (  Nothing  in Visual Basic)  is passed for one or more arguments. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when an empty string is passed for one or more arguments. |

# See Also

ToggleButtonData Class

ToggleButtonData Overload

Autodesk.Revit.UI Namespace

#### Value Property

---

|  |
| --- |
| DoubleParameterValue Class   See Also |

The stored value

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public double Value { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Value As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Value { 	double get (); 	void set (double value); } ``` |

# See Also

DoubleParameterValue Class

Autodesk.Revit.DB Namespace

#### SetCurrentResolutionType Method

---

|  |
| --- |
| FailureMessageAccessor Class   See Also |

Sets the type of a resolution to be used to resolve the failure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void SetCurrentResolutionType( 	FailureResolutionType resolutionType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCurrentResolutionType ( _ 	resolutionType As FailureResolutionType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCurrentResolutionType( 	FailureResolutionType resolutionType ) ``` |

#### Parameters

resolutionType
:   Type:  Autodesk.Revit.DB FailureResolutionType
     The type of failure resolution to be used to resolve the failure.

# Remarks

When FailuresAccessor is used to resolve failures, it will execute resolutions based on current resolution type. If no current resolution type is set, the default resolution type will be used. Setting is performed on the FailureMessageAccessor object itself, so if there are several accessors issued for the same FailureMessage, setting of the resolution type performed on one of them does not impact the others.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This FailureMessageAccessor has no resolution of resolutionType. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailureMessageAccessor has not been properly initialized. -or- This FailureMessageAccessor does not have any resolutions. |

# See Also

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace

#### CustomAxis Property

---

|  |
| --- |
| IFCExtrusionCreationData Class   See Also |

The custom extrusion axis to try when generating an extrusion.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public XYZ CustomAxis { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CustomAxis As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ CustomAxis { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace

#### Name Property

---

|  |
| --- |
| Zone Class   See Also |

Get or Set the Name of the Zone.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override string Name { set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overrides WriteOnly Property Name As String 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property String^ Name { 	void set (String^ value) override; } ``` |

# Remarks

This property is used to get or set the Name of the Zone.

# See Also

Zone Class

Autodesk.Revit.DB.Mechanical Namespace

#### PlanTopologySetIterator Constructor

---

|  |
| --- |
| PlanTopologySetIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PlanTopologySetIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: PlanTopologySetIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

PlanTopologySetIterator Class

Autodesk.Revit.DB Namespace

#### SplitRegionHorizontally Method

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Splits horizontally one region in split crop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void SplitRegionHorizontally( 	int regionIndex, 	double leftPart, 	double rightPart ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SplitRegionHorizontally ( _ 	regionIndex As Integer, _ 	leftPart As Double, _ 	rightPart As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SplitRegionHorizontally( 	int regionIndex,  	double leftPart,  	double rightPart ) ``` |

#### Parameters

regionIndex
:   Type:  System Int32
     Index of region to be split horizontally (numbering starts with 0).

leftPart
:   Type:  System Double
     Relative portion of the original region to become the new left region (0 to 1).

rightPart
:   Type:  System Double
     Relative portion of the original region to become the new right region (0 to 1).

# Remarks

This function splits the crop into two regions: one occupying the left quarter of the crop, and the other the right quarter of the crop.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The provided view region proportions are not valid. -or- The provided region index is invalid. |
| Autodesk.Revit.Exceptions InvalidOperationException | The crop of the associated view is not permitted to have multiple regions. -or- The view has non-rectangular crop shape set. -or- The view crop is already split vertically. |

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### MSup3PerHMSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol mÂ³/(hÂ·mÂ²), indicating unit Cubic meters per hour square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MSup3PerHMSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MSup3PerHMSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MSup3PerHMSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### FabricationPartExceededAngleFlexToleranceWarning Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The angle flex is greater than the maximum angle flex tolerance defined by the fabrication part. Connections with this part may not be properly aligned and may appear to be skewed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartExceededAngleFlexToleranceWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartExceededAngleFlexToleranceWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartExceededAngleFlexToleranceWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### Point Property

---

|  |
| --- |
| BoundaryConditions Class   See Also |

Returns the position of point boundary conditions.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Point { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Point As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Point { 	XYZ^ get (); } ``` |

# Remarks

Boundary conditions should be BoundaryConditionsType::Point type. Otherwise exception is thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidObjectException | Thrown when BoundaryConditions is not a BoundaryConditionsType::Point type. |

# See Also

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace

#### GetDirectContext3DHandleSettings Method

---

|  |
| --- |
| DirectContext3DHandleOverrides Class   See Also |

Gets override settings associated with a DirectContext3D handle instance or type.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public DirectContext3DHandleSettings GetDirectContext3DHandleSettings( 	Document aDoc, 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDirectContext3DHandleSettings ( _ 	aDoc As Document, _ 	elementId As ElementId _ ) As DirectContext3DHandleSettings ``` |

| Visual C++ |
| --- |
| ``` public: DirectContext3DHandleSettings^ GetDirectContext3DHandleSettings( 	Document^ aDoc,  	ElementId^ elementId ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     Document where elementId resides.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the overridden element.

#### Return Value

The override settings assigned to the handle element, if present, or a default override settings if nothing was found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId elementId is not a valid DirectContext3D handle instance or type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### CurveArrArrayIterator Constructor

---

|  |
| --- |
| CurveArrArrayIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurveArrArrayIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: CurveArrArrayIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

CurveArrArrayIterator Class

Autodesk.Revit.DB Namespace

#### InitialColor Class

---

|  |
| --- |
| Members   See Also |

This class is the base class for calculating initial light color.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class InitialColor : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class InitialColor _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class InitialColor : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Lighting InitialColor
  Autodesk.Revit.DB.Lighting CustomInitialColor
  Autodesk.Revit.DB.Lighting PresetInitialColor

# See Also

InitialColor Members

Autodesk.Revit.DB.Lighting Namespace

#### ComboBoxMemberData Constructor

---

|  |
| --- |
| ComboBoxMemberData Class   See Also |

Constructs a new instance of ComboBoxMemberData.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ComboBoxMemberData( 	string name, 	string text ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	name As String, _ 	text As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ComboBoxMemberData( 	String^ name,  	String^ text ) ``` |

#### Parameters

name
:   Type:  System String
     The internal name of the ComboBoxMember.

text
:   Type:  System String
     The user visible text seen on the item.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when    a null reference (  Nothing  in Visual Basic)  is passed for one or more arguments. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when an empty string is passed for one or more arguments. |

# See Also

ComboBoxMemberData Class

Autodesk.Revit.UI Namespace

#### AttachToHanger Method

---

|  |
| --- |
| FabricationRodInfo Class   See Also |

Attaches the hanger rod to another bearer hanger.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void AttachToHanger( 	ElementId hangerId, 	int rodIndex, 	XYZ position ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AttachToHanger ( _ 	hangerId As ElementId, _ 	rodIndex As Integer, _ 	position As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AttachToHanger( 	ElementId^ hangerId,  	int rodIndex,  	XYZ^ position ) ``` |

#### Parameters

hangerId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the bearer hanger to which the rod attaches.

rodIndex
:   Type:  System Int32
     The index of the rod.

position
:   Type:  Autodesk.Revit.DB XYZ
     The position of the rod end. It should be on bearer centerline.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The hanger is not a bearer hanger. -or- the point is not on hanger bearer centerline. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |

# See Also

FabricationRodInfo Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| ComponentRepeaterSlot Class   See Also |

A flag indicating whether the slot is currently empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsEmpty { 	bool get (); } ``` |

# See Also

ComponentRepeaterSlot Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| OpenOptions Class   See Also |

Releases all resources used by the  OpenOptions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

OpenOptions Class

Autodesk.Revit.DB Namespace

#### OfPoint Method

---

|  |
| --- |
| Transform2D Class   See Also |

Applies the transformation to the point and returns the result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public UV OfPoint( 	UV point ) ``` |

| Visual Basic |
| --- |
| ``` Public Function OfPoint ( _ 	point As UV _ ) As UV ``` |

| Visual C++ |
| --- |
| ``` public: UV^ OfPoint( 	UV^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB UV
     The point to transform.

#### Return Value

The transformed point.

# Remarks

Transformation of a point is affected by the translational part of the transformation.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Transform2D Class

Autodesk.Revit.DB Namespace

#### CurrentObject Property

---

|  |
| --- |
| ConduitSizeIterator Class   See Also |

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` internal Object CurrentObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Friend ReadOnly Property CurrentObject As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` internal: virtual property Object^ CurrentObject { 	Object^ get () sealed; } ``` |

#### Implements

 IEnumerator Current

# See Also

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### SetInnerRule Method

---

|  |
| --- |
| FilterInverseRule Class   See Also |

Gets the rule being inverted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void SetInnerRule( 	FilterRule innerRule ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetInnerRule ( _ 	innerRule As FilterRule _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetInnerRule( 	FilterRule^ innerRule ) ``` |

#### Parameters

innerRule
:   Type:  Autodesk.Revit.DB FilterRule
     The rule to invert.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilterInverseRule Class

Autodesk.Revit.DB Namespace

#### HasAssociatedParts Method (Document, ElementId)

---

|  |
| --- |
| PartUtils Class   See Also |

Checks if an element has associated parts.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool HasAssociatedParts( 	Document hostDocument, 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function HasAssociatedParts ( _ 	hostDocument As Document, _ 	elementId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool HasAssociatedParts( 	Document^ hostDocument,  	ElementId^ elementId ) ``` |

#### Parameters

hostDocument
:   Type:  Autodesk.Revit.DB Document
     The document.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     The element to be checked for associated Parts

#### Return Value

True if the element has associated Parts.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

HasAssociatedParts Overload

Autodesk.Revit.DB Namespace

#### GetPartCustomDataReal Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Get custom data real value for the specified custom data.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public double GetPartCustomDataReal( 	int customId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPartCustomDataReal ( _ 	customId As Integer _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetPartCustomDataReal( 	int customId ) ``` |

#### Parameters

customId
:   Type:  System Int32
     The identifier of the custom data field to get.

#### Return Value

Returns the real number of the custom data. If the data is not a number it will return 0.0.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The custom data does not exist on the part. |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### UngroupMembers Method

---

|  |
| --- |
| Group Class   See Also |

Ungroups the group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> UngroupMembers() ``` |

| Visual Basic |
| --- |
| ``` Public Function UngroupMembers As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ UngroupMembers() ``` |

#### Return Value

If successful, the ids of the members of group are returned.

# Remarks

Removes all the members from the group and deletes the group. Note that the reference to this group object will become invalid once this method is called.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the group cannot be ungrouped. |

# See Also

Group Class

Autodesk.Revit.DB Namespace

#### SetBendProfile Method

---

|  |
| --- |
| FabricSheet Class   Example   See Also |

Sets new profile that defines the shape of the Fabric Sheet bending.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void SetBendProfile( 	CurveLoop bendProfile ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetBendProfile ( _ 	bendProfile As CurveLoop _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetBendProfile( 	CurveLoop^ bendProfile ) ``` |

#### Parameters

bendProfile
:   Type:  Autodesk.Revit.DB CurveLoop
     A profile that defines the bending shape of the fabric sheet. The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so, then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family. If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated. The provided profile defines the center-curve of a wire.

# Examples

 Copy  C#

```
private void ModifyBentFabricSheet(Document document, FabricSheet bentFabricSheet)
{
   CurveLoop newBendingProfile = CurveLoop.CreateViaOffset(bentFabricSheet.GetBendProfile(), 0.5, new XYZ(0, 0, -1));
   bentFabricSheet.SetBendProfile(newBendingProfile);

   // Give the user some information
   TaskDialog.Show("Revit", string.Format("Bent Fabric Sheet ID='{0}' modified successfully.", bentFabricSheet.Id.ToString()));
}
```

 Copy  VB.NET

```
Private Sub ModifyBentFabricSheet(document As Document, bentFabricSheet As FabricSheet)
    Dim newBendingProfile As CurveLoop = CurveLoop.CreateViaOffset(bentFabricSheet.GetBendProfile(), 0.5, New XYZ(0, 0, -1))
    bentFabricSheet.SetBendProfile(newBendingProfile)

    ' Give the user some information
    TaskDialog.Show("Revit", String.Format("Bent Fabric Sheet ID='{0}' modified successfully.", bentFabricSheet.Id.ToString()))
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the bend profile contains an overlap or intersecting segments. -or- Thrown when the bend profile is empty. -or- Thrown when the bend profile contains an empty loop. -or- Thrown when the bend profile contains multiple loops. -or- Thrown when the bend profile contains a closed loop. -or- Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment. -or- Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family. -or- Thrown when the provided profile cannot be used as a bending shape for this fabric sheet. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidObjectException | The data-setting method is not applicable to fabric sheets that are flat. |

# See Also

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace

#### GetEqualityFormula Method

---

|  |
| --- |
| DimensionType Class   See Also |

Gets an ordered list of the entries in the equality formula definition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public IList<DimensionEqualityLabelFormatting> GetEqualityFormula() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetEqualityFormula As IList(Of DimensionEqualityLabelFormatting) ``` |

| Visual C++ |
| --- |
| ``` public: IList<DimensionEqualityLabelFormatting^>^ GetEqualityFormula() ``` |

#### Return Value

An ordered list of the entries in the equality formula definition.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The given DimensionType cannot be assigned an equality formula as it is not continuous linear or angular. |

# See Also

DimensionType Class

Autodesk.Revit.DB Namespace

#### FamProfileUsage Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Profile Usage"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FamProfileUsage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamProfileUsage As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FamProfileUsage { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetCloudModelPath Method

---

|  |
| --- |
| Document Class   See Also |

Gets the cloud model path of the cloud model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019.1

# Syntax

| C# |
| --- |
| ``` public ModelPath GetCloudModelPath() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCloudModelPath As ModelPath ``` |

| Visual C++ |
| --- |
| ``` public: ModelPath^ GetCloudModelPath() ``` |

#### Return Value

The cloud model path

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This Document is a not cloud model, cannot execute this operation. |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### DeleteWorksetOption Property

---

|  |
| --- |
| DeleteWorksetSettings Class   See Also |

The current delete workset option.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public DeleteWorksetOption DeleteWorksetOption { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DeleteWorksetOption As DeleteWorksetOption 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property DeleteWorksetOption DeleteWorksetOption { 	DeleteWorksetOption get (); 	void set (DeleteWorksetOption value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DeleteWorksetSettings Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| FilteredElementIterator Class   See Also |

Resets the iterator to the beginning.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The FilteredElementCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. |

# See Also

FilteredElementIterator Class

Autodesk.Revit.DB Namespace

#### AllowCancellation Property

---

|  |
| --- |
| TaskDialog Class   See Also |

Whether the task dialog can be cancelled if no cancel button is specified.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool AllowCancellation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AllowCancellation As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool AllowCancellation { 	bool get (); 	void set (bool value); } ``` |

# Remarks

The default value is true. If there is a cancel button in the task dialog, the it always can be cancelled.

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### OfVector Method

---

|  |
| --- |
| Transform2D Class   See Also |

Applies the transformation to the vector and returns the result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public UV OfVector( 	UV vector ) ``` |

| Visual Basic |
| --- |
| ``` Public Function OfVector ( _ 	vector As UV _ ) As UV ``` |

| Visual C++ |
| --- |
| ``` public: UV^ OfVector( 	UV^ vector ) ``` |

#### Parameters

vector
:   Type:  Autodesk.Revit.DB UV
     The vector to transform.

#### Return Value

The transformed vector.

# Remarks

Transformation of a vector is not affected by the translational part of the transformation.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Transform2D Class

Autodesk.Revit.DB Namespace

#### InsertFilter Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Adds a new filter at the specified position in the list.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void InsertFilter( 	ScheduleFilter filter, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub InsertFilter ( _ 	filter As ScheduleFilter, _ 	index As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void InsertFilter( 	ScheduleFilter^ filter,  	int index ) ``` |

#### Parameters

filter
:   Type:  Autodesk.Revit.DB ScheduleFilter
     The filter to add.

index
:   Type:  System Int32
     The index in the list of filters.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The field ID is not the ID of a field in this ScheduleDefinition. -or- The field and filter type cannot be used to filter this ScheduleDefinition. -or- The filter value is not valid for the field and filter type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | index is not a valid insert position. |
| Autodesk.Revit.Exceptions InvalidOperationException | This ScheduleDefinition does not support filters. -or- The resulting filter count would be greater than 8. |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### FbxLightPhotometricFile Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Photometric Web File"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightPhotometricFile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightPhotometricFile As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightPhotometricFile { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MepCoolingCoilType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cooling Coil"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepCoolingCoilType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepCoolingCoilType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepCoolingCoilType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LinkLoadContent Class

---

|  |
| --- |
| Members   See Also |

This class is used by IExternalResourceServers to return Link data to Revit when their LoadResource method is invoked. It also contains additional information used by IExternalResourceUIServers to display link load status results to the user.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class LinkLoadContent : ExternalResourceLoadContent ``` |

| Visual Basic |
| --- |
| ``` Public Class LinkLoadContent _ 	Inherits ExternalResourceLoadContent ``` |

| Visual C++ |
| --- |
| ``` public ref class LinkLoadContent : public ExternalResourceLoadContent ``` |

# Remarks

This class handles Revit links.

Revit links must be loaded from a path accessible to Revit. Server implementors should provide Revit with a ModelPath representing a location from which to load the link. Revit will handle the actual file loading.

Servers which represent non-local file locations will need to create their own implementation for copying or moving files to a Revit-accessible location.

The link data path used for link loading may be different from the path displayed to the user. The link data path represents the literal location of the file, whereas the link's display path represents what the user sees as the name of the link. See  [!:Autodesk::Revit::DB::ExternalResourceReference::InSessionPath]  for more details on display paths.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExternalResourceLoadContent
  Autodesk.Revit.DB LinkLoadContent

# See Also

LinkLoadContent Members

Autodesk.Revit.DB Namespace

#### EndTreatment Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Treatment"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId EndTreatment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EndTreatment As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ EndTreatment { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### OpaqueLuminanceModifier Property

---

|  |
| --- |
| AdvancedOpaque Class   See Also |

The property labeled "Luminance Scale" from the "AdvancedOpaque" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string OpaqueLuminanceModifier { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OpaqueLuminanceModifier As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ OpaqueLuminanceModifier { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

# See Also

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace

#### GetCouplerId Method

---

|  |
| --- |
| Rebar Class   See Also |

Get the id of the Rebar Coupler that is applied to the rebar at the specified end.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public ElementId GetCouplerId( 	int end ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCouplerId ( _ 	end As Integer _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetCouplerId( 	int end ) ``` |

#### Parameters

end
:   Type:  System Int32
     0 for the start Rebar Coupler, 1 for the end Rebar Coupler.

#### Return Value

The id of a Rebar Coupler, or invalidElementId if the rebar has no Rebar Coupler at the specified end.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | end must be 0 or 1. |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### IsFailureResolutionPermitted Method (FailureMessageAccessor, FailureResolutionType)

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Checks if resolution of the failure using given resolution type is permitted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool IsFailureResolutionPermitted( 	FailureMessageAccessor failure, 	FailureResolutionType resolutionType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsFailureResolutionPermitted ( _ 	failure As FailureMessageAccessor, _ 	resolutionType As FailureResolutionType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsFailureResolutionPermitted( 	FailureMessageAccessor^ failure,  	FailureResolutionType resolutionType ) ``` |

#### Parameters

failure
:   Type:  Autodesk.Revit.DB FailureMessageAccessor
     Accessor to the failure to be resolved.

resolutionType
:   Type:  Autodesk.Revit.DB FailureResolutionType
     Type of the failure resolution to be used.

#### Return Value

True if resolution of the failure using given resolution type is permitted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | failure has not been properly initialized. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also

FailuresAccessor Class

IsFailureResolutionPermitted Overload

Autodesk.Revit.DB Namespace

#### DeformationType Property

---

|  |
| --- |
| RebarBarType Class   See Also |

Defines bar deformation type.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public RebarDeformationType DeformationType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DeformationType As RebarDeformationType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property RebarDeformationType DeformationType { 	RebarDeformationType get (); 	void set (RebarDeformationType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace

#### StructuralAttachmentStartValueDistance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Start Attachment Distance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralAttachmentStartValueDistance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralAttachmentStartValueDistance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralAttachmentStartValueDistance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BeamVJustification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"z-Direction Justification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BeamVJustification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BeamVJustification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BeamVJustification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SubCategoryName Property

---

|  |
| --- |
| ExportLayerKey Class   See Also |

The subcategrory Name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string SubCategoryName { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SubCategoryName As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ SubCategoryName { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ExportLayerKey Class

Autodesk.Revit.DB Namespace

#### DuplicateFieldRemovedFromKeySchedule Property

---

|  |
| --- |
| BuiltInFailures ScheduleViewFailures Class   See Also |

Duplicate fields across key schedules will be removed after paste.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DuplicateFieldRemovedFromKeySchedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DuplicateFieldRemovedFromKeySchedule As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DuplicateFieldRemovedFromKeySchedule { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ScheduleViewFailures Class

Autodesk.Revit.DB Namespace

#### DimensionEqualityLabelFormatting Constructor

---

|  |
| --- |
| DimensionEqualityLabelFormatting Class   See Also |

Constructs a new instance of a DimensionEqualityLabelFormatting object with specified settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public DimensionEqualityLabelFormatting( 	int leadingSpaces, 	string prefix, 	LabelType labelType, 	string suffix, 	FormatOptions formatOptions ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	leadingSpaces As Integer, _ 	prefix As String, _ 	labelType As LabelType, _ 	suffix As String, _ 	formatOptions As FormatOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: DimensionEqualityLabelFormatting( 	int leadingSpaces,  	String^ prefix,  	LabelType labelType,  	String^ suffix,  	FormatOptions^ formatOptions ) ``` |

#### Parameters

leadingSpaces
:   Type:  System Int32
     The number of spaces to include before the parameter value.

prefix
:   Type:  System String
     The prefix to include before the parameter value.

labelType
:   Type:  Autodesk.Revit.DB LabelType
     The parameter value to be shown.

suffix
:   Type:  System String
     The suffix to include after the parameter value.

formatOptions
:   Type:  Autodesk.Revit.DB FormatOptions
     The format options to use for the parameter value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DimensionEqualityLabelFormatting Class

Autodesk.Revit.DB Namespace

#### HotConductorsNumber Property

---

|  |
| --- |
| ElectricalSystem Class   See Also |

The HotConductors Number of the Electrical System.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public int HotConductorsNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HotConductorsNumber As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int HotConductorsNumber { 	int get (); } ``` |

# Remarks

This property is used to retrieve the HotConductors Number of the Electrical System.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This property only available when System Type is Power! |

# See Also

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace

#### AllInvisibleInPlanViewWarn Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AllInvisibleInPlanViewWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AllInvisibleInPlanViewWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AllInvisibleInPlanViewWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### ShowGridsOnLevel Method

---

|  |
| --- |
| View3D Class   See Also |

This method displays the grid lines in this 3DView on the given Level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void ShowGridsOnLevel( 	ElementId levelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ShowGridsOnLevel ( _ 	levelId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ShowGridsOnLevel( 	ElementId^ levelId ) ``` |

#### Parameters

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the Level where grids should be displayed.

# Remarks

Grids will be displayed only if they intersects Level's plane.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View3D Class

Autodesk.Revit.DB Namespace

#### RbsElecPowerFactorState Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Power Factor State"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPowerFactorState { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPowerFactorState As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPowerFactorState { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### EnergyAnalysisSurface Class

---

|  |
| --- |
| Members   See Also |

Analytical surface. The collection of analytic openings belonging to this analytical parent surface

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class EnergyAnalysisSurface : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class EnergyAnalysisSurface _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class EnergyAnalysisSurface : public Element ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Analysis EnergyAnalysisSurface

# See Also

EnergyAnalysisSurface Members

Autodesk.Revit.DB.Analysis Namespace

#### FabricationPartFitFailure Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

Fabrication Part Fitting Failed to Fit

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartFitFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartFitFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartFitFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### GetSpareLoadValue Method

---

|  |
| --- |
| PanelScheduleView Class   See Also |

Gets the value of the apparent load parameter for a spare

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double GetSpareLoadValue( 	int row, 	int column, 	ElementId idLoadParameter ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSpareLoadValue ( _ 	row As Integer, _ 	column As Integer, _ 	idLoadParameter As ElementId _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetSpareLoadValue( 	int row,  	int column,  	ElementId^ idLoadParameter ) ``` |

#### Parameters

row
:   Type:  System Int32
     A row where the valid spare is

column
:   Type:  System Int32
     A column where the valid spare is

idLoadParameter
:   Type:  Autodesk.Revit.DB ElementId
     One of 4 valid load parameters: RBS\_ELEC\_APPARENT\_LOAD, RBS\_ELEC\_APPARENT\_LOAD\_PHASEA, RBS\_ELEC\_APPARENT\_LOAD\_PHASEB, RBS\_ELEC\_APPARENT\_LOAD\_PHASEC

#### Return Value

The value of the spare's load parameter

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The load parameter id is not valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | The row column combination does not represent a valid spare. |

# See Also

PanelScheduleView Class

Autodesk.Revit.DB.Electrical Namespace

#### GetPipeScheduleId Method

---

|  |
| --- |
| PipeScheduleType Class   See Also |

Returns an existing pipe schedule type with the same name.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static ElementId GetPipeScheduleId( 	Document doc, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetPipeScheduleId ( _ 	doc As Document, _ 	name As String _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ GetPipeScheduleId( 	Document^ doc,  	String^ name ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document

name
:   Type:  System String
     The name of requested schedule type.

#### Return Value

Returns the element id of request schedule type, or invalidElementId if the name is not found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PipeScheduleType Class

Autodesk.Revit.DB.Plumbing Namespace

#### Dispose Method

---

|  |
| --- |
| DuplicateTypeNamesHandlerArgs Class   See Also |

Releases all resources used by the  DuplicateTypeNamesHandlerArgs

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace

#### CopyModel Method

---

|  |
| --- |
| Application Class   See Also |

Copies an existing model to a new file. Overwriting a file of the same name is allowed.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void CopyModel( 	ModelPath sourceModelPath, 	string destFilePath, 	bool overwrite ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub CopyModel ( _ 	sourceModelPath As ModelPath, _ 	destFilePath As String, _ 	overwrite As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void CopyModel( 	ModelPath^ sourceModelPath,  	String^ destFilePath,  	bool overwrite ) ``` |

#### Parameters

sourceModelPath
:   Type:  Autodesk.Revit.DB ModelPath
     The path of the file-based or server-based source model.

destFilePath
:   Type:  System String
     The path of the destination file.

overwrite
:   Type:  System Boolean
     True if the destination file can be overwritten; otherwise, false.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given path sourceModelPath is a cloud path which is not supported in this method. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions CentralModelAccessDeniedException | Access to the central model was denied. A possible reason is because the model was under maintenance. |
| Autodesk.Revit.Exceptions CentralModelException | The central model is missing. -or- An internal error happened on the central model, please contact the server administrator. |
| Autodesk.Revit.Exceptions DirectoryNotFoundException | Thrown when the directory of destination file doesn't exist. |
| Autodesk.Revit.Exceptions FileArgumentAlreadyExistsException | The destination file exists and can't be overwritten. -or- destFilePath is pointing to a folder that already exists and cannot be deleted. |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The Revit model specified by sourceModelPath doesn't exist. |
| Autodesk.Revit.Exceptions InvalidPathArgumentException | The destination file name includes one or more invalid characters. |
| Autodesk.Revit.Exceptions RevitServerCommunicationException | The server-based central model could not be accessed because of a network communication error. |
| Autodesk.Revit.Exceptions RevitServerInternalException | An internal error happened on the server, please contact the server administrator. |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### IsAlmostEqualTo Method (XYZ)

---

|  |
| --- |
| XYZ Class   See Also |

Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsAlmostEqualTo( 	XYZ source ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsAlmostEqualTo ( _ 	source As XYZ _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsAlmostEqualTo( 	XYZ^ source ) ``` |

#### Parameters

source
:   Type:  Autodesk.Revit.DB XYZ
     The vector to compare with this vector.

#### Return Value

True if the vectors are the same; otherwise, false.

# Remarks

This routine uses Revit's default tolerance to compare two vectors to see if they are almost equivalent. Because the tolerance is small enough this can also be used to compare two points.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when source is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

XYZ Class

IsAlmostEqualTo Overload

Autodesk.Revit.DB Namespace

#### RbsLossCoefficient Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Loss Coefficient"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsLossCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsLossCoefficient As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsLossCoefficient { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DividedSurfaceFacetNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Facet number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DividedSurfaceFacetNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceFacetNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DividedSurfaceFacetNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsCurvetypeDefaultElbowParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elbow"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCurvetypeDefaultElbowParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCurvetypeDefaultElbowParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCurvetypeDefaultElbowParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### VertexPositionNormalColored Constructor

---

|  |
| --- |
| VertexPositionNormalColored Class   See Also |

Constructs the vertex from a point, a normal vector, and a color.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public VertexPositionNormalColored( 	XYZ position, 	XYZ normal, 	ColorWithTransparency color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	position As XYZ, _ 	normal As XYZ, _ 	color As ColorWithTransparency _ ) ``` |

| Visual C++ |
| --- |
| ``` public: VertexPositionNormalColored( 	XYZ^ position,  	XYZ^ normal,  	ColorWithTransparency^ color ) ``` |

#### Parameters

position
:   Type:  Autodesk.Revit.DB XYZ
     The vertex's position.

normal
:   Type:  Autodesk.Revit.DB XYZ
     The vertex's normal vector.

color
:   Type:  Autodesk.Revit.DB ColorWithTransparency
     The vertex's color.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

VertexPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### Origin Property

---

|  |
| --- |
| PipeFittingAndAccessoryData Class   See Also |

The origin position of the pipe fitting or pipe accessory.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public XYZ Origin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Origin As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Origin { 	XYZ^ get (); } ``` |

# See Also

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace

#### OnLocalLinkSharedCoordinatesSaved Method

---

|  |
| --- |
| IOnLocalLinkSharedCoordinatesSavedCallback Interface   See Also |

Revit will call this method whenever shared coordinates changes are saved to a linked document provided by an IExternalResourceServer. This call is a notification to the server provider that one of their Revit or DWG links has changed locally, and they should upload the new version back to their server.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` void OnLocalLinkSharedCoordinatesSaved( 	ExternalResourceReference changedResource ) ``` |

| Visual Basic |
| --- |
| ``` Sub OnLocalLinkSharedCoordinatesSaved ( _ 	changedResource As ExternalResourceReference _ ) ``` |

| Visual C++ |
| --- |
| ``` void OnLocalLinkSharedCoordinatesSaved( 	ExternalResourceReference^ changedResource ) ``` |

#### Parameters

changedResource
:   Type:  Autodesk.Revit.DB ExternalResourceReference
     The ExternalResourceReference whose shared coordinates have been saved.

# See Also

IOnLocalLinkSharedCoordinatesSavedCallback Interface

Autodesk.Revit.DB Namespace

#### FilterToSelect Property

---

|  |
| --- |
| FilterDialog Class   See Also |

The filter element to be selected once Show is invoked.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public ElementId FilterToSelect { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FilterToSelect As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ FilterToSelect { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

#### Field Value

The default is InvalidElementId, resulting in selecting the first available (if any) FilterElement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The supplied ElementId id is not of a FilterElement. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

FilterDialog Class

Autodesk.Revit.UI Namespace

#### LoadMomentMx1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mx 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadMomentMx1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadMomentMx1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadMomentMx1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ScheduleField Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### NewOpening Method (Element, CurveArray, eRefFace)

---

|  |
| --- |
| Document Class   See Also |

Creates a new opening in a beam, brace and column.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Opening NewOpening( 	Element famInstElement, 	CurveArray profile, 	eRefFace iFace ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewOpening ( _ 	famInstElement As Element, _ 	profile As CurveArray, _ 	iFace As eRefFace _ ) As Opening ``` |

| Visual C++ |
| --- |
| ``` public: Opening^ NewOpening( 	Element^ famInstElement,  	CurveArray^ profile,  	eRefFace iFace ) ``` |

#### Parameters

famInstElement
:   Type:  Autodesk.Revit.DB Element
     host element of the opening, can be a beam, brace and column.

profile
:   Type:  Autodesk.Revit.DB CurveArray
     profile of the opening.

iFace
:   Type:  Autodesk.Revit.Creation eRefFace
     face on which opening is based on.

#### Return Value

If successful, an Opening object is returned.

# Remarks

This method forms opening on a beam, brace and column.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the family instance element does not exist in the given document. |

# See Also

Document Class

NewOpening Overload

Autodesk.Revit.Creation Namespace

#### CeilingThickness Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CeilingThickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CeilingThickness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CeilingThickness { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Directcontext3dLoaded Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Loaded"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Directcontext3dLoaded { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Directcontext3dLoaded As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Directcontext3dLoaded { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CircularDependencyConstraintError Property

---

|  |
| --- |
| BuiltInFailures RegenFailures Class   See Also |

Highlighted constraints cause a circular chain of references.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CircularDependencyConstraintError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CircularDependencyConstraintError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CircularDependencyConstraintError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RegenFailures Class

Autodesk.Revit.DB Namespace

#### PointVisibilityParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Visibility/Graphics Overrides"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PointVisibilityParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointVisibilityParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PointVisibilityParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NotSupportConcentricBend Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotSupportConcentricBend { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotSupportConcentricBend As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotSupportConcentricBend { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### SpotLightDistribution Constructor (SpotLightDistribution)

---

|  |
| --- |
| SpotLightDistribution Class   See Also |

Creates a copy of the given spotlight distribution

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public SpotLightDistribution( 	SpotLightDistribution other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	other As SpotLightDistribution _ ) ``` |

| Visual C++ |
| --- |
| ``` public: SpotLightDistribution( 	SpotLightDistribution^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.Lighting SpotLightDistribution

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SpotLightDistribution Class

SpotLightDistribution Overload

Autodesk.Revit.DB.Lighting Namespace

#### Dispose Method

---

|  |
| --- |
| BRepBuilderPersistentIds Class   See Also |

Releases all resources used by the  BRepBuilderPersistentIds

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

BRepBuilderPersistentIds Class

Autodesk.Revit.DB Namespace

#### StairsRunEndWithRiser Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End with Riser": End with Riser

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRunEndWithRiser { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRunEndWithRiser As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRunEndWithRiser { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InsertableObject Class

---

|  |
| --- |
| Members   See Also |

A base class you all types that are insertable.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class InsertableObject : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class InsertableObject _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class InsertableObject : public ElementType ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB InsertableObject
  Autodesk.Revit.DB FamilySymbol

# See Also

InsertableObject Members

Autodesk.Revit.DB Namespace

#### AnalyticalThermalResistance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Thermal Resistance (R)"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalThermalResistance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalThermalResistance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalThermalResistance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### EnableSnaps Property

---

|  |
| --- |
| ImageInstance Class   See Also |

When true the ImageInstance will have its snaps enabled, but only if  CanHaveSnaps  is true

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public bool EnableSnaps { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property EnableSnaps As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool EnableSnaps { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The image does not have snaps |

# See Also

ImageInstance Class

Autodesk.Revit.DB Namespace

#### SlantedColumnTopCutStyle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Cut Style"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SlantedColumnTopCutStyle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SlantedColumnTopCutStyle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SlantedColumnTopCutStyle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetAssociatedParts Method (Document, ElementId, Boolean, Boolean)

---

|  |
| --- |
| PartUtils Class   See Also |

Returns all Parts that are associated with the given element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetAssociatedParts( 	Document hostDocument, 	ElementId elementId, 	bool includePartsWithAssociatedParts, 	bool includeAllChildren ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetAssociatedParts ( _ 	hostDocument As Document, _ 	elementId As ElementId, _ 	includePartsWithAssociatedParts As Boolean, _ 	includeAllChildren As Boolean _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetAssociatedParts( 	Document^ hostDocument,  	ElementId^ elementId,  	bool includePartsWithAssociatedParts,  	bool includeAllChildren ) ``` |

#### Parameters

hostDocument
:   Type:  Autodesk.Revit.DB Document
     The document of the element.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     The element to be checked for associated Parts.

includePartsWithAssociatedParts
:   Type:  System Boolean
     If true, include parts that have associated parts.

includeAllChildren
:   Type:  System Boolean
     If true, return all associated Parts recursively for all children. If false, only return immediate children.

#### Return Value

Parts that are associated to the element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

GetAssociatedParts Overload

Autodesk.Revit.DB Namespace

#### RbsConduitDiameterParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Diameter(Trade Size)"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsConduitDiameterParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsConduitDiameterParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsConduitDiameterParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| PlanTopologySet Class   See Also |

Removes every item from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

PlanTopologySet Class

Autodesk.Revit.DB Namespace

#### GetLength Method

---

|  |
| --- |
| XYZ Class   See Also |

Gets the length of this vector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double GetLength() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLength As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetLength() ``` |

# Remarks

In 3-D Euclidean space, the length of the vector is the square root of the sum of the three coordinates squared.

# See Also

XYZ Class

Autodesk.Revit.DB Namespace

#### AnalysisDisplayDiagramSettings Constructor (AnalysisDisplayDiagramSettings)

---

|  |
| --- |
| AnalysisDisplayDiagramSettings Class   See Also |

Constructs a new copy of the input AnalysisDisplayDiagramSettings object.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayDiagramSettings( 	AnalysisDisplayDiagramSettings other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	other As AnalysisDisplayDiagramSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisDisplayDiagramSettings( 	AnalysisDisplayDiagramSettings^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.Analysis AnalysisDisplayDiagramSettings

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AnalysisDisplayDiagramSettings Class

AnalysisDisplayDiagramSettings Overload

Autodesk.Revit.DB.Analysis Namespace

#### DWGExportOptions Constructor (DWGExportOptions)

---

|  |
| --- |
| DWGExportOptions Class   See Also |

Constructs a new instance of DWGExportOptions as a copy of the export options.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public DWGExportOptions( 	DWGExportOptions option ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	option As DWGExportOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: DWGExportOptions( 	DWGExportOptions^ option ) ``` |

#### Parameters

option
:   Type:  Autodesk.Revit.DB DWGExportOptions
     The options to be copied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DWGExportOptions Class

DWGExportOptions Overload

Autodesk.Revit.DB Namespace

#### Reference Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Reference"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Reference { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Reference As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Reference { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### WattsPerSquareMeter Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Watts per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WattsPerSquareMeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WattsPerSquareMeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WattsPerSquareMeter { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### CouplerCoupledEngagement Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bar Engagement 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CouplerCoupledEngagement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CouplerCoupledEngagement As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CouplerCoupledEngagement { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WallTypeIncompatibleWithTapered Property

---

|  |
| --- |
| BuiltInFailures WallFailures Class   See Also |

This wall's type is not compatible with the Tapered cross-section. Tapered walls require a variable thickness layer.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WallTypeIncompatibleWithTapered { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallTypeIncompatibleWithTapered As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WallTypeIncompatibleWithTapered { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallFailures Class

Autodesk.Revit.DB Namespace

#### NumberSystemReferenceOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Offset from Reference"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NumberSystemReferenceOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NumberSystemReferenceOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NumberSystemReferenceOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HookLength0 Property

---

|  |
| --- |
| RebarBendData Class   See Also |

The extension length of the hook at the start.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double HookLength0 { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property HookLength0 As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double HookLength0 { 	double get (); 	void set (double value); } ``` |

# See Also

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace

#### BoundaryDirectionZ Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Z Translation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryDirectionZ { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryDirectionZ As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryDirectionZ { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LeaderRightAttachment Property

---

|  |
| --- |
| TextNote Class   See Also |

Attachment position of leaders on the right side of the text note.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public LeaderAtachement LeaderRightAttachment { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LeaderRightAttachment As LeaderAtachement 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property LeaderAtachement LeaderRightAttachment { 	LeaderAtachement get (); 	void set (LeaderAtachement value); } ``` |

# Remarks

The property controls the vertical position of leaders attached to the right side of the note.

Change of the value will affect all leaders currently attached to the right side.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

TextNote Class

Autodesk.Revit.DB Namespace

#### SlantedColumnBaseCutStyle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Cut Style"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SlantedColumnBaseCutStyle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SlantedColumnBaseCutStyle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SlantedColumnBaseCutStyle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetLayerSelection Method

---

|  |
| --- |
| BaseImportOptions Class   See Also |

Get all set layers name which user want to import into Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ICollection<string> GetLayerSelection() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLayerSelection As ICollection(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<String^>^ GetLayerSelection() ``` |

#### Return Value

The layers' name.

# See Also

BaseImportOptions Class

Autodesk.Revit.DB Namespace

#### AddOption Method

---

|  |
| --- |
| IFCExportOptions Class   See Also |

Adds a new named option to the options structure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void AddOption( 	string name, 	string value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddOption ( _ 	name As String, _ 	value As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddOption( 	String^ name,  	String^ value ) ``` |

#### Parameters

name
:   Type:  System String
     The option name.

value
:   Type:  System String
     The option value.

# Remarks

Named options can be used to set options not accessible through the standard IFC export user interface. It is up to the implementation of the IExporterIFC interface to customize export behavior based on these options.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCExportOptions Class

Autodesk.Revit.DB Namespace

#### RbsSection Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Section"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsSection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsSection As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsSection { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### EnergyModelType Property

---

|  |
| --- |
| EnergyAnalysisDetailModelOptions Class   See Also |

It indicates whether the energy model is based on rooms/spaces or building elements.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public EnergyModelType EnergyModelType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property EnergyModelType As EnergyModelType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property EnergyModelType EnergyModelType { 	EnergyModelType get (); 	void set (EnergyModelType value); } ``` |

# Remarks

The default value is EnergyModelType::SpatialElement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace

#### GetEnumerator Method

---

|  |
| --- |
| ReferencePointArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator^ GetEnumerator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

#### Implements

 IEnumerable GetEnumerator

# See Also

ReferencePointArray Class

Autodesk.Revit.DB Namespace

#### WattsPerSquareMeterKelvin Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Watts per square meter kelvin.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WattsPerSquareMeterKelvin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WattsPerSquareMeterKelvin As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WattsPerSquareMeterKelvin { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| AutoJoinFailedException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

AutoJoinFailedException Class

Autodesk.Revit.Exceptions Namespace

#### StructuralBeamEnd1Elevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Level Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralBeamEnd1Elevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralBeamEnd1Elevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralBeamEnd1Elevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsServiceAvailable Method

---

|  |
| --- |
| ShapeImporter Class   See Also |

Checks whether the data conversion service is available.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static bool IsServiceAvailable() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsServiceAvailable As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsServiceAvailable() ``` |

#### Return Value

True if the data conversion service is available, false otherwise.

# Remarks

ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.

# See Also

ShapeImporter Class

Autodesk.Revit.DB Namespace

#### SetFaceOffset Method

---

|  |
| --- |
| FreeFormElement Class   See Also |

Offsets a planar face of the free form element a certain distance in the normal direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetFaceOffset( 	Face face, 	double offset ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFaceOffset ( _ 	face As Face, _ 	offset As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFaceOffset( 	Face^ face,  	double offset ) ``` |

#### Parameters

face
:   Type:  Autodesk.Revit.DB Face
     The face to offset.

offset
:   Type:  System Double
     The magnitude of the offset. A positive value offsets out of the input solid. A negative value offsets into the solid shape.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | face does not belong to the solid. -or- The face to be offset should be planar and satisfy constraints of its parent element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FreeFormElement Class

Autodesk.Revit.DB Namespace

#### Position Property

---

|  |
| --- |
| VertexPosition Class   See Also |

The vertex's position.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public XYZ Position { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Position As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Position { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

VertexPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### TransactionGroup Constructor (Document)

---

|  |
| --- |
| TransactionGroup Class   See Also |

Constructs a transaction group object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TransactionGroup( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	document As Document _ ) ``` |

| Visual C++ |
| --- |
| ``` public: TransactionGroup( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document for which this transaction group is being used.

# Remarks

The group does not start until its Start method is called.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

TransactionGroup Class

TransactionGroup Overload

Autodesk.Revit.DB Namespace

#### StructuralSectionShape Property

---

|  |
| --- |
| AnalyticalMember Class   See Also |

The structural section shape of the Analytical Member.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public StructuralSectionShape StructuralSectionShape { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property StructuralSectionShape As StructuralSectionShape 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property StructuralSectionShape StructuralSectionShape { 	StructuralSectionShape get (); } ``` |

# See Also

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace

#### SetAdditionalReferencesToDimension Method

---

|  |
| --- |
| MultiReferenceAnnotationOptions Class   See Also |

Sets the additional references which the dimension will witness.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public void SetAdditionalReferencesToDimension( 	IList<Reference> referencesToDimension ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAdditionalReferencesToDimension ( _ 	referencesToDimension As IList(Of Reference) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAdditionalReferencesToDimension( 	IList<Reference^>^ referencesToDimension ) ``` |

#### Parameters

referencesToDimension
:   Type:  System.Collections.Generic IList   Reference
     The additional references which the dimension will witness.

# Remarks

The additional references to dimension cannot come from the same category as the MultiReferenceAnnotationType's reference category.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Some references come from elements which directly match the reference category required by the MultiReferenceAnnotationType. For those elements please use SetElementsToDimension. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace

#### OwnerId Property

---

|  |
| --- |
| AnalyticalLink Class   See Also |

ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId OwnerId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property OwnerId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ OwnerId { 	ElementId^ get (); } ``` |

# See Also

AnalyticalLink Class

Autodesk.Revit.DB.Structure Namespace

#### SymbolicCurveArray Constructor

---

|  |
| --- |
| SymbolicCurveArray Class   See Also |

Initializes a new instance of the  SymbolicCurveArray  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SymbolicCurveArray() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: SymbolicCurveArray() ``` |

# See Also

SymbolicCurveArray Class

Autodesk.Revit.DB Namespace

#### gbXMLBuildingType Enumeration

---

|  |
| --- |
| See Also |

Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.

This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the most predominant building use type.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum gbXMLBuildingType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration gbXMLBuildingType ``` |

| Visual C++ |
| --- |
| ``` public enum class gbXMLBuildingType ``` |

# Members

| Member name | Description |
| --- | --- |
| CustomizeBuildingType |  |
| NoBuildingType |  |
| AutomotiveFacility |  |
| ConventionCenter |  |
| Courthouse |  |
| DiningBarLoungeOrLeisure |  |
| DiningCafeteriaFastFood |  |
| DiningFamily |  |
| Dormitory |  |
| ExerciseCenter |  |
| FireStation |  |
| Gymnasium |  |
| HospitalOrHealthcare |  |
| Hotel |  |
| Library |  |
| Manufacturing |  |
| Motel |  |
| MotionPictureTheatre |  |
| MultiFamily |  |
| Museum |  |
| Office |  |
| ParkingGarage |  |
| Penitentiary |  |
| PerformingArtsTheater |  |
| PoliceStation |  |
| PostOffice |  |
| ReligiousBuilding |  |
| Retail |  |
| SchoolOrUniversity |  |
| SingleFamily |  |
| SportsArena |  |
| TownHall |  |
| Transportation |  |
| Warehouse |  |
| Workshop |  |
| NoOfBuildingTypes |  |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### Acceleration Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Acceleration, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Acceleration { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Acceleration As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Acceleration { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### Jitter Property

---

|  |
| --- |
| ViewDisplaySketchyLines Class   See Also |

The jitter defines jitteriness of the line. Values between 0 and 10.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public int Jitter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Jitter As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int Jitter { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The jitter value is not valid. The valid range is 0 to 10. |

# See Also

ViewDisplaySketchyLines Class

Autodesk.Revit.DB Namespace

#### GetFormatOptions Method

---

|  |
| --- |
| ColorFillScheme Class   See Also |

Returns the FormatOptions of the scheme.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public FormatOptions GetFormatOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFormatOptions As FormatOptions ``` |

| Visual C++ |
| --- |
| ``` public: FormatOptions^ GetFormatOptions() ``` |

# Remarks

This method will return the default FormatOptions if the scheme is by value.

# See Also

ColorFillScheme Class

Autodesk.Revit.DB Namespace

#### IFCFatalExportError Property

---

|  |
| --- |
| BuiltInFailures ExportFailures Class   See Also |

There has been an unrecoverable error during export. Export will now be aborted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId IFCFatalExportError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IFCFatalExportError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ IFCFatalExportError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ExportFailures Class

Autodesk.Revit.DB Namespace

#### RbsElecMaxPoleBreakers Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Max Number of Single Pole Breakers"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecMaxPoleBreakers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecMaxPoleBreakers As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecMaxPoleBreakers { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsDefault Property

---

|  |
| --- |
| ComponentRepeaterSlot Class   See Also |

A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsDefault { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsDefault As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsDefault { 	bool get (); } ``` |

# See Also

ComponentRepeaterSlot Class

Autodesk.Revit.DB Namespace

#### FtSup3PerMin Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol ftÂ³/min, indicating unit Cubic feet per minute.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FtSup3PerMin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FtSup3PerMin As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FtSup3PerMin { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralStartReleaseMy Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Start My"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralStartReleaseMy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralStartReleaseMy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralStartReleaseMy { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotCreateStringers Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Can't create stringers geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateStringers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateStringers As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateStringers { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### LayoutRuleFixedNumber Constructor

---

|  |
| --- |
| LayoutRuleFixedNumber Class   See Also |

Constructor of LayoutRuleFixedNumber.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public LayoutRuleFixedNumber( 	int numberOfLines ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	numberOfLines As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: LayoutRuleFixedNumber( 	int numberOfLines ) ``` |

#### Parameters

numberOfLines
:   Type:  System Int32
     The value of numberOfLines must be positive.

# Remarks

Create a LayoutRuleFixedNumber object with the number of the beams and this number must be positive.

# See Also

LayoutRuleFixedNumber Class

Autodesk.Revit.DB Namespace

#### ConnectorProfileType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shape"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ConnectorProfileType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConnectorProfileType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ConnectorProfileType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GradientNoiseLow Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "Low" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string GradientNoiseLow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GradientNoiseLow As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ GradientNoiseLow { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 1".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### StructuralSectionLangleBoltDiameterShorterFlange Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bolt Diameter Shorter Flange"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionLangleBoltDiameterShorterFlange { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionLangleBoltDiameterShorterFlange As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionLangleBoltDiameterShorterFlange { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Item Property

---

|  |
| --- |
| Definitions Class   See Also |

Retrieves a definition by a given name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Definition this[ 	string name ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Item ( _ 	name As String _ ) As Definition 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Definition^ Item[String^ name] { 	Definition^ get (String^ name); } ``` |

#### Parameters

name
:   Type:  System String
     The name of the parameter definition for which to search.

# Remarks

If the definition is not found then    a null reference (  Nothing  in Visual Basic)  will be returned.

# See Also

Definitions Class

Autodesk.Revit.DB Namespace

#### IsStructureEnabled Property

---

|  |
| --- |
| Application Class   See Also |

Checks whether or not the structure discipline is enabled, and enable or disable it.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsStructureEnabled { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsStructureEnabled As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsStructureEnabled { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### SystemsAnalysisReport Property

---

|  |
| --- |
| ExternalResourceTypes BuiltInExternalResourceTypes Class   See Also |

An external resource type representing systems analysis report path.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalResourceType SystemsAnalysisReport { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SystemsAnalysisReport As ExternalResourceType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalResourceType^ SystemsAnalysisReport { 	ExternalResourceType^ get (); } ``` |

# See Also

ExternalResourceTypes BuiltInExternalResourceTypes Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, String)

---

|  |
| --- |
| EndTreatmentType Class   Example   See Also |

Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static EndTreatmentType Create( 	Document doc, 	string strTreatment ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	doc As Document, _ 	strTreatment As String _ ) As EndTreatmentType ``` |

| Visual C++ |
| --- |
| ``` public: static EndTreatmentType^ Create( 	Document^ doc,  	String^ strTreatment ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document

strTreatment
:   Type:  System String

# Examples

 Copy  C#

```
private void NewEndTreatmentForCouplerType(Document doc, ElementId couplerTypeId)
{
    EndTreatmentType treatmentType = EndTreatmentType.Create(doc, "Custom");
    FamilySymbol couplerType = doc.GetElement(couplerTypeId) as FamilySymbol;
    Parameter param = couplerType.get_Parameter(BuiltInParameter.COUPLER_MAIN_ENDTREATMENT);
    param.Set(treatmentType.Id);
}
```

 Copy  VB.NET

```
Private Sub NewEndTreatmentForCouplerType(doc As Document, couplerTypeId As ElementId)
    Dim treatmentType As EndTreatmentType = EndTreatmentType.Create(doc, "Custom")
    Dim couplerType As FamilySymbol = TryCast(doc.GetElement(couplerTypeId), FamilySymbol)
    Dim param As Parameter = couplerType.Parameter(BuiltInParameter.COUPLER_MAIN_ENDTREATMENT)
    param.Set
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

EndTreatmentType Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### InstanceMoveBaseWithGrids Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Move Base With Grids"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId InstanceMoveBaseWithGrids { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InstanceMoveBaseWithGrids As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ InstanceMoveBaseWithGrids { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Analytical Space Resolution"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### STLExportResolution Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible options to control the tessellation quality.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2021.1
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ExportResolution' enum instead.")] public enum STLExportResolution ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ExportResolution' enum instead.")> _ Public Enumeration STLExportResolution ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ExportResolution' enum instead.")] public enum class STLExportResolution ``` |

# Members

| Member name | Description |
| --- | --- |
| Custom | STL exporting with custom resolution (all possible STL tessellation parameters have default values). |
| Fine | STL exporting with fine resolution. |
| Medium | STL exporting with medium resolution. |
| Coarse | STL exporting with coarse resolution. |

# See Also

Autodesk.Revit.DB Namespace

#### CitySetIterator Constructor

---

|  |
| --- |
| CitySetIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CitySetIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: CitySetIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

CitySetIterator Class

Autodesk.Revit.DB Namespace

#### VertexPositionColored Constructor

---

|  |
| --- |
| VertexPositionColored Class   See Also |

Constructs the vertex from a point and a color.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public VertexPositionColored( 	XYZ position, 	ColorWithTransparency color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	position As XYZ, _ 	color As ColorWithTransparency _ ) ``` |

| Visual C++ |
| --- |
| ``` public: VertexPositionColored( 	XYZ^ position,  	ColorWithTransparency^ color ) ``` |

#### Parameters

position
:   Type:  Autodesk.Revit.DB XYZ
     The vertex's position.

color
:   Type:  Autodesk.Revit.DB ColorWithTransparency
     The vertex's color.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

VertexPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### MaxNumberOfCircuits Property

---

|  |
| --- |
| ElectricalEquipment Class   See Also |

The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public int MaxNumberOfCircuits { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MaxNumberOfCircuits As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int MaxNumberOfCircuits { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The input max number of circuits value is invalid for switchboard. |
| Autodesk.Revit.Exceptions InvalidOperationException | The electrical equipment is not a switchboard equipment. |

# See Also

ElectricalEquipment Class

Autodesk.Revit.DB.Electrical Namespace

#### IFCTransformSetter Class

---

|  |
| --- |
| Members   See Also |

A state-based class that forces an extra transformation applied to objects being exported.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class IFCTransformSetter : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class IFCTransformSetter _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class IFCTransformSetter : IDisposable ``` |

# Remarks

IFC has a system of local placements; these are created from a set of transforms in Revit. Sometimes there is a need to create a 'fake' transform to get the right local placement structure for IFC. This class is intended to maintain the transformation for the duration that it is needed. To ensure that the lifetime of the object is correctly managed, you should declare an instance of this class as a part of a 'using' statement in C# or similar construct in other lanuguages.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.IFC IFCTransformSetter

# See Also

IFCTransformSetter Members

Autodesk.Revit.DB.IFC Namespace

#### IsConnectedTo Method

---

|  |
| --- |
| Connector Class   See Also |

Identifies if the connector is connected to the specified connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsConnectedTo( 	Connector connector ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsConnectedTo ( _ 	connector As Connector _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsConnectedTo( 	Connector^ connector ) ``` |

#### Parameters

connector
:   Type:  Autodesk.Revit.DB Connector

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the argument is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

Connector Class

Autodesk.Revit.DB Namespace

#### WorksetJoinWarn Property

---

|  |
| --- |
| BuiltInFailures AutoJoinFailures Class   See Also |

Two elements were not automatically joined because one or both is not editable.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WorksetJoinWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WorksetJoinWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WorksetJoinWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoJoinFailures Class

Autodesk.Revit.DB Namespace

#### CanHaveStructuralSection Method

---

|  |
| --- |
| Family Class   See Also |

Identifies if this Family can have a structural section.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool CanHaveStructuralSection() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanHaveStructuralSection As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanHaveStructuralSection() ``` |

#### Return Value

True if the Family can have structural section, false otherwise.

# See Also

Family Class

Autodesk.Revit.DB Namespace

#### DefaultConstructionMassShade Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mass Shade"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DefaultConstructionMassShade { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DefaultConstructionMassShade As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DefaultConstructionMassShade { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CommonTintToggle Property

---

|  |
| --- |
| Metal Class   See Also |

The property labeled "Tint" from the "Metal" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CommonTintToggle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CommonTintToggle As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CommonTintToggle { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Metal Class

Autodesk.Revit.DB.Visual Namespace

#### IsBubbleVisibleInView Method

---

|  |
| --- |
| DatumPlane Class   See Also |

Identifies if the bubble is visible or not in a view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsBubbleVisibleInView( 	DatumEnds datumEnd, 	View view ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsBubbleVisibleInView ( _ 	datumEnd As DatumEnds, _ 	view As View _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsBubbleVisibleInView( 	DatumEnds datumEnd,  	View^ view ) ``` |

#### Parameters

datumEnd
:   Type:  Autodesk.Revit.DB DatumEnds
     The end of the datum plane.

view
:   Type:  Autodesk.Revit.DB View
     The view on which the DatumPlane shows.

#### Return Value

True if the bubble is visible, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The datum plane cannot be visible in the view. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This datum plane doesn't support bubble operations. |

# See Also

DatumPlane Class

Autodesk.Revit.DB Namespace

#### SteelElementTaskNotFinished Property

---

|  |
| --- |
| BuiltInFailures SteelElementFailures Class   See Also |

Advance Steel tasks not finished.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SteelElementTaskNotFinished { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElementTaskNotFinished As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SteelElementTaskNotFinished { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SteelElementFailures Class

Autodesk.Revit.DB Namespace

#### ShellLayerType Enumeration

---

|  |
| --- |
| See Also |

Used to distinguish exterior and interior shell layers.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum ShellLayerType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ShellLayerType ``` |

| Visual C++ |
| --- |
| ``` public enum class ShellLayerType ``` |

# Members

| Member name | Description |
| --- | --- |
| Interior | Interior shell layer. |
| Exterior | Exterior shell layer. |

# Remarks

Used as an argument to methods of CompoundStructure that deal with shell layers.

# See Also

Autodesk.Revit.DB Namespace

#### UnstableConstraintInFamily Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Constraints between geometry in the family can behave unpredictably on parameter modification. To make the family reliable, constrain geometry to levels, reference planes, or reference lines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UnstableConstraintInFamily { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnstableConstraintInFamily As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UnstableConstraintInFamily { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### Room Class

---

|  |
| --- |
| Members   Example   See Also |

Provides access to the room topology in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public class Room : SpatialElement ``` |

| Visual Basic |
| --- |
| ``` Public Class Room _ 	Inherits SpatialElement ``` |

| Visual C++ |
| --- |
| ``` public ref class Room : public SpatialElement ``` |

# Remarks

The room object can be queried for its boundary for use in space planning tools.

# Examples

 Copy  C#

```
private void Getinfo_Room(Room room)
{
    string message = "Room: ";

    //get the name of the room
    message += "\nRoom Name: " + room.Name;

    //get the room position
    LocationPoint location = room.Location as LocationPoint;
    XYZ point = location.Point;
    message += "\nRoom position: " + XYZToString(point);

    //get the room number
    message += "\nRoom number: " + room.Number;

    IList<IList<Autodesk.Revit.DB.BoundarySegment>> segments = room.GetBoundarySegments(new SpatialElementBoundaryOptions());
    if (null != segments)  //the room may not be bound
    {
        foreach (IList<Autodesk.Revit.DB.BoundarySegment> segmentList in segments)
        {
            message += "\nBoundarySegment of the room: ";
            foreach (Autodesk.Revit.DB.BoundarySegment boundarySegment in segmentList)
            {
                // Get curve start point
                XYZ start = boundarySegment.GetCurve().GetEndPoint(0);
                message += "\nCurve start point: " + XYZToString(start);
                // Get curve end point
                XYZ end = boundarySegment.GetCurve().GetEndPoint(1);
                message += " Curve end point: " + XYZToString(end);

                // Show the boundary elements
                message += "\nBoundary element id: " + boundarySegment.ElementId.ToString();
            }
        }
    }

    TaskDialog.Show("Revit",message);
}

// output the point's three coordinates
string XYZToString(XYZ point)
{
    return "(" + point.X + ", " + point.Y + ", " + point.Z + ")";
}
```

 Copy  VB.NET

```
Private Sub Getinfo_Room(room As Room)
    Dim message As String = "Room: "

    'get the name of the room
    message += vbLf & "Room Name: " & Convert.ToString(room.Name)

    'get the room position
    Dim location As LocationPoint = TryCast(room.Location, LocationPoint)
    Dim point As XYZ = location.Point
    message += vbLf & "Room position: " & XYZToString(point)

    'get the room number
    message += vbLf & "Room number: " & Convert.ToString(room.Number)

    Dim segments As IList(Of IList(Of Autodesk.Revit.DB.BoundarySegment)) = room.GetBoundarySegments(New SpatialElementBoundaryOptions())
    If segments IsNot Nothing Then
        'the room may not be bound
        For Each segmentList As IList(Of Autodesk.Revit.DB.BoundarySegment) In segments
            message += vbLf & "BoundarySegment of the room: "
            For Each boundarySegment As Autodesk.Revit.DB.BoundarySegment In segmentList
                ' Get curve start point
          Dim start As XYZ = boundarySegment.GetCurve().GetEndPoint(0)
                message += vbLf & "Curve start point: " & XYZToString(start)
                ' Get curve end point
          Dim [end] As XYZ = boundarySegment.GetCurve().GetEndPoint(1)
                message += " Curve end point: " & XYZToString([end])

                ' Show the boundary elements
          message += vbLf & "Boundary element id: " + boundarySegment.ElementId.ToString()
            Next
        Next
    End If

    TaskDialog.Show("Revit", message)
End Sub

' output the point's three coordinates
Private Function XYZToString(point As XYZ) As String
    Return "(" & Convert.ToString(point.X) & ", " & Convert.ToString(point.Y) & ", " & Convert.ToString(point.Z) & ")"
End Function
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB SpatialElement
  Autodesk.Revit.DB.Architecture Room

# See Also

Room Members

Autodesk.Revit.DB.Architecture Namespace

#### Dispose Method

---

|  |
| --- |
| WorksetPreview Class   See Also |

Releases all resources used by the  WorksetPreview

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

WorksetPreview Class

Autodesk.Revit.DB Namespace

#### GetFaces Method

---

|  |
| --- |
| IFCGeometryInfo Class   See Also |

Gets the IfcFace handles created representing the processed geometry and stored in this object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<ICollection<IFCAnyHandle>> GetFaces() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFaces As IList(Of ICollection(Of IFCAnyHandle)) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ICollection<IFCAnyHandle^>^>^ GetFaces() ``` |

#### Return Value

The collection of face handles.

# See Also

IFCGeometryInfo Class

Autodesk.Revit.DB.IFC Namespace

#### Dispose Method

---

|  |
| --- |
| FamilyThermalProperties Class   See Also |

Releases all resources used by the  FamilyThermalProperties

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

FamilyThermalProperties Class

Autodesk.Revit.DB Namespace

#### GetGUID Method

---

|  |
| --- |
| AddInId Class   See Also |

value of the AddInId as a GUID

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public Guid GetGUID() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetGUID As Guid ``` |

| Visual C++ |
| --- |
| ``` public: Guid GetGUID() ``` |

#### Return Value

GUID value of the AddInId

# See Also

AddInId Class

Autodesk.Revit.DB Namespace

#### MatchlineBottomOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MatchlineBottomOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MatchlineBottomOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MatchlineBottomOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SolidOptions Class

---

|  |
| --- |
| Members   See Also |

A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class SolidOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class SolidOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class SolidOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB SolidOptions

# See Also

SolidOptions Members

Autodesk.Revit.DB Namespace

#### IsUpdaterRegistered Method (UpdaterId)

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

Checks whether updater with the given id is registered

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool IsUpdaterRegistered( 	UpdaterId id ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsUpdaterRegistered ( _ 	id As UpdaterId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsUpdaterRegistered( 	UpdaterId^ id ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.DB UpdaterId
     Id of the updater being tested.

#### Return Value

Returns true if the updater is registered.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

UpdaterRegistry Class

IsUpdaterRegistered Overload

Autodesk.Revit.DB Namespace

#### GetVertexStreamPositionNormal Method

---

|  |
| --- |
| VertexBuffer Class   See Also |

Gets a stream that can be used to write vertices of type  VertexPositionNormal  into the buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public VertexStreamPositionNormal GetVertexStreamPositionNormal() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetVertexStreamPositionNormal As VertexStreamPositionNormal ``` |

| Visual C++ |
| --- |
| ``` public: VertexStreamPositionNormal^ GetVertexStreamPositionNormal() ``` |

#### Return Value

The stream that can be used to write into this buffer.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space. |

# See Also

VertexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### Item Property

---

|  |
| --- |
| ReferencePointArray Class   See Also |

Gets or sets a reference at a specified index within the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual ReferencePoint this[ 	int index ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property Item ( _ 	index As Integer _ ) As ReferencePoint 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property ReferencePoint^ Item[int index] { 	ReferencePoint^ get (int index); 	void set (int index, ReferencePoint^ value); } ``` |

#### Parameters

index
:   Type:  System Int32
     The index of the reference to be set or retrieved.

#### Return Value

Returns the reference at the specified index.

# See Also

ReferencePointArray Class

Autodesk.Revit.DB Namespace

#### BoundaryConditionFamilySymbolRoller Property

---

|  |
| --- |
| StructuralSettings Class   See Also |

The id of the FamilySymbol to represent a roller boundary condition.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElementId BoundaryConditionFamilySymbolRoller { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BoundaryConditionFamilySymbolRoller As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ BoundaryConditionFamilySymbolRoller { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

StructuralSettings Class

Autodesk.Revit.DB.Structure Namespace

#### TextLabelType Property

---

|  |
| --- |
| AnalysisDisplayMarkersAndTextSettings Class   See Also |

Type of diagram text label visualization.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayStyleMarkerTextLabelType TextLabelType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TextLabelType As AnalysisDisplayStyleMarkerTextLabelType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property AnalysisDisplayStyleMarkerTextLabelType TextLabelType { 	AnalysisDisplayStyleMarkerTextLabelType get (); 	void set (AnalysisDisplayStyleMarkerTextLabelType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

AnalysisDisplayMarkersAndTextSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### DoorNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mark"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DoorNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DoorNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DoorNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| CurtainGridSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

CurtainGridSetIterator Class

Autodesk.Revit.DB Namespace

#### RbsPipeReynoldsNumberParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Reynolds Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeReynoldsNumberParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeReynoldsNumberParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeReynoldsNumberParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotGenerateRamp Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Couldn't generate surfaces for ramp.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotGenerateRamp { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotGenerateRamp As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotGenerateRamp { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### Append Method

---

|  |
| --- |
| IntersectionResultArray Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Append( 	IntersectionResult item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Append ( _ 	item As IntersectionResult _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Append( 	IntersectionResult^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB IntersectionResult

# See Also

IntersectionResultArray Class

Autodesk.Revit.DB Namespace

#### RbsPipeJointtypeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Connection Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeJointtypeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeJointtypeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeJointtypeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InsertWaypoint Method

---

|  |
| --- |
| PathOfTravel Class   See Also |

Insert a waypoint at the specified index

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020.2

# Syntax

| C# |
| --- |
| ``` public void InsertWaypoint( 	XYZ waypoint, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub InsertWaypoint ( _ 	waypoint As XYZ, _ 	index As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void InsertWaypoint( 	XYZ^ waypoint,  	int index ) ``` |

#### Parameters

waypoint
:   Type:  Autodesk.Revit.DB XYZ
     The waypoint to insert.

index
:   Type:  System Int32
     The index to insert the waypoint at.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Index is invalid for an existing or new waypoint for this path. -or- This functionality is not available in Revit LT. -or- Cannot perform this operation for a path of travel in a group. |

# See Also

PathOfTravel Class

Autodesk.Revit.DB.Analysis Namespace

#### HvacSlope Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Slope, in discipline HVAC.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HvacSlope { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HvacSlope As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HvacSlope { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### GetGBSId Method

---

|  |
| --- |
| ConceptualConstructionType Class   See Also |

Gets the Green Building Studio identifier associated with the construction.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public int GetGBSId( 	ElementId massSurfaceSubCategoryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetGBSId ( _ 	massSurfaceSubCategoryId As ElementId _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetGBSId( 	ElementId^ massSurfaceSubCategoryId ) ``` |

#### Parameters

massSurfaceSubCategoryId
:   Type:  Autodesk.Revit.DB ElementId
     The ElementId of a valid Mass subcategory of a MassSurfaceData.

#### Return Value

Returns the integer id used to represent the ConceptualConstructionType.

# Remarks

Sometimes the GBSId is different for the same ConceptualConstructionType depending on the mass subcategory it is related to. This is usually the case, for example, for window and skylight constructions, which do not share GBSid's even when they share ConceptualConstructionTypes.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input Element massSurfaceSubCategoryId is not a valid subcategory value for MassSurfaceData. -or- The ElementId massSurfaceSubCategoryId is not appropriate for this ConceptualConstructionType. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace

#### SetShearModulus Method

---

|  |
| --- |
| StructuralAsset Class   See Also |

Sets the shear modulus of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetShearModulus( 	double shearModulus ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetShearModulus ( _ 	shearModulus As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetShearModulus( 	double shearModulus ) ``` |

#### Parameters

shearModulus
:   Type:  System Double

# Remarks

The shear modulus is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value. The value is in Newtons per foot meter (N/(ft Â· m)).

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace

#### IsTaggingLink Property

---

|  |
| --- |
| SpatialElementTag Class   See Also |

Identifies if the tag has reference to a spatial element in a linked document or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool IsTaggingLink { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsTaggingLink As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsTaggingLink { 	bool get (); } ``` |

# See Also

SpatialElementTag Class

Autodesk.Revit.DB Namespace

#### GutterType Property

---

|  |
| --- |
| Gutter Class   See Also |

Retrieves/set an object that represents the type of the Gutter.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public GutterType GutterType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property GutterType As GutterType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property GutterType^ GutterType { 	GutterType^ get (); 	void set (GutterType^ value); } ``` |

# See Also

Gutter Class

Autodesk.Revit.DB.Architecture Namespace

#### SampleValue Property

---

|  |
| --- |
| TableCellCombinedParameterData Class   See Also |

The sample/example value for the parameter in text form

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public string SampleValue { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SampleValue As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ SampleValue { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TableCellCombinedParameterData Class

Autodesk.Revit.DB Namespace

#### ApparentCurrent Property

---

|  |
| --- |
| ElectricalSystem Class   See Also |

The ApparentCurrent value of the Electrical System.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double ApparentCurrent { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ApparentCurrent As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ApparentCurrent { 	double get (); } ``` |

# Remarks

This property is used to retrieve the ApparentCurrent value of the Electrical System.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This property only available when System Type is Power! |

# See Also

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace

#### GetHookRotationAngle Method

---

|  |
| --- |
| RebarShape Class   See Also |

Gets the out of plane hook rotation angle at the specified end.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public double GetHookRotationAngle( 	int iEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHookRotationAngle ( _ 	iEnd As Integer _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetHookRotationAngle( 	int iEnd ) ``` |

#### Parameters

iEnd
:   Type:  System Int32
     0 for the start , 1 for the end.

#### Return Value

Returns the out of plane hook rotation angle at the specified end.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | iEnd must be 0 or 1. |

# See Also

RebarShape Class

Autodesk.Revit.DB.Structure Namespace

#### GetBoundaries Method

---

|  |
| --- |
| FaceSplitter Class   See Also |

Gets the boundaries.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public IList<CurveLoop> GetBoundaries() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBoundaries As IList(Of CurveLoop) ``` |

| Visual C++ |
| --- |
| ``` public: IList<CurveLoop^>^ GetBoundaries() ``` |

#### Return Value

The face splitter boundaries.

# See Also

FaceSplitter Class

Autodesk.Revit.DB Namespace

#### IsDone Method

---

|  |
| --- |
| ExportLayerTableIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

ExportLayerTableIterator Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.RevisionFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Revision Settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class RevisionFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class RevisionFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class RevisionFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures RevisionFailures

# See Also

BuiltInFailures RevisionFailures Members

Autodesk.Revit.DB Namespace

#### PaperFormat Property

---

|  |
| --- |
| PDFExportOptions Class   See Also |

Paper format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public ExportPaperFormat PaperFormat { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PaperFormat As ExportPaperFormat 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ExportPaperFormat PaperFormat { 	ExportPaperFormat get (); 	void set (ExportPaperFormat value); } ``` |

# Remarks

When the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The input paper format is invalid |

# See Also

PDFExportOptions Class

Autodesk.Revit.DB Namespace

#### ViewType Property

---

|  |
| --- |
| View Class   Example   See Also |

The type of the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ViewType ViewType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ViewType As ViewType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ViewType ViewType { 	ViewType get (); } ``` |

# Examples

 Copy  C#

```
public void GetViewType(Autodesk.Revit.DB.View view)
{
    // Get the view type of the given view, and format the prompt string
    String prompt = "The view is ";

    switch (view.ViewType)
    {
        case ViewType.AreaPlan:
            prompt += "an area view.";
            break;
        case ViewType.CeilingPlan:
            prompt += "a reflected ceiling plan view.";
            break;
        case ViewType.ColumnSchedule:
            prompt += "a column schedule view.";
            break;
        case ViewType.CostReport:
            prompt += "a cost report view.";
            break;
        case ViewType.Detail:
            prompt += "a detail view.";
            break;
        case ViewType.DraftingView:
            prompt += "a drafting view.";
            break;
        case ViewType.DrawingSheet:
            prompt += "a drawing sheet view.";
            break;
        case ViewType.Elevation:
            prompt += "an elevation view.";
            break;
        case ViewType.EngineeringPlan:
            prompt += "an engineering view.";
            break;
        case ViewType.FloorPlan:
            prompt += "afloor plan view.";
            break;
        case ViewType.Internal:
            prompt += "Revit's internal view.";
            break;
        case ViewType.Legend:
            prompt += "a legend view.";
            break;
        case ViewType.LoadsReport:
            prompt += "a loads report view.";
            break;
        case ViewType.PanelSchedule:
            prompt += "a panel schedule view.";
            break;
        case ViewType.PresureLossReport:
            prompt += "a pressure loss report view.";
            break;
        case ViewType.Rendering:
            prompt += "a rendering view.";
            break;
        case ViewType.Report:
            prompt += "a report view.";
            break;
        case ViewType.Schedule:
            prompt += "a schedule view.";
            break;
        case ViewType.Section:
            prompt += "a cross section view.";
            break;
        case ViewType.ThreeD:
            prompt += "a 3-D view.";
            break;
        case ViewType.Undefined:
            prompt += "an undefined/unspecified view.";
            break;
        case ViewType.Walkthrough:
            prompt += "a walkthrough view.";
            break;
        default:
            break;
    }

    // Give the user some information
    TaskDialog.Show("Revit",prompt);
}
```

 Copy  VB.NET

```
Public Sub GetViewType(view As Autodesk.Revit.DB.View)
    ' Get the view type of the given view, and format the prompt string
    Dim prompt As [String] = "The view is "

    Select Case view.ViewType
        Case ViewType.AreaPlan
            prompt += "an area view."
            Exit Select
        Case ViewType.CeilingPlan
            prompt += "a reflected ceiling plan view."
            Exit Select
        Case ViewType.ColumnSchedule
            prompt += "a column schedule view."
            Exit Select
        Case ViewType.CostReport
            prompt += "a cost report view."
            Exit Select
        Case ViewType.Detail
            prompt += "a detail view."
            Exit Select
        Case ViewType.DraftingView
            prompt += "a drafting view."
            Exit Select
        Case ViewType.DrawingSheet
            prompt += "a drawing sheet view."
            Exit Select
        Case ViewType.Elevation
            prompt += "an elevation view."
            Exit Select
        Case ViewType.EngineeringPlan
            prompt += "an engineering view."
            Exit Select
        Case ViewType.FloorPlan
            prompt += "afloor plan view."
            Exit Select
        Case ViewType.Internal
            prompt += "Revit's internal view."
            Exit Select
        Case ViewType.Legend
            prompt += "a legend view."
            Exit Select
        Case ViewType.LoadsReport
            prompt += "a loads report view."
            Exit Select
        Case ViewType.PanelSchedule
            prompt += "a panel schedule view."
            Exit Select
        Case ViewType.PresureLossReport
            prompt += "a pressure loss report view."
            Exit Select
        Case ViewType.Rendering
            prompt += "a rendering view."
            Exit Select
        Case ViewType.Report
            prompt += "a report view."
            Exit Select
        Case ViewType.Schedule
            prompt += "a schedule view."
            Exit Select
        Case ViewType.Section
            prompt += "a cross section view."
            Exit Select
        Case ViewType.ThreeD
            prompt += "a 3-D view."
            Exit Select
        Case ViewType.Undefined
            prompt += "an undefined/unspecified view."
            Exit Select
        Case ViewType.Walkthrough
            prompt += "a walkthrough view."
            Exit Select
        Case Else
            Exit Select
    End Select

    ' Give the user some information
    TaskDialog.Show("Revit", prompt)
End Sub
```

# See Also

View Class

Autodesk.Revit.DB Namespace

#### IsInside Method (UV)

---

|  |
| --- |
| Face Class   See Also |

Indicates whether the specified point is within this face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public bool IsInside( 	UV point ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsInside ( _ 	point As UV _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsInside( 	UV^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB UV
     The parameters to be evaluated, in natural parameterization of the face.

#### Return Value

True if point is within this face or on its boundary, otherwise false.

# See Also

Face Class

IsInside Overload

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| InvalidObjectException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

InvalidObjectException Class

Autodesk.Revit.Exceptions Namespace

#### GetObjectData Method

---

|  |
| --- |
| CorruptModelException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

CorruptModelException Class

Autodesk.Revit.Exceptions Namespace

#### ReferenceCurve Property

---

|  |
| --- |
| HostedSweep Class   See Also |

The curve on which the hosted sweep segment is created.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Curve this[ 	Reference targetRef ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ReferenceCurve ( _ 	targetRef As Reference _ ) As Curve 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Curve^ ReferenceCurve[Reference^ targetRef] { 	Curve^ get (Reference^ targetRef); } ``` |

#### Parameters

targetRef
:   Type:  Autodesk.Revit.DB Reference
     Reference of the curve that hosts the object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when regeneration fails. |

# See Also

HostedSweep Class

Autodesk.Revit.DB Namespace

#### CircuitWorksetClosedWarning Property

---

|  |
| --- |
| BuiltInFailures SystemsFailures Class   See Also |

The workset of the circuit is closed so the circuit path will not be displayed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CircuitWorksetClosedWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CircuitWorksetClosedWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CircuitWorksetClosedWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SystemsFailures Class

Autodesk.Revit.DB Namespace

#### GetDesignElementAndFabricationPartsWithDifferentOffsets Method

---

|  |
| --- |
| DesignToFabricationConverter Class   See Also |

Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IDictionary<ElementId, ISet<ElementId>> GetDesignElementAndFabricationPartsWithDifferentOffsets() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDesignElementAndFabricationPartsWithDifferentOffsets As IDictionary(Of ElementId, ISet(Of ElementId)) ``` |

| Visual C++ |
| --- |
| ``` public: IDictionary<ElementId^, ISet<ElementId^>^>^ GetDesignElementAndFabricationPartsWithDifferentOffsets() ``` |

#### Return Value

A map of design element identifiers that were not converted and the associated set fabrication parts left with different offsets.

# Remarks

This set of element identifiers is only available after the  **Convert**  method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.

# See Also

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace

#### GetVendorId Method

---

|  |
| --- |
| IExternalServer Interface   See Also |

Implement this method to return the id of the vendor of the server.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` string GetVendorId() ``` |

| Visual Basic |
| --- |
| ``` Function GetVendorId As String ``` |

| Visual C++ |
| --- |
| ``` String^ GetVendorId() ``` |

#### Return Value

Vendor Id of the server.

# Remarks

The Id is expected to be a string consisting of 4 characters.

# See Also

IExternalServer Interface

Autodesk.Revit.DB.ExternalService Namespace

#### ForwardIterator Method

---

|  |
| --- |
| CitySet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CitySetIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As CitySetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual CitySetIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

# See Also

CitySet Class

Autodesk.Revit.DB Namespace

#### AnalysisDisplayColorEntry Constructor (Color)

---

|  |
| --- |
| AnalysisDisplayColorEntry Class   See Also |

Constructs a color entry with no value assigned.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayColorEntry( 	Color color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	color As Color _ ) ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisDisplayColorEntry( 	Color^ color ) ``` |

#### Parameters

color
:   Type:  Autodesk.Revit.DB Color
     Color assigned to the entry.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AnalysisDisplayColorEntry Class

AnalysisDisplayColorEntry Overload

Autodesk.Revit.DB.Analysis Namespace

#### FloorsOverlap Property

---

|  |
| --- |
| BuiltInFailures OverlapFailures Class   See Also |

Highlighted floors overlap.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FloorsOverlap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FloorsOverlap As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FloorsOverlap { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures OverlapFailures Class

Autodesk.Revit.DB Namespace

#### UseDigitGrouping Property

---

|  |
| --- |
| FormatOptions Class   See Also |

Indicates if digit grouping symbols should be displayed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool UseDigitGrouping { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UseDigitGrouping As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool UseDigitGrouping { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

True if digit grouping symbols should be displayed, false otherwise. The default is false.

# Remarks

When UseDigitGrouping is true, digit grouping symbols (i.e. thousands separators) will be displayed when needed. For example, 123456789.00 may be displayed as 123,456,789.00. The precise display is determined by the DigitGroupingSymbol and DigitGroupingAmount properties of the Units class.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also

FormatOptions Class

Autodesk.Revit.DB Namespace

#### ThermalAssetId Property

---

|  |
| --- |
| Material Class   See Also |

The ElementId of the thermal PropertySetElement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId ThermalAssetId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ThermalAssetId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ThermalAssetId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

Material Class

Autodesk.Revit.DB Namespace

#### IsValidSymbol Method (ForgeTypeId)

---

|  |
| --- |
| FormatOptions Class   See Also |

Checks whether a symbol is valid for the unit in this FormatOptions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidSymbol( 	ForgeTypeId symbolTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidSymbol ( _ 	symbolTypeId As ForgeTypeId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidSymbol( 	ForgeTypeId^ symbolTypeId ) ``` |

#### Parameters

symbolTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     Identifier of the symbol to check.

#### Return Value

True if the symbol is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also

FormatOptions Class

IsValidSymbol Overload

Autodesk.Revit.DB Namespace

#### UpDirection Property

---

|  |
| --- |
| TextElement Class   See Also |

Direction along the vertical axis of letters of the text note.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ UpDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property UpDirection As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ UpDirection { 	XYZ^ get (); } ``` |

# Remarks

This vector points up from the base of the letters and is always perpendicular to the base direction. Those two vectors together define the plane of the text.

# See Also

TextElement Class

Autodesk.Revit.DB Namespace

#### TypeName Property

---

|  |
| --- |
| NestedFamilyTypeReference Class   See Also |

Type of the referenced family

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public string TypeName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TypeName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ TypeName { 	String^ get (); } ``` |

# See Also

NestedFamilyTypeReference Class

Autodesk.Revit.DB Namespace

#### FlangeFillet Property

---

|  |
| --- |
| StructuralSectionGeneralT Class   See Also |

Flange Fillet - fillet radius at the flange end.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double FlangeFillet { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlangeFillet As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double FlangeFillet { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### Origin Property

---

|  |
| --- |
| ClipPlane Class   See Also |

The plane's origin.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public XYZ Origin { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Origin As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Origin { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ClipPlane Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### GroupCannotSaveWarn Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

The group cannot be saved at this time because one of its instances is being edited.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId GroupCannotSaveWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GroupCannotSaveWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ GroupCannotSaveWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### PlasticvinylPattern Property

---

|  |
| --- |
| PlasticVinyl Class   See Also |

The property labeled "Relief Pattern" from the "PlasticVinyl" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string PlasticvinylPattern { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlasticvinylPattern As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ PlasticvinylPattern { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylPatternType".

# See Also

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace

#### CurtainGridU Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"U Grid"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtainGridU { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtainGridU As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtainGridU { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### SetMajorLayoutAsActualSpacing Method

---

|  |
| --- |
| FabricSheetType Class   See Also |

Sets the major layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetMajorLayoutAsActualSpacing( 	double overallWidth, 	double minorStartOverhang, 	double spacing ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetMajorLayoutAsActualSpacing ( _ 	overallWidth As Double, _ 	minorStartOverhang As Double, _ 	spacing As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetMajorLayoutAsActualSpacing( 	double overallWidth,  	double minorStartOverhang,  	double spacing ) ``` |

#### Parameters

overallWidth
:   Type:  System Double
     The entire width of the wire sheet in the minor direction.

minorStartOverhang
:   Type:  System Double
     The distance from the edge of the sheet to the first wire in the minor direction.

spacing
:   Type:  System Double
     The distance between the wires in the major direction.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for overallWidth is not a number -or- The given value for minorStartOverhang is not a number -or- The given value for spacing is not a number -or- The arguments are not consistent, please specify proper input values. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for overallWidth must be greater than 0 and no more than 30000 feet. -or- The given value for minorStartOverhang must be between 0 and 30000 feet. -or- The given value for spacing must be greater than 0 and no more than 30000 feet. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

FabricSheetType Class

Autodesk.Revit.DB.Structure Namespace

#### ClearCutLayerModifiers Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Clears all the cut layer modifiers stored in the layer info.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void ClearCutLayerModifiers() ``` |

| Visual Basic |
| --- |
| ``` Public Sub ClearCutLayerModifiers ``` |

| Visual C++ |
| --- |
| ``` public: void ClearCutLayerModifiers() ``` |

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace

#### CreateSheetList Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Creates a sheet list.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ViewSchedule CreateSheetList( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateSheetList ( _ 	document As Document _ ) As ViewSchedule ``` |

| Visual C++ |
| --- |
| ``` public: static ViewSchedule^ CreateSheetList( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the new schedule will be added.

#### Return Value

The newly created schedule.

# Remarks

A sheet list is a schedule of sheets in the project. It is a schedule of the Sheets category.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### AddValueString Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Adds a string value to a built-in parameter.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static void AddValueString( 	Element element, 	ElementId builtInParameter, 	string propertyValue ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub AddValueString ( _ 	element As Element, _ 	builtInParameter As ElementId, _ 	propertyValue As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void AddValueString( 	Element^ element,  	ElementId^ builtInParameter,  	String^ propertyValue ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The element.

builtInParameter
:   Type:  Autodesk.Revit.DB ElementId
     The built-in parameter id.

propertyValue
:   Type:  System String
     The new value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### Name Property

---

|  |
| --- |
| WireConduitType Class   See Also |

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string Name { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Name As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Name { 	String^ get (); } ``` |

# See Also

WireConduitType Class

Autodesk.Revit.DB.Electrical Namespace

#### GetEnumerator Method

---

|  |
| --- |
| GroundConductorSizeSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator^ GetEnumerator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

#### Implements

 IEnumerable GetEnumerator

# See Also

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### Current Property

---

|  |
| --- |
| ConnectorSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

ConnectorSetIterator Class

Autodesk.Revit.DB Namespace

#### WaveWaveLenMin Property

---

|  |
| --- |
| Wave Class   See Also |

The property labeled "Len Min" from the "Wave" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WaveWaveLenMin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WaveWaveLenMin As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WaveWaveLenMin { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

# See Also

Wave Class

Autodesk.Revit.DB.Visual Namespace

#### GBXMLImportOptions Class

---

|  |
| --- |
| Members   See Also |

Import options for Green-Building XML format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class GBXMLImportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class GBXMLImportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class GBXMLImportOptions ``` |

# Remarks

Not used currently. Reserved for future use.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB GBXMLImportOptions

# See Also

GBXMLImportOptions Members

Autodesk.Revit.DB Namespace

#### GetAddInNameFromDocument Method

---

|  |
| --- |
| AddInId Class   See Also |

name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string GetAddInNameFromDocument( 	Document aDoc ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAddInNameFromDocument ( _ 	aDoc As Document _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetAddInNameFromDocument( 	Document^ aDoc ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     target document

#### Return Value

name of application

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

AddInId Class

Autodesk.Revit.DB Namespace

#### StairsAttrTreadWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Width"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrTreadWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrTreadWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrTreadWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DocumentPrinting Event

---

|  |
| --- |
| Document Class   See Also |

Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentPrintingEventArgs> DocumentPrinting ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentPrinting As EventHandler(Of DocumentPrintingEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentPrintingEventArgs^>^ DocumentPrinting { 	void add (EventHandler<DocumentPrintingEventArgs^>^ value); 	void remove (EventHandler<DocumentPrintingEventArgs^>^ value); } ``` |

# Remarks

This event is raised when Revit is just about to print a view or ViewSet of the document.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The following API functions are not available for current document during this event:

* All overloads of Autodesk.Revit.DB.Document.Export()
* Autodesk::Revit::DB::Document::Print
* Print  and similar overloads.
* SubmitPrint  and similar overloads.
* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

After this event, for each view being printed,  ViewPrinting  and  ViewPrinted  events will be raised. Another event  DocumentPrinted  will be raised immediately after document printing is finished.

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| DuplicateTypeNamesHandlerArgs Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace

#### IfcGuid Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"IfcGUID"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IfcGuid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IfcGuid As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IfcGuid { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Releases all resources used by the  CurveLoop

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### MepPipeUpperInvertElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Upper End Invert Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepPipeUpperInvertElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepPipeUpperInvertElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepPipeUpperInvertElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GroundConductorNum Property

---

|  |
| --- |
| Wire Class   See Also |

The ground conductor number. Its default value is zero after created.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int GroundConductorNum { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property GroundConductorNum As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int GroundConductorNum { 	int get (); 	void set (int value); } ``` |

# See Also

Wire Class

Autodesk.Revit.DB.Electrical Namespace

#### GetDiscipline Method

---

|  |
| --- |
| UnitUtils Class   See Also |

Gets the discipline for a given measurable spec.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GetDiscipline( 	ForgeTypeId specTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetDiscipline ( _ 	specTypeId As ForgeTypeId _ ) As ForgeTypeId ``` |

| Visual C++ |
| --- |
| ``` public: static ForgeTypeId^ GetDiscipline( 	ForgeTypeId^ specTypeId ) ``` |

#### Parameters

specTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     Identifier of the measurable spec.

#### Return Value

Identifier of the discipline.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

UnitUtils Class

Autodesk.Revit.DB Namespace

#### ComputeDerivatives Method

---

|  |
| --- |
| Face Class   See Also |

Returns the first partial derivatives of the underlying surface at the specified point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public Transform ComputeDerivatives( 	UV point ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ComputeDerivatives ( _ 	point As UV _ ) As Transform ``` |

| Visual C++ |
| --- |
| ``` public: Transform^ ComputeDerivatives( 	UV^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB UV
     The parameters to be evaluated, in natural parameterization of the face.

#### Return Value

A transformation containing tangent vectors and a normal vector.

# Remarks

The following is the meaning of the transformation members:

* Origin is the point on the face (equivalent to  Evaluate(UV)  );
* BasisX is the tangent vector along the U coordinate (partial derivative with respect to U).
* BasisY is the tangent vector along the V coordinate (partial derivative with respect to V).
* BasisZ is the underlying surface's normal vector. This is not necessarily aligned with the normal vector pointing out of a solid that contains the face, to get that value use  ComputeNormal(UV)  .

None of the vectors are normalized.

# See Also

Face Class

Autodesk.Revit.DB Namespace

#### StructuralSectionCommonPlasticModulusStrongAxis Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Plastic Modulus strong axis"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionCommonPlasticModulusStrongAxis { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionCommonPlasticModulusStrongAxis As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionCommonPlasticModulusStrongAxis { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PlanViewViewDir Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"View Direction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PlanViewViewDir { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlanViewViewDir As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PlanViewViewDir { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetIntersectingElements Method

---

|  |
| --- |
| DividedPath Class   See Also |

Set the elements whose intersection with path produces points.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetIntersectingElements( 	ICollection<ElementId> intersectors ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetIntersectingElements ( _ 	intersectors As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetIntersectingElements( 	ICollection<ElementId^>^ intersectors ) ``` |

#### Parameters

intersectors
:   Type:  System.Collections.Generic ICollection   ElementId

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Not all intersecting elements in intersectors are valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| KeyBasedTreeEntriesIterator Class   See Also |

Releases all resources used by the  KeyBasedTreeEntriesIterator

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

# See Also

KeyBasedTreeEntriesIterator Class

Autodesk.Revit.DB Namespace

#### WeatherStation Property

---

|  |
| --- |
| City Class   See Also |

An identifier for the nearest weather station

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string WeatherStation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property WeatherStation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ WeatherStation { 	String^ get (); } ``` |

# Remarks

A read only string property that contains an identifier of the nearest weather station.

# See Also

City Class

Autodesk.Revit.DB Namespace

#### SetDefaultEntity Method

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropData Class   See Also |

Stores the default entity in the data.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetDefaultEntity( 	Entity defaultEntity ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDefaultEntity ( _ 	defaultEntity As Entity _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetDefaultEntity( 	Entity^ defaultEntity ) ``` |

#### Parameters

defaultEntity
:   Type:  Autodesk.Revit.DB.ExtensibleStorage Entity
     The Entity to be stored.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Writing of Entities of this Schema is not allowed to the current add-in. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DuctFittingAndAccessoryPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace

#### StartPoint Property

---

|  |
| --- |
| LineLoad Class   See Also |

Returns the three dimensional location of the start point for the line load.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ StartPoint { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property StartPoint As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ StartPoint { 	XYZ^ get (); } ``` |

# Remarks

The location of the start point is measured in decimal feet.

# See Also

LineLoad Class

Autodesk.Revit.DB.Structure Namespace

#### Create Method (Document, View, ICollection(ElementId), Int32, XYZ, ArrayAnchorMember)

---

|  |
| --- |
| LinearArray Class   See Also |

Creates a new linear array element from a set of elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static LinearArray Create( 	Document aDoc, 	View dBView, 	ICollection<ElementId> ids, 	int count, 	XYZ translationToAnchorMember, 	ArrayAnchorMember anchorMember ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDoc As Document, _ 	dBView As View, _ 	ids As ICollection(Of ElementId), _ 	count As Integer, _ 	translationToAnchorMember As XYZ, _ 	anchorMember As ArrayAnchorMember _ ) As LinearArray ``` |

| Visual C++ |
| --- |
| ``` public: static LinearArray^ Create( 	Document^ aDoc,  	View^ dBView,  	ICollection<ElementId^>^ ids,  	int count,  	XYZ^ translationToAnchorMember,  	ArrayAnchorMember anchorMember ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     The document.

dBView
:   Type:  Autodesk.Revit.DB View
     The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements. If elements include view-specific elements, they must belong to this view.

ids
:   Type:  System.Collections.Generic ICollection   ElementId
     The elements to array.

count
:   Type:  System Int32
     The number of array members to create including the initial element grouping. Must between 2 and 200.

translationToAnchorMember
:   Type:  Autodesk.Revit.DB XYZ
     The translation vector for the array.

anchorMember
:   Type:  Autodesk.Revit.DB ArrayAnchorMember
     Indicates if the translation vector specifies the location of the second member of the array, or the last member of the array.

#### Return Value

The new linear array element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given element id set is empty. -or- One or more elements in ids do not exist in the document. -or- One or more elements in ids is owned by different views and thus cannot be arrayed together. -or- One or more elements in ids is not arrayable. -or- count must be between 2 and 200. -or- The view is invalid for specific view elements array. -or- The translation point vector is invalid to array the element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to create the linear array. |

# See Also

LinearArray Class

Create Overload

Autodesk.Revit.DB Namespace

#### SteelElemCoating Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Coating"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemCoating { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemCoating As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemCoating { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextBoxVisibility Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Show Border"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TextBoxVisibility { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextBoxVisibility As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TextBoxVisibility { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsWireNeutralModeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Neutral Size"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsWireNeutralModeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsWireNeutralModeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsWireNeutralModeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RoomOutdoorAirInfoParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Outdoor Air Information"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomOutdoorAirInfoParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomOutdoorAirInfoParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomOutdoorAirInfoParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WallNominalThickness Property

---

|  |
| --- |
| StructuralSectionGeneralR Class   See Also |

Represents wall nominal thickness of rectangle.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double WallNominalThickness { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property WallNominalThickness As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double WallNominalThickness { 	double get (); 	void set (double value); } ``` |

# Remarks

Nominal is measured real value of profile, should be thicker than designed. In EN standard it is marked as "d". //Need to be verified!!!!!!! In ACI standard it is marked as "d". //Need to be verified!!!!!!!

# See Also

StructuralSectionGeneralR Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### AssemblyDifferenceConfiguration Class

---

|  |
| --- |
| Members   See Also |

The two assemblies being compared have different spatial configuration

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class AssemblyDifferenceConfiguration : AssemblyDifference ``` |

| Visual Basic |
| --- |
| ``` Public Class AssemblyDifferenceConfiguration _ 	Inherits AssemblyDifference ``` |

| Visual C++ |
| --- |
| ``` public ref class AssemblyDifferenceConfiguration : public AssemblyDifference ``` |

# Remarks

Assemblies resulting in this difference might be made up of identical elements, but the elements are not arranged in space relative to each other in the same way.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB AssemblyDifference
  Autodesk.Revit.DB AssemblyDifferenceConfiguration

# See Also

AssemblyDifferenceConfiguration Members

Autodesk.Revit.DB Namespace

#### IsPanelScheduleTemplate Method

---

|  |
| --- |
| PanelScheduleView Class   See Also |

Check if this is a panel schedule template.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsPanelScheduleTemplate() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsPanelScheduleTemplate As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsPanelScheduleTemplate() ``` |

#### Return Value

Check if this is a panel schedule template.

# See Also

PanelScheduleView Class

Autodesk.Revit.DB.Electrical Namespace

#### ImportScaleTooLarge Property

---

|  |
| --- |
| BuiltInFailures ImportFailures Class   See Also |

This scale factor would make the imported object too large. Reverting to the previous scale factor.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ImportScaleTooLarge { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ImportScaleTooLarge As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ImportScaleTooLarge { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ImportFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| BalusterPlacement Class   See Also |

Releases all resources used by the  BalusterPlacement

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace

#### PointElementHostedOnFaceUParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Hosted U Parameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PointElementHostedOnFaceUParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointElementHostedOnFaceUParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PointElementHostedOnFaceUParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SecondaryHandrailType Property

---

|  |
| --- |
| RailingType Class   See Also |

The type of the secondary handrail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId SecondaryHandrailType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SecondaryHandrailType As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ SecondaryHandrailType { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The handRailTypeId is not a valid hand rail type. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

RailingType Class

Autodesk.Revit.DB.Architecture Namespace

#### CircuitPathMode Property

---

|  |
| --- |
| ElectricalSystem Class   See Also |

The circuit path mode of the electrical system.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public ElectricalCircuitPathMode CircuitPathMode { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CircuitPathMode As ElectricalCircuitPathMode 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElectricalCircuitPathMode CircuitPathMode { 	ElectricalCircuitPathMode get (); 	void set (ElectricalCircuitPathMode value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The electrical system circuit path does not have customized path, so the CircuitPathMode cannot be set as Custom. |

# See Also

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace

#### AreaTagType Class

---

|  |
| --- |
| Members   See Also |

An object that represents an Area Tag style.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class AreaTagType : FamilySymbol ``` |

| Visual Basic |
| --- |
| ``` Public Class AreaTagType _ 	Inherits FamilySymbol ``` |

| Visual C++ |
| --- |
| ``` public ref class AreaTagType : public FamilySymbol ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB InsertableObject
  Autodesk.Revit.DB FamilySymbol
  Autodesk.Revit.DB AreaTagType

# See Also

AreaTagType Members

Autodesk.Revit.DB Namespace

#### LoadFamilySymbol Method (String, String)

---

|  |
| --- |
| Document Class   See Also |

Loads only a specified family type/symbol from a family file into the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool LoadFamilySymbol( 	string filename, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Function LoadFamilySymbol ( _ 	filename As String, _ 	name As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool LoadFamilySymbol( 	String^ filename,  	String^ name ) ``` |

#### Parameters

filename
:   Type:  System String
     The fully qualified filename of the Family file, usually ending in .rfa.

name
:   Type:  System String
     The name of the type/symbol to be loaded, such as "W11x14".

#### Return Value

True if the family type/symbol was loaded successfully into the project, otherwise False.

# Remarks

This function supports loading of types/symbols stored in the family, or those available in the family Type Catalog file.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when filename or name is    a null reference (  Nothing  in Visual Basic)  or empty. |

# See Also

Document Class

LoadFamilySymbol Overload

Autodesk.Revit.DB Namespace

#### GetKeys Method

---

|  |
| --- |
| ExportLinetypeTable Class   See Also |

Gets all the keys stored in the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public IList<ExportLinetypeKey> GetKeys() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetKeys As IList(Of ExportLinetypeKey) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ExportLinetypeKey^>^ GetKeys() ``` |

#### Return Value

The keys.

# See Also

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.SheetFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Sheet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class SheetFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class SheetFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class SheetFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures SheetFailures

# See Also

BuiltInFailures SheetFailures Members

Autodesk.Revit.DB Namespace

#### FabFittingFailed Property

---

|  |
| --- |
| BuiltInFailures PipingFailures Class   See Also |

The Fabrication Fitting was invalid

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabFittingFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabFittingFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabFittingFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PipingFailures Class

Autodesk.Revit.DB Namespace

#### ComponentRotation Property

---

|  |
| --- |
| DividedSurface Class   See Also |

The rotation of the pattern by a multiple of 90 degrees.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ComponentRotation ComponentRotation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ComponentRotation As ComponentRotation 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ComponentRotation ComponentRotation { 	ComponentRotation get (); 	void set (ComponentRotation value); } ``` |

# Remarks

This property has no effect unless a pattern is selected (the ObjectType property is not    a null reference (  Nothing  in Visual Basic)  ).

# See Also

DividedSurface Class

Autodesk.Revit.DB Namespace

#### GetWorksharingOptions Method

---

|  |
| --- |
| SaveAsOptions Class   See Also |

Gets Worksharing options for SaveAs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public WorksharingSaveAsOptions GetWorksharingOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetWorksharingOptions As WorksharingSaveAsOptions ``` |

| Visual C++ |
| --- |
| ``` public: WorksharingSaveAsOptions^ GetWorksharingOptions() ``` |

#### Return Value

Defaults to    a null reference (  Nothing  in Visual Basic)  . For a workshared model, if    a null reference (  Nothing  in Visual Basic)  default values for WorksharingSaveAsOptions are used.

# See Also

SaveAsOptions Class

Autodesk.Revit.DB Namespace

#### CanModifyDetailLevel Method

---

|  |
| --- |
| View Class   See Also |

Check if Detail Level can be modified.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool CanModifyDetailLevel() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanModifyDetailLevel As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanModifyDetailLevel() ``` |

#### Return Value

True if Detail Level can be modified.

# See Also

View Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| TransactWithCentralOptions Class   See Also |

Releases all resources used by the  TransactWithCentralOptions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

TransactWithCentralOptions Class

Autodesk.Revit.DB Namespace

#### CrossSection Property

---

|  |
| --- |
| Wall Class   See Also |

Obtain the Wall Cross-section for this wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public WallCrossSection CrossSection { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CrossSection As WallCrossSection 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property WallCrossSection CrossSection { 	WallCrossSection get (); 	void set (WallCrossSection value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The current wall does not support the cross section wallCrossSection. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### HvacRoughness Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Roughness, in discipline HVAC.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HvacRoughness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HvacRoughness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HvacRoughness { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### GetCouplerPositionTransform Method

---

|  |
| --- |
| RebarCoupler Class   See Also |

Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public Transform GetCouplerPositionTransform( 	int couplerPositionIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCouplerPositionTransform ( _ 	couplerPositionIndex As Integer _ ) As Transform ``` |

| Visual C++ |
| --- |
| ``` public: Transform^ GetCouplerPositionTransform( 	int couplerPositionIndex ) ``` |

#### Parameters

couplerPositionIndex
:   Type:  System Int32
     An index between 0 and (CouplerQuantity-1).

#### Return Value

Returns a transformation that is composed from : - a translation from (0, 0, 0) to coupler origin - a rotation that will align the coupler with the bar segment on which it stays.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | couplerPositionIndex is not in the range [ 0, CouplerQuantity-1 ]. |

# See Also

RebarCoupler Class

Autodesk.Revit.DB.Structure Namespace

#### Disconnects Property

---

|  |
| --- |
| ConfigurationReloadInfo Class   See Also |

The number of disconnections caused by the reload.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public int Disconnects { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Disconnects As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int Disconnects { 	int get (); } ``` |

# See Also

ConfigurationReloadInfo Class

Autodesk.Revit.DB Namespace

#### CannotAddToOptionsWarn Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

Elements can't be added to Option Set

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotAddToOptionsWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotAddToOptionsWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotAddToOptionsWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace

#### MassZoneVolume Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mass Zone Volume"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MassZoneVolume { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MassZoneVolume As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MassZoneVolume { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HelpId Property

---

|  |
| --- |
| DialogBoxData Class   See Also |

An ID that represents the dialog that has been displayed.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int HelpId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HelpId As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int HelpId { 	int get (); } ``` |

# Remarks

Use this ID within your application to key suitable responses for the dialog. Note: this id is not guaranteed to remain stable for different builds of Autodesk Revit.

# See Also

DialogBoxData Class

Autodesk.Revit.UI.Events Namespace

#### RemoveParameter Method

---

|  |
| --- |
| RebarShapeDefinition Class   See Also |

Remove the parameter from the definition.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public void RemoveParameter( 	ElementId paramId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveParameter ( _ 	paramId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveParameter( 	ElementId^ paramId ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter in the definition.

# Remarks

If the definition does not have the parameter, the method does nothing.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarShapeDefinition Class

Autodesk.Revit.DB.Structure Namespace

#### MaxSegmentAngle Property

---

|  |
| --- |
| Sweep Class   See Also |

The maximum segment angle of the sweep in radians.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double MaxSegmentAngle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MaxSegmentAngle As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double MaxSegmentAngle { 	double get (); 	void set (double value); } ``` |

# Remarks

This property is used to retrieve/set the maximum segment angle of the sweep. It is settable only when the trajectory segmentation is enabled.

# See Also

Sweep Class

Autodesk.Revit.DB Namespace

#### ViewScale Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Scale Value 1:"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewScale { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewScale As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewScale { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CanApplyColorFillScheme Method

---

|  |
| --- |
| View Class   See Also |

Checks if the id can be applied as the scheme id of specified category to this view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool CanApplyColorFillScheme( 	ElementId categoryId, 	ElementId schemeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanApplyColorFillScheme ( _ 	categoryId As ElementId, _ 	schemeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanApplyColorFillScheme( 	ElementId^ categoryId,  	ElementId^ schemeId ) ``` |

#### Parameters

categoryId
:   Type:  Autodesk.Revit.DB ElementId
     The id of category.

schemeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of color fill scheme.

#### Return Value

True if the id can be applied as the scheme id of specified category in this view, false otherwise.

# Remarks

The input scheme id could be InvalidElementId to clear the scheme for the specified category.

Some examples of returnning false:

* The id is not a color fill scheme id.
* The specified category is not supported by this view.
* The category of scheme is not the same as the specified category.
* The view is area plan but the scheme category is not OST\_Areas, or their  [!:Autodesk::Revit::DB::AreaScheme]  are not the same.
* Etc.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### First Property

---

|  |
| --- |
| VertexPair Class   See Also |

Identifies the first index of VertexPair.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public int First { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property First As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int First { 	int get (); 	void set (int value); } ``` |

# See Also

VertexPair Class

Autodesk.Revit.DB Namespace

#### RegisterService Method (IMultiServerService, ExternalServiceOptions, ExecutionPolicy)

---

|  |
| --- |
| ExternalServiceRegistry Class   See Also |

A method to register a multi-server service.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static Guid RegisterService( 	IMultiServerService service, 	ExternalServiceOptions options, 	ExecutionPolicy policy ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function RegisterService ( _ 	service As IMultiServerService, _ 	options As ExternalServiceOptions, _ 	policy As ExecutionPolicy _ ) As Guid ``` |

| Visual C++ |
| --- |
| ``` public: static Guid RegisterService( 	IMultiServerService^ service,  	ExternalServiceOptions^ options,  	ExecutionPolicy policy ) ``` |

#### Parameters

service
:   Type:  Autodesk.Revit.DB.ExternalService IMultiServerService
     An instance of the external service class that implements IMultiServerService interface.

options
:   Type:  Autodesk.Revit.DB.ExternalService ExternalServiceOptions
     Optional settings to control the service's behavior.

policy
:   Type:  Autodesk.Revit.DB.ExternalService ExecutionPolicy
     Specifies how the service handles servers during its execution.

#### Return Value

An execution key to access the service when executing it.

# Remarks

Each service can only be registered once. Revit checks the Id of every service getting registered and throws an exception upon an attempt to register a service with an Id that already exists.

Services need to be registered before Revit ends its initialization. For external applications that means they have to register their services during OnStartup. This will give servers which need to register to services a chance to do so during the ApplicationInitialized event, which is raised after a successfully processing OnStartup routines.

A service can be registered as either recordable or non-recordable. It is expected that a service that is once registered as recordable will always be registered as recordable. Failure to comply with this policy may lead to data loss in some documents when they are opened in a Revit session with the service currently registered as non-recordable.

An application registering a service must specify a policy to follow when executing the service. Once set, the policy remain constant during the Revit session, but a different policy may be used next time, if there is ever a need for such a change. More about the various execution policies can be found in the description of the ExecutionPolicy enumerated type.

A service is supposed to be executed only by the application that registered it. To enforce this requirement, the registering method return an execution key (a Guid) that is required as an argument to ExecuteService methods. If the owner of a service allows executing it by anyone, it needs to register it as a public service (via the option argument). Once registered as public, The access key of the service can be obtained by any application, thus it can also be executed by any application. By default, a service is registered as private.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given service is not a valid implementation of ISingleServerService. -or- The given service does not return valid values from the interface methods. At least one of the Name, VendorId, Description, and ServiceId is either empty or invalid. -or- A service with this Id is either invalid or not unique. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | Service cannot be registered because the registry of services has been already closed. All external services must be registered before the ApplicationInitialized event is raised. |

# See Also

ExternalServiceRegistry Class

RegisterService Overload

Autodesk.Revit.DB.ExternalService Namespace

#### FormattedText Class

---

|  |
| --- |
| Members   Example   See Also |

FormattedText is used to create, edit and format text in a  TextNote  or to query the text and format properties of a  TextNode

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public class FormattedText : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class FormattedText _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class FormattedText : IDisposable ``` |

# Remarks

An instance of FormattedText can be obtained from a  TextNote  (See  **TextNote.GetFormattedText()**  ) or from a  TextNode  (See  **TextNode.GetFormattedText()**  )

It is also possible to create a new instance of FormattedText and assign it to a  TextNote  (See  **TextNote.SetFormattedText()**  ) This will result in a  TextNote  with text with the specified formatting applied

Formatted text can be used to:

* Create formatted text for a new  TextNote
* Edit, Find and Replace text in an existing  TextNote
* Modify formatting of text in an existing  TextNote
* Or query the text and formatting a  TextNote  or a  TextNode

Formatted text can be populated with plain text by using its constructor  FormattedText(String)  that takes a string, or by using the  SetPlainText(String)  method.

In addition, selected ranges of text can be added, removed, or replaced with the  SetPlainText(TextRange, String)  method by specifying a  TextRange  .

Use the  Find(String, Int32, Boolean, Boolean)  method to find the location of existing text.

Formatted text can have up to 30,000 characters. All characters, except the linefeed character ('\n'), are allowed. This means that you should not use the 'Environment.NewLine' property, since that includes a linefeed character. Use the carriage return character ('\r') to terminate a paragraph. And use a vertical tab character ('\v') to create a new line without terminating the paragraph.

Formatted text allows for individual characters to be formatted. The following formatting can be applied.

* Bold
* Italic
* Underline
* Superscript/Subscript
* All Caps

Use  SetBoldStatus(TextRange, Boolean)  ) ,  SetItalicStatus(TextRange, Boolean)  ) ,  SetUnderlineStatus(TextRange, Boolean)  ) ,  SetSuperscriptStatus(TextRange, Boolean)  ) ,  SetSubscriptStatus(TextRange, Boolean)  ) , or  SetAllCapsStatus(TextRange, Boolean)  ) to set the character formatting on a range of text.

Use  GetBoldStatus(TextRange)  ) ,  GetItalicStatus(TextRange)  ) ,  GetUnderlineStatus(TextRange)  ) ,  GetSuperscriptStatus(TextRange)  ) ,  GetSubscriptStatus(TextRange)  ) , or  GetAllCapsStatus(TextRange)  ) to get the character formatting of a range of text.

Text can be broken up in paragraphs. Paragraphs are terminated by a carriage return character ('\r').

Each paragraph can be indented several levels deep. For each additional level the indentation increments by one tab size. The total indentation is the product of a tab size and the indent level. Use  SetIndentLevel(TextRange, Int32)  to set the level of indenting up to a maximum indent level that can be obtained from  GetMaximumIndentLevel  Use  GetIndentLevel(TextRange)  to find the indent level of a given range of text.

Note that the tab size is determined by the object that will contain the FormattedText.

In the case of a  TextNote  the tab size is a property of the  TextNoteType  returned from  **TextNote.TextNoteType**  . The tab size can be found by calling the  Parameter Guid  with  TEXT\_TAB\_SIZE  on the  TextNoteType  obtained from the  TextNote

In the case of a  TextNode  the tab size can be obtained from its  **TabSize**  property

Formatted text can also be used to create numbered or bulleted paragraphs with the  SetListType(TextRange, ListType)  method.

The following  ListType  options are available:

* Bullet
* ArabicNumbers
* LowerCaseLetters
* UpperCaseLetters

Paragraphs with a  ListType  other than  None  are considered to be 'list' paragraphs. Consecutive list paragraphs with the same indentation level are treated as part of the same list. A list ends when a list paragraph is followed by

* a paragraph that has  None
* or a list paragraph that has a lower indentation level, i.e. is indented less. (See  GetIndentLevel(TextRange)  )

Note that a list will continue uninterrupted after list paragraphs that have higher indentation level. These paragraphs form a 'sub-list' of the list they interrupt. Sub-lists can have their own sub-sub-lists. The nesting level is only limited by the maximum indent level. Using  SetIndentLevel(TextRange, Int32)  it is therefore possible to create multi-level lists.

FormattedText will keep lists consistent. That means that list paragraphs will automatically get sequential numbers or letters. It also means that if the list type of one of the paragraphs in a list is changed then that change is propagated to all the paragraphs in that list. Note that this will not affect the list type of any nested sub-lists.

Use a vertical tab character ('\v') to insert a line without a bullet or number. Since this does not end the paragraph this will allow the list to continue to the next paragraph.

# Examples

 Copy  C#

```
public void FormatText(TextNote textNote)
{
    // TextNote created with "New sample text"
    FormattedText formatText = textNote.GetFormattedText();

    // italicize "New"
    TextRange range = new TextRange(0, 3);
    formatText.SetItalicStatus(range, true);

    // make "sample" bold
    range = formatText.Find("sample", 0, false, true);
    if (range.Length > 0)
        formatText.SetBoldStatus(range, true);

    // make "text" underlined
    range = formatText.Find("text", 0, false, true);
    if (range.Length > 0)
        formatText.SetUnderlineStatus(range, true);

    // make all text uppercase
    formatText.SetAllCapsStatus(true);

    textNote.SetFormattedText(formatText);
}
```

 Copy  VB.NET

```
Public Sub FormatText(textNote As TextNote)
    ' TextNote created with "New sample text"
    Dim formatText__1 As FormattedText = textNote.GetFormattedText()

    ' italicize "New"
    Dim range As New TextRange(0, 3)
    formatText__1.SetItalicStatus(range, True)

    ' make "sample" bold
    range = formatText__1.Find("sample", 0, False, True)
    If range.Length > 0 Then
        formatText__1.SetBoldStatus(range, True)
    End If

    ' make "text" underlined
    range = formatText__1.Find("text", 0, False, True)
    If range.Length > 0 Then
        formatText__1.SetUnderlineStatus(range, True)
    End If

    ' make all text uppercase
    formatText__1.SetAllCapsStatus(True)

    textNote.SetFormattedText(formatText__1)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FormattedText

# See Also

FormattedText Members

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| UpdaterId Class   See Also |

Releases all resources used by the  UpdaterId

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

UpdaterId Class

Autodesk.Revit.DB Namespace

#### SystemType Property

---

|  |
| --- |
| ElectricalSystem Class   See Also |

The Electrical System Type of the Electrical System.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElectricalSystemType SystemType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SystemType As ElectricalSystemType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElectricalSystemType SystemType { 	ElectricalSystemType get (); } ``` |

# Remarks

This property is used to retrieve the Electrical System Type of the Electrical System.

# See Also

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace

#### DeleteProfile Method

---

|  |
| --- |
| Form Class   See Also |

Delete a profile of the form.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void DeleteProfile( 	int profileIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub DeleteProfile ( _ 	profileIndex As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void DeleteProfile( 	int profileIndex ) ``` |

#### Parameters

profileIndex
:   Type:  System Int32
     Index to specify the profile.

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### ZVector Property

---

|  |
| --- |
| CylindricalHelix Class   See Also |

The Z direction vector, which is same as the axis direction vector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ ZVector { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ZVector As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ ZVector { 	XYZ^ get (); } ``` |

# See Also

CylindricalHelix Class

Autodesk.Revit.DB Namespace

#### WireConduitTypeSet Constructor

---

|  |
| --- |
| WireConduitTypeSet Class   See Also |

Initializes a new instance of the  WireConduitTypeSet  class

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public WireConduitTypeSet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: WireConduitTypeSet() ``` |

# See Also

WireConduitTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### SetCellParamIdAndCategoryId Method (Int32, Int32, ElementId, ElementId)

---

|  |
| --- |
| TableSectionData Class   See Also |

Sets a cell's category and parameter Id

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetCellParamIdAndCategoryId( 	int nRow, 	int nCol, 	ElementId paramId, 	ElementId categoryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCellParamIdAndCategoryId ( _ 	nRow As Integer, _ 	nCol As Integer, _ 	paramId As ElementId, _ 	categoryId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCellParamIdAndCategoryId( 	int nRow,  	int nCol,  	ElementId^ paramId,  	ElementId^ categoryId ) ``` |

#### Parameters

nRow
:   Type:  System Int32

nCol
:   Type:  System Int32

paramId
:   Type:  Autodesk.Revit.DB ElementId

categoryId
:   Type:  Autodesk.Revit.DB ElementId

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- The paramId or categoryId is not valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

TableSectionData Class

SetCellParamIdAndCategoryId Overload

Autodesk.Revit.DB Namespace

#### TextNoteLeaderTypes Enumeration

---

|  |
| --- |
| See Also |

Types of text-note leaders

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TextNoteLeaderTypes ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextNoteLeaderTypes ``` |

| Visual C++ |
| --- |
| ``` public enum class TextNoteLeaderTypes ``` |

# Members

| Member name | Description |
| --- | --- |
| TNLT\_STRAIGHT\_L | A line leader attached from the left side of a text element |
| TNLT\_STRAIGHT\_R | A line leader attached from the right side of a text element |
| TNLT\_ARC\_L | An arc leader attached from the left side of a text element |
| TNLT\_ARC\_R | An arc leader attached from the right side of a text element |

# See Also

Autodesk.Revit.DB Namespace

#### AddCurve Method

---

|  |
| --- |
| WireframeBuilder Class   See Also |

Add a curve to the shape representation stored in this WireframeBuilder.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void AddCurve( 	Curve GCurve ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddCurve ( _ 	GCurve As Curve _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddCurve( 	Curve^ GCurve ) ``` |

#### Parameters

GCurve
:   Type:  Autodesk.Revit.DB Curve
     The curve to be added.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | GCurve is not acceptable for a wireframe shape representation. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

WireframeBuilder Class

Autodesk.Revit.DB Namespace

#### RbsDuctTopElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Upper End Top Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsDuctTopElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsDuctTopElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsDuctTopElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### EnergyAnalysisMasszoneCoreoffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Perimeter Zone Depth"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId EnergyAnalysisMasszoneCoreoffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EnergyAnalysisMasszoneCoreoffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ EnergyAnalysisMasszoneCoreoffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TestCell Method

---

|  |
| --- |
| PointCloudFilter Class   See Also |

Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside or on the border of the volume of interest.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public int TestCell( 	XYZ min, 	XYZ max ) ``` |

| Visual Basic |
| --- |
| ``` Public Function TestCell ( _ 	min As XYZ, _ 	max As XYZ _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int TestCell( 	XYZ^ min,  	XYZ^ max ) ``` |

#### Parameters

min
:   Type:  Autodesk.Revit.DB XYZ
     The lower corner of the cell.

max
:   Type:  Autodesk.Revit.DB XYZ
     The upper corner of the cell.

#### Return Value

* -1 -- The cell is entirely rejected.
* 0 -- The cell partially belongs to the volume of interest. Use PrepareForCell() and TestPoint() to evaluate individual points.
* 1 -- The cell is fully accepted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PointCloudFilter Class

Autodesk.Revit.DB.PointClouds Namespace

#### NoAvailableMatchingConnector Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoAvailableMatchingConnector { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoAvailableMatchingConnector As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoAvailableMatchingConnector { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### GetCuttingVoidInstances Method

---

|  |
| --- |
| InstanceVoidCutUtils Class   See Also |

Return ids of the instances with unattached voids cutting the element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetCuttingVoidInstances( 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetCuttingVoidInstances ( _ 	element As Element _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetCuttingVoidInstances( 	Element^ element ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The element being cut

#### Return Value

Ids of instances with unattached voids that cut this element

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace

#### SetHostId Method

---

|  |
| --- |
| Rebar Class   See Also |

The element that contains the rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public void SetHostId( 	Document doc, 	ElementId hostId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetHostId ( _ 	doc As Document, _ 	hostId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetHostId( 	Document^ doc,  	ElementId^ hostId ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document containing both this element and the host element.

hostId
:   Type:  Autodesk.Revit.DB ElementId
     The element that the rebar object belongs to, such as a structural wall, floor, foundation, beam, brace or column. The rebar does not need to be strictly inside the host, but it must be assigned to one host element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | hostId is not a legal Rebar host (see the RebarHostData class). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### IndexBuffer Constructor

---

|  |
| --- |
| IndexBuffer Class   See Also |

Constructs the index buffer with the given capacity, measured in short integers.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IndexBuffer( 	int sizeInShortInts ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	sizeInShortInts As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: IndexBuffer( 	int sizeInShortInts ) ``` |

#### Parameters

sizeInShortInts
:   Type:  System Int32
     The number of short integers that the buffer can contain.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This IndexBuffer is not available because Revit is not currently rendering. In general, this IndexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

# See Also

IndexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### GetOptions Method

---

|  |
| --- |
| ExporterIFC Class   See Also |

Gets the collection of named options set by the exporter client.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IDictionary<string, string> GetOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetOptions As IDictionary(Of String, String) ``` |

| Visual C++ |
| --- |
| ``` public: IDictionary<String^, String^>^ GetOptions() ``` |

#### Return Value

The collection of named options.

# See Also

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace

#### StairsRuntypeUndersideSurfaceType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Underside Surface": Underside Surface

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRuntypeUndersideSurfaceType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRuntypeUndersideSurfaceType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRuntypeUndersideSurfaceType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| GroupSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

GroupSetIterator Class

Autodesk.Revit.DB Namespace

#### SKPImportOptions Class

---

|  |
| --- |
| Members   See Also |

The import options used to import SKP format files.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class SKPImportOptions : BaseImportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class SKPImportOptions _ 	Inherits BaseImportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class SKPImportOptions : public BaseImportOptions ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BaseImportOptions
  Autodesk.Revit.DB SKPImportOptions

# See Also

SKPImportOptions Members

Autodesk.Revit.DB Namespace

#### RbsElecPanelTotalestloadPowerParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Power Total Estimated Demand"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelTotalestloadPowerParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelTotalestloadPowerParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelTotalestloadPowerParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsSummarySectionHidden Property

---

|  |
| --- |
| PanelScheduleData Class   See Also |

True if the user wishes to hide the summary section; setting this value must go through the appropriate update function

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsSummarySectionHidden { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsSummarySectionHidden As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsSummarySectionHidden { 	bool get (); } ``` |

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### IsValidObject Property

---

|  |
| --- |
| SpatialElementBoundarySubface Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

SpatialElementBoundarySubface Class

Autodesk.Revit.DB Namespace

#### ViewReferencingSheet Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Referencing Sheet"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewReferencingSheet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewReferencingSheet As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewReferencingSheet { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| RebarShapeMultiplanarDefinition Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

RebarShapeMultiplanarDefinition Class

Autodesk.Revit.DB.Structure Namespace

#### StructuralAttachmentEndType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Attachment Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralAttachmentEndType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralAttachmentEndType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralAttachmentEndType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BendRadius Property

---

|  |
| --- |
| RebarBendData Class   See Also |

The radius of all fillets, except hook fillets, in the Rebar shape.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double BendRadius { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BendRadius As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BendRadius { 	double get (); 	void set (double value); } ``` |

# Remarks

Inner radius, not centerline

# See Also

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace

#### Create Method (Document, ExternalResourceReference, RevitLinkOptions)

---

|  |
| --- |
| RevitLinkType Class   See Also |

Creates a new Revit link type from an external resource reference and loads the linked document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static LinkLoadResult Create( 	Document document, 	ExternalResourceReference resourceReference, 	RevitLinkOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	resourceReference As ExternalResourceReference, _ 	options As RevitLinkOptions _ ) As LinkLoadResult ``` |

| Visual C++ |
| --- |
| ``` public: static LinkLoadResult^ Create( 	Document^ document,  	ExternalResourceReference^ resourceReference,  	RevitLinkOptions^ options ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to create the Revit link.

resourceReference
:   Type:  Autodesk.Revit.DB ExternalResourceReference
     An external resource reference describing the source of the linked Revit document.

options
:   Type:  Autodesk.Revit.DB RevitLinkOptions
     An options class for loading Revit links. The path type information will be ignored.

#### Return Value

An object containing the results of creating and loading the Revit link type. It contains the ElementId of the new link.

# Remarks

This function regenerates the input document.

Only the WorksetConfiguration information in the options argument will be used. The path type information will be ignored.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. -or- The server referenced by the ExternalResourceReference cannot support Revit links. -or- The ExternalResourceReference (resourceReference) is not in a format that is supported by its server. -or- The link type referred to by the ExternalResourceReference "resourceReference" already exists in the document. You cannot create another copy of the link type. You can create instances with RevitLinkInstance.Create(), or reload the link using RevitLinkType.Reload(). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Revit cannot customize worksets for this model. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

RevitLinkType Class

Create Overload

Autodesk.Revit.DB Namespace

#### ProfileId Property

---

|  |
| --- |
| ContinuousRailType Class   See Also |

The id of the profile of the rail

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId ProfileId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ProfileId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ProfileId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The profileId is neither a valid element id nor invalidElementId. -or- When setting this property: The profileId is not a valid profile symbol for continuous rail. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ContinuousRailType Class

Autodesk.Revit.DB.Architecture Namespace

#### BoundaryZRotationSpring Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Z Rotation - Spring"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryZRotationSpring { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryZRotationSpring As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryZRotationSpring { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| SystemZoneData Class   See Also |

Creates a new instance of a system-zone data domain class.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public static SystemZoneData Create() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create As SystemZoneData ``` |

| Visual C++ |
| --- |
| ``` public: static SystemZoneData^ Create() ``` |

#### Return Value

The newly created data domain instance.

# See Also

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace

#### PlanViewDirection Property

---

|  |
| --- |
| ViewFamilyType Class   See Also |

The PlanViewDirection of this view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public PlanViewDirection PlanViewDirection { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PlanViewDirection As PlanViewDirection 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property PlanViewDirection PlanViewDirection { 	PlanViewDirection get (); 	void set (PlanViewDirection value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: PlanViewDirection cannot be set to Undefined |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: View must be a Structural Plan |

# See Also

ViewFamilyType Class

Autodesk.Revit.DB Namespace

#### GetMinimumNumberOfDigits Method

---

|  |
| --- |
| NumberingSchema Class   See Also |

Returns the minimum number of digits to be used for formating the Number parameter of all enumerable elements of the given document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static int GetMinimumNumberOfDigits( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetMinimumNumberOfDigits ( _ 	document As Document _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: static int GetMinimumNumberOfDigits( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document this value is going to be applied to.

#### Return Value

The current number of formatting digits

# Remarks

The number is used by all numbering schemas in the document.

The value can be modified by using the  SetMinimumNumberOfDigits(Document, Int32)  method.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

NumberingSchema Class

Autodesk.Revit.DB Namespace

#### StructuralElevationAtTop Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elevation at Top"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralElevationAtTop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralElevationAtTop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralElevationAtTop { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| WaterLoopData Class   See Also |

Releases all resources used by the  WaterLoopData

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

WaterLoopData Class

Autodesk.Revit.DB.Mechanical Namespace

#### RasterQualityType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing the options for raster quality.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum RasterQualityType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RasterQualityType ``` |

| Visual C++ |
| --- |
| ``` public enum class RasterQualityType ``` |

# Members

| Member name | Description |
| --- | --- |
| Low | The type of Raster Quality is Low. |
| Medium | The type of Raster Quality is Medium. |
| High | The type of Raster Quality is High. |
| Presentation | The type of Raster Quality is Presentation. |

# See Also

Autodesk.Revit.DB Namespace

#### FabricationPartCannotChangeTypeBadDimError Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions or be constrained due to connected fitting(s). You may try to disconnect the connections on the fitting(s) and try again.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartCannotChangeTypeBadDimError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartCannotChangeTypeBadDimError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartCannotChangeTypeBadDimError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### GetExternalDefinitionForElementId Method

---

|  |
| --- |
| RebarShapeParameters Class   See Also |

Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalDefinition GetExternalDefinitionForElementId( 	Document doc, 	ElementId paramId, 	DefinitionFile definitionFile ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetExternalDefinitionForElementId ( _ 	doc As Document, _ 	paramId As ElementId, _ 	definitionFile As DefinitionFile _ ) As ExternalDefinition ``` |

| Visual C++ |
| --- |
| ``` public: static ExternalDefinition^ GetExternalDefinitionForElementId( 	Document^ doc,  	ElementId^ paramId,  	DefinitionFile^ definitionFile ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     A document.

paramId
:   Type:  Autodesk.Revit.DB ElementId
     The id of a shared parameter in the document.

definitionFile
:   Type:  Autodesk.Revit.DB DefinitionFile
     A database of shared parameters.

#### Return Value

The external parameter corresponding to the parameter's ElementId, or null if the Id does not correspond to an external parameter, or the parameter is not in the definition file.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was    a null reference (  Nothing  in Visual Basic)  . |

# See Also

RebarShapeParameters Class

Autodesk.Revit.DB.Structure Namespace

#### Dispose Method

---

|  |
| --- |
| RebarShapeConstraint Class   See Also |

Releases all resources used by the  RebarShapeConstraint

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RebarShapeConstraint Class

Autodesk.Revit.DB.Structure Namespace

#### GetValidFamiliesForNoteBlock Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Gets a list of families that can be used for a note block.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetValidFamiliesForNoteBlock( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetValidFamiliesForNoteBlock ( _ 	document As Document _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetValidFamiliesForNoteBlock( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

#### Return Value

The IDs of all valid families.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### StationingSurveyFeet Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

US survey feet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StationingSurveyFeet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StationingSurveyFeet As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StationingSurveyFeet { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Width Property

---

|  |
| --- |
| ImageType Class   See Also |

The horizontal size of the image

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public double Width { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Width As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Width { 	double get (); } ``` |

# See Also

ImageType Class

Autodesk.Revit.DB Namespace

#### BorderTopLineStyle Property

---

|  |
| --- |
| TableCellStyleOverrideOptions Class   See Also |

Indicates if the border top line style characteristic is overridden.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool BorderTopLineStyle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BorderTopLineStyle As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool BorderTopLineStyle { 	bool get (); 	void set (bool value); } ``` |

# See Also

TableCellStyleOverrideOptions Class

Autodesk.Revit.DB Namespace

#### PlanViewPlane Enumeration

---

|  |
| --- |
| See Also |

Locations where view range offsets can be specified.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum PlanViewPlane ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PlanViewPlane ``` |

| Visual C++ |
| --- |
| ``` public enum class PlanViewPlane ``` |

# Members

| Member name | Description |
| --- | --- |
| CutPlane | Cut Plane |
| TopClipPlane | Top Clip Plane |
| BottomClipPlane | Bottom Clip Plane |
| ViewDepthPlane | View Depth Plane |
| UnderlayBottom | Underlay Bottom Plane |

# See Also

Autodesk.Revit.DB Namespace

#### ServiceAbbreviation Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The associated service abbreviation for the fabrication service.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string ServiceAbbreviation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ServiceAbbreviation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ServiceAbbreviation { 	String^ get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### MaterialAssetParamExternalMaterialId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"External Material ID"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MaterialAssetParamExternalMaterialId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MaterialAssetParamExternalMaterialId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MaterialAssetParamExternalMaterialId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| KeyBasedTreeEntriesLoadResults Class   See Also |

Releases all resources used by the  KeyBasedTreeEntriesLoadResults

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

KeyBasedTreeEntriesLoadResults Class

Autodesk.Revit.DB Namespace

#### Rehost Method (SketchPlane, XYZ)

---

|  |
| --- |
| Form Class   See Also |

Rehost Form to sketch plane

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void Rehost( 	SketchPlane sketchPlane, 	XYZ location ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Rehost ( _ 	sketchPlane As SketchPlane, _ 	location As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Rehost( 	SketchPlane^ sketchPlane,  	XYZ^ location ) ``` |

#### Parameters

sketchPlane
:   Type:  Autodesk.Revit.DB SketchPlane
     The sketch plane on which to rehost the form.

location
:   Type:  Autodesk.Revit.DB XYZ
     The location to which to Rehost the form.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the sketchPlane or location is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when rehosting Form failed. |

# See Also

Form Class

Rehost Overload

Autodesk.Revit.DB Namespace

#### GetStatus Method

---

|  |
| --- |
| TransactionGroup Class   See Also |

Gets the current status of the transaction group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TransactionStatus GetStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetStatus As TransactionStatus ``` |

| Visual C++ |
| --- |
| ``` public: TransactionStatus GetStatus() ``` |

#### Return Value

The current status of the transaction group.

# See Also

TransactionGroup Class

Autodesk.Revit.DB Namespace

#### ViewDetailLevelIsHighInLargeView Property

---

|  |
| --- |
| BuiltInFailures PerformanceFailures Class   See Also |

A large view has view detail level set to medium or coarse. Generation of extraneous details harms performance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ViewDetailLevelIsHighInLargeView { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewDetailLevelIsHighInLargeView As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ViewDetailLevelIsHighInLargeView { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PerformanceFailures Class

Autodesk.Revit.DB Namespace

#### GetTaggedGeometry Method

---

|  |
| --- |
| ExternallyTaggedBRep Class   See Also |

Returns the externally tagged geometry object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public GeometryObject GetTaggedGeometry( 	ExternalGeometryId externalId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetTaggedGeometry ( _ 	externalId As ExternalGeometryId _ ) As GeometryObject ``` |

| Visual C++ |
| --- |
| ``` public: GeometryObject^ GetTaggedGeometry( 	ExternalGeometryId^ externalId ) ``` |

#### Parameters

externalId
:   Type:  Autodesk.Revit.DB ExternalGeometryId
     An external tag that may match a geometry object (i.e face/edge) in this Solid.

#### Return Value

Returns the geometry object that matches the external tag. If no such object is found, this method will return null.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternallyTaggedBRep Class

Autodesk.Revit.DB Namespace

#### NotAssociatedKeynoteParameter Property

---

|  |
| --- |
| BuiltInFailures KeynoteFailures Class   See Also |

Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotAssociatedKeynoteParameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotAssociatedKeynoteParameter As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotAssociatedKeynoteParameter { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures KeynoteFailures Class

Autodesk.Revit.DB Namespace

#### Excluding Method

---

|  |
| --- |
| FilteredElementCollector Class   See Also |

Applies an ExclusionFilter to the collector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FilteredElementCollector Excluding( 	ICollection<ElementId> idsToExclude ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Excluding ( _ 	idsToExclude As ICollection(Of ElementId) _ ) As FilteredElementCollector ``` |

| Visual C++ |
| --- |
| ``` public: FilteredElementCollector^ Excluding( 	ICollection<ElementId^>^ idsToExclude ) ``` |

#### Parameters

idsToExclude
:   Type:  System.Collections.Generic ICollection   ElementId
     The ids to exclude from the results.

#### Return Value

A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

# Remarks

Elements passed to this filter will be automatically excluded from the results. If you have an active iterator to this collector it will be stopped by this call.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input collection of ids was empty, or its contents were not valid for iteration. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilteredElementCollector Class

Autodesk.Revit.DB Namespace

#### PickPoint Method (String)

---

|  |
| --- |
| Selection Class   See Also |

Prompts the user to pick a point on the active work plane while showing a custom status prompt string.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ PickPoint( 	string statusPrompt ) ``` |

| Visual Basic |
| --- |
| ``` Public Function PickPoint ( _ 	statusPrompt As String _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ PickPoint( 	String^ statusPrompt ) ``` |

#### Parameters

statusPrompt
:   Type:  System String
     Specifies the message shown on the status bar.

#### Return Value

The point picked by user.

Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

# Remarks

Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view), but will not be permitted to click other items in the Revit user interface. Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.

Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the argument statusPrompt is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when no work plane set in current view. |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode. |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | Thrown if this method is called during dynamic update. |

# See Also

Selection Class

PickPoint Overload

Autodesk.Revit.UI.Selection Namespace

#### SetFlags Method (Int32)

---

|  |
| --- |
| ValueAtPointBase Class   See Also |

Sets the flags associated to all measurements to the same value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetFlags( 	int flags ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFlags ( _ 	flags As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFlags( 	int flags ) ``` |

#### Parameters

flags
:   Type:  System Int32
     Value of flags, uniform for all measurements. Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.

# See Also

ValueAtPointBase Class

SetFlags Overload

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| Transaction Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

Transaction Class

Autodesk.Revit.DB Namespace

#### JoistSystemJustificationParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Justification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId JoistSystemJustificationParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property JoistSystemJustificationParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ JoistSystemJustificationParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CreateCableTrayConnector Method (Document, Reference, Edge)

---

|  |
| --- |
| ConnectorElement Class   See Also |

Create a new cable tray ConnectorElement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static ConnectorElement CreateCableTrayConnector( 	Document document, 	Reference planarFace, 	Edge edge ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateCableTrayConnector ( _ 	document As Document, _ 	planarFace As Reference, _ 	edge As Edge _ ) As ConnectorElement ``` |

| Visual C++ |
| --- |
| ``` public: static ConnectorElement^ CreateCableTrayConnector( 	Document^ document,  	Reference^ planarFace,  	Edge^ edge ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to add the connector to.

planarFace
:   Type:  Autodesk.Revit.DB Reference
     The planar face to place the connector on.

edge
:   Type:  Autodesk.Revit.DB Edge
     One of the edges in the edge loop that defines the connector location on the planar face.

#### Return Value

The cable tray ConnectorElement.

# Remarks

Regenerates the document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The reference is not a planar face. -or- document is not a family document. -or- Thrown when the edge does not belong to the face. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Connector creation is not allowed in this family. |

# See Also

ConnectorElement Class

CreateCableTrayConnector Overload

Autodesk.Revit.DB Namespace

#### CantMirrorInstWoHost Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Can't mirror an instance without its host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CantMirrorInstWoHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CantMirrorInstWoHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CantMirrorInstWoHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### ScheduleHorizontalAlignment Enumeration

---

|  |
| --- |
| See Also |

Horizontal alignment of data in a schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ScheduleHorizontalAlignment ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ScheduleHorizontalAlignment ``` |

| Visual C++ |
| --- |
| ``` public enum class ScheduleHorizontalAlignment ``` |

# Members

| Member name | Description |
| --- | --- |
| Left | Left aligned |
| Center | Center aligned |
| Right | Right aligned |

# See Also

Autodesk.Revit.DB Namespace

#### ImportAdtEntityStructType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Structural Type Name"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ImportAdtEntityStructType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ImportAdtEntityStructType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ImportAdtEntityStructType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ViewGraphSchedLevelRelativeBaseType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elevation Base for Levels"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewGraphSchedLevelRelativeBaseType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewGraphSchedLevelRelativeBaseType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewGraphSchedLevelRelativeBaseType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### VisGraphicsPointClouds Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"V/G Overrides Point Clouds"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId VisGraphicsPointClouds { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property VisGraphicsPointClouds As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ VisGraphicsPointClouds { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsAlmostEqualTo Method (XYZ, Double)

---

|  |
| --- |
| XYZ Class   See Also |

Determines whether 2 vectors are the same within the given tolerance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsAlmostEqualTo( 	XYZ source, 	double tolerance ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsAlmostEqualTo ( _ 	source As XYZ, _ 	tolerance As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsAlmostEqualTo( 	XYZ^ source,  	double tolerance ) ``` |

#### Parameters

source
:   Type:  Autodesk.Revit.DB XYZ
     The vector to compare with this vector.

tolerance
:   Type:  System Double
     The tolerance for equality check.

#### Return Value

True if the vectors are the same; otherwise, false.

# Remarks

This routine uses an input tolerance to compare two vectors to see if they are almost equivalent. Because it is comparing two vectors the tolerance value is not in length units but instead represents the variation in direction between the vectors. For very small tolerance values it should also be possible to compare two points with this method. To compute the distance between two points for a comparison with a larger allowable difference, use  DistanceTo(XYZ)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when source is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when tolerance is less than 0. |

# See Also

XYZ Class

IsAlmostEqualTo Overload

Autodesk.Revit.DB Namespace

#### SummaryShowsVerticalHeaders Property

---

|  |
| --- |
| PanelScheduleData Class   See Also |

Shows text in the Load Summary section's headers vertically instead of horizontally

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool SummaryShowsVerticalHeaders { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SummaryShowsVerticalHeaders As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool SummaryShowsVerticalHeaders { 	bool get (); } ``` |

# Remarks

Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### SelectionChanged Event

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Subscribe to the SelectionChanged event to be notified after the selection was changed.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public event EventHandler<SelectionChangedEventArgs> SelectionChanged ``` |

| Visual Basic |
| --- |
| ``` Public Event SelectionChanged As EventHandler(Of SelectionChangedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<SelectionChangedEventArgs^>^ SelectionChanged { 	void add (EventHandler<SelectionChangedEventArgs^>^ value); 	void remove (EventHandler<SelectionChangedEventArgs^>^ value); } ``` |

# Remarks

This event is raised after the selection was changed in the current document. Handlers of this event are forbidden to make modifications to the current document. Handlers of this event are forbidden to change the selection to the current document. It is not allowed to open a new transaction in the active document when handling this event.

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### ShowImageAsButton Property

---

|  |
| --- |
| TextBox Class   See Also |

Gets or sets a value that indicates if the Image set in the text box should be displayed as a clickable button.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool ShowImageAsButton { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowImageAsButton As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowImageAsButton { 	bool get (); 	void set (bool value); } ``` |

# Remarks

If this property is true, the image will shown as a button inside the textbox. Clicking this button will trigger the EnterPressed event. The default value is false.

# See Also

TextBox Class

Autodesk.Revit.UI Namespace

#### IsValidLineStyleIdForFilledRegion Method

---

|  |
| --- |
| FilledRegion Class   See Also |

Indicates whether the given Id is a valid line style Id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool IsValidLineStyleIdForFilledRegion( 	Document document, 	ElementId lineStyleId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidLineStyleIdForFilledRegion ( _ 	document As Document, _ 	lineStyleId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidLineStyleIdForFilledRegion( 	Document^ document,  	ElementId^ lineStyleId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

lineStyleId
:   Type:  Autodesk.Revit.DB ElementId
     The line style Id.

#### Return Value

True if it is a valid line style Id, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilledRegion Class

Autodesk.Revit.DB Namespace

#### LitersPerHour Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Liters per hour.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LitersPerHour { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LitersPerHour As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LitersPerHour { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### StairsBaseLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsBaseLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsBaseLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsBaseLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InaccurateDriveCurve Property

---

|  |
| --- |
| BuiltInFailures InaccurateFailures Class   See Also |

Element is slightly off axis and may cause inaccuracies.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InaccurateDriveCurve { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InaccurateDriveCurve As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InaccurateDriveCurve { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InaccurateFailures Class

Autodesk.Revit.DB Namespace

#### OptionElementsDeleted Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

Elements in [option] were deleted

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId OptionElementsDeleted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OptionElementsDeleted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ OptionElementsDeleted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace

#### ExtensibleStorageFilter Class

---

|  |
| --- |
| Members   See Also |

A filter used to filter elements with extensible storage data based on specific Schema id.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class ExtensibleStorageFilter : ElementQuickFilter ``` |

| Visual Basic |
| --- |
| ``` Public Class ExtensibleStorageFilter _ 	Inherits ElementQuickFilter ``` |

| Visual C++ |
| --- |
| ``` public ref class ExtensibleStorageFilter : public ElementQuickFilter ``` |

# Remarks

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementFilter
  Autodesk.Revit.DB ElementQuickFilter
  Autodesk.Revit.DB.ExtensibleStorage ExtensibleStorageFilter

# See Also

ExtensibleStorageFilter Members

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### NotAllowedCableTrayConduitRotation Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Don't allow to rotate a horizontal cable tray/conduit like this

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotAllowedCableTrayConduitRotation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotAllowedCableTrayConduitRotation As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotAllowedCableTrayConduitRotation { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### ColorFillLegend Class

---

|  |
| --- |
| Members   See Also |

Represents color fill legend.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public class ColorFillLegend : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class ColorFillLegend _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class ColorFillLegend : public Element ``` |

# Remarks

Color fill legend is a 2D annotation element, it can be created through  Create(Document, ElementId, ElementId, XYZ)  with specified category of color fill scheme, if there exists a valid color fill scheme activated for the category in the view. After a legend is created, its content and layout will keep consistent with the active color fill scheme of the view. You can adjust its position through  Origin  property, or manually maintain its layout through  Height  property and  GetColumnWidths  /  [M:Autodesk.Revit.DB.ColorFillLegend.SetColumnWidths(System.Collections.Generic.IList`1{System.Double})]  methods.

Notes:

1. GetColorFillSchemeId(ElementId)  could be used to retrieve the corresponding color fill scheme of this legend, through the  [!:Autodesk::Revit::DB::View::ColorFillCategoryId]  and  OwnerViewId  properties. Note that there could only exist one active scheme for all spatial categories (rooms, areas, and zones) in one view.
2. Once the height and column widths are explicitly set, they will be fixed even if the contents of the legend change.
3. To retrieve correct height and column widths, it's better to manually retrieve the geometry of legend for nonvisible views. (Because color fill legend is a view specific element.)
4. The value of  Height  property does not contain the line that displays "Calculating...".

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ColorFillLegend

# See Also

ColorFillLegend Members

Autodesk.Revit.DB Namespace

#### ExternalDataTypeServerFailureResolutionExecutingEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the ExternalDataTypeServerFailureResolutionExecuting event.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public class ExternalDataTypeServerFailureResolutionExecutingEventArgs : RevitAPIPreDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class ExternalDataTypeServerFailureResolutionExecutingEventArgs _ 	Inherits RevitAPIPreDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class ExternalDataTypeServerFailureResolutionExecutingEventArgs : public RevitAPIPreDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreDocEventArgs
  Autodesk.Revit.DB.Events ExternalDataTypeServerFailureResolutionExecutingEventArgs

# See Also

ExternalDataTypeServerFailureResolutionExecutingEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### GrPerHFtSup2InHg Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol gr/(hÂ·ftÂ²Â·inHg), indicating unit Grains per hour square foot inch mercury.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GrPerHFtSup2InHg { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GrPerHFtSup2InHg As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GrPerHFtSup2InHg { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### AnalyticalModelSelector Constructor

---

|  |
| --- |
| AnalyticalModelSelector Class   See Also |

Creates a selector for the analytical model geometry.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public AnalyticalModelSelector() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: AnalyticalModelSelector() ``` |

# Remarks

This version is useful for single-curve or single-point analytical models. Additionally, this only acts with respect to the entire curve or point.

# See Also

AnalyticalModelSelector Class

AnalyticalModelSelector Overload

Autodesk.Revit.DB.Structure Namespace

#### OverlappingLines Property

---

|  |
| --- |
| BuiltInFailures GridChainSketchFailures Class   See Also |

GridChain sketch contains lines which overlap.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId OverlappingLines { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OverlappingLines As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ OverlappingLines { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GridChainSketchFailures Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| NavisworksExportOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace

#### WoodEarlycolorPerlinProf Property

---

|  |
| --- |
| AdvancedWood Class   See Also |

The property labeled "Profile for earlywood color perlin noise" from the "AdvancedWood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WoodEarlycolorPerlinProf { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WoodEarlycolorPerlinProf As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WoodEarlycolorPerlinProf { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble".

# See Also

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace

#### RbsParallelpipesVerticalNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Vertical Number for parallel pipes"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsParallelpipesVerticalNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsParallelpipesVerticalNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsParallelpipesVerticalNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ScaledInnerPerimeter Property

---

|  |
| --- |
| IFCExtrusionCreationData Class   See Also |

The inner perimeter of the extrusion, scaled to the units of export.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double ScaledInnerPerimeter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ScaledInnerPerimeter As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ScaledInnerPerimeter { 	double get (); 	void set (double value); } ``` |

#### Field Value

This value represents the perimeter of all of the inner curve loops within the area of the extrusion. Zero if the perimeter has never been set on this object.

# See Also

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace

#### DuctPressureDropService Property

---

|  |
| --- |
| ExternalServices BuiltInExternalServices Class   See Also |

The external service which permits registration of an alternate implementation for duct pressure drop calculation. To use this service, programmers implement a server class that derives from  IDuctPressureDropServer  .

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalServiceId DuctPressureDropService { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DuctPressureDropService As ExternalServiceId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalServiceId^ DuctPressureDropService { 	ExternalServiceId^ get (); } ``` |

# See Also

ExternalServices BuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace

#### DGNImportOptions Class

---

|  |
| --- |
| Members   See Also |

The import options used to import DGN format files.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class DGNImportOptions : BaseImportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class DGNImportOptions _ 	Inherits BaseImportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class DGNImportOptions : public BaseImportOptions ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BaseImportOptions
  Autodesk.Revit.DB DGNImportOptions

# See Also

DGNImportOptions Members

Autodesk.Revit.DB Namespace

#### IsDone Method

---

|  |
| --- |
| MacroManagerIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

MacroManagerIterator Class

Autodesk.Revit.DB.Macros Namespace

#### Multiply Method

---

|  |
| --- |
| XYZ Class   See Also |

Multiplies this vector by the specified value and returns the result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Multiply( 	double value ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Multiply ( _ 	value As Double _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ Multiply( 	double value ) ``` |

#### Parameters

value
:   Type:  System Double
     The value to multiply with this vector.

#### Return Value

The multiplied vector.

# Remarks

The multiplied vector is obtained by multiplying each coordinate of this vector by the specified value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the specified value is an infinite number. |

# See Also

XYZ Class

Autodesk.Revit.DB Namespace

#### GetProjectGUID Method

---

|  |
| --- |
| ModelPath Class   See Also |

A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Guid GetProjectGUID() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetProjectGUID As Guid ``` |

| Visual C++ |
| --- |
| ``` public: Guid GetProjectGUID() ``` |

# See Also

ModelPath Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| AssetProperty Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace

#### DesignReturnAirflow Property

---

|  |
| --- |
| Space Class   See Also |

Get or set the Specified Return Airflow of the Space.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double DesignReturnAirflow { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DesignReturnAirflow As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double DesignReturnAirflow { 	double get (); 	void set (double value); } ``` |

# Remarks

This property is used to get or set the Specified Return Airflow (Unit: CFM) of the Space.

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace

#### Illuminance Property

---

|  |
| --- |
| InitialIlluminanceIntensity Class   See Also |

The illuminance intensity value.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Illuminance { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Illuminance As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Illuminance { 	double get (); 	void set (double value); } ``` |

#### Field Value

The illuminance value in lx as a numerical value between 0 and 1e+30.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The illuminance value is not valid because it is not between 0 and 1e+30. |

# See Also

InitialIlluminanceIntensity Class

Autodesk.Revit.DB.Lighting Namespace

#### IdParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Id"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IdParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IdParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IdParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetAlternateUnitsFormatOptions Method

---

|  |
| --- |
| DimensionType Class   See Also |

Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FormatOptions GetAlternateUnitsFormatOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAlternateUnitsFormatOptions As FormatOptions ``` |

| Visual C++ |
| --- |
| ``` public: FormatOptions^ GetAlternateUnitsFormatOptions() ``` |

#### Return Value

A copy of the FormatOptions.

# See Also

DimensionType Class

Autodesk.Revit.DB Namespace

#### NetworkUnderConstrained Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

The network is under constrained. You may specify the design flow value in the missing branches, or cap the open ends.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NetworkUnderConstrained { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NetworkUnderConstrained As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NetworkUnderConstrained { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### PathReinAltOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Alternating Bar - Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinAltOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinAltOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinAltOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ReferenceArrayIterator Constructor

---

|  |
| --- |
| ReferenceArrayIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ReferenceArrayIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ReferenceArrayIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

ReferenceArrayIterator Class

Autodesk.Revit.DB Namespace

#### CreateFromCenterline Method

---

|  |
| --- |
| FabricationPartRouteEnd Class   See Also |

Create fabrication routing end from centreline point on straight element.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static FabricationPartRouteEnd CreateFromCenterline( 	Element element, 	XYZ ptAt ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateFromCenterline ( _ 	element As Element, _ 	ptAt As XYZ _ ) As FabricationPartRouteEnd ``` |

| Visual C++ |
| --- |
| ``` public: static FabricationPartRouteEnd^ CreateFromCenterline( 	Element^ element,  	XYZ^ ptAt ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The straight element that the centerline is on.

ptAt
:   Type:  Autodesk.Revit.DB XYZ
     A point along the straight element where the fitting to be cut in should be positioned.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationPartRouteEnd Class

Autodesk.Revit.DB.Fabrication Namespace

#### StairsAttrRiserMult Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Riser Multiplier"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrRiserMult { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrRiserMult As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrRiserMult { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidFaceReferenceForFaceWall Method

---

|  |
| --- |
| FaceWall Class   See Also |

Identifies if a reference may be used as the parent of a face wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool IsValidFaceReferenceForFaceWall( 	Document document, 	Reference faceReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidFaceReferenceForFaceWall ( _ 	document As Document, _ 	faceReference As Reference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidFaceReferenceForFaceWall( 	Document^ document,  	Reference^ faceReference ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

faceReference
:   Type:  Autodesk.Revit.DB Reference
     The reference.

#### Return Value

True if the reference is valid as a parent to a face wall, false otherwise.

# Remarks

The reference must represent a face of a massing instance, and must be planar, and its normal must not be vertical or horizontal.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FaceWall Class

Autodesk.Revit.DB Namespace

#### CubicFeetPerMinutePerBritishThermalUnitPerHour Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Cubic feet per minute per British thermal unit per hour.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CubicFeetPerMinutePerBritishThermalUnitPerHour { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CubicFeetPerMinutePerBritishThermalUnitPerHour As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CubicFeetPerMinutePerBritishThermalUnitPerHour { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### TextureRealWorldOffsetY Property

---

|  |
| --- |
| Wood Class   See Also |

The property labeled "Offset Y" from the "Wood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldOffsetY { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldOffsetY As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldOffsetY { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance".

# See Also

Wood Class

Autodesk.Revit.DB.Visual Namespace

#### TransferredProjectStandards Event

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017.2

# Syntax

| C# |
| --- |
| ``` public event EventHandler<TransferredProjectStandardsEventArgs> TransferredProjectStandards ``` |

| Visual Basic |
| --- |
| ``` Public Event TransferredProjectStandards As EventHandler(Of TransferredProjectStandardsEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<TransferredProjectStandardsEventArgs^>^ TransferredProjectStandards { 	void add (EventHandler<TransferredProjectStandardsEventArgs^>^ value); 	void remove (EventHandler<TransferredProjectStandardsEventArgs^>^ value); } ``` |

# Remarks

This event is raised just after the native Revit items have been transferred, but before the transaction has been committed. An add-in that registered external items in  TransferringProjectStandards  should subscribe to this event to carry out the transfer of any items that it registered if the user enabled those items for transfer. During the scope of this event, modification is permitted to the target document and modification is not permitted to the source document.

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### BottomOffset Property

---

|  |
| --- |
| Blend Class   See Also |

The offset of the bottom end of the blend relative to the sketch plane.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double BottomOffset { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BottomOffset As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BottomOffset { 	double get (); 	void set (double value); } ``` |

# See Also

Blend Class

Autodesk.Revit.DB Namespace

#### CanBeMatchedWithMultipleShapes Method

---

|  |
| --- |
| Rebar Class   See Also |

Checks if this Rebar can be matched with multiple Rebar Shapes.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool CanBeMatchedWithMultipleShapes() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanBeMatchedWithMultipleShapes As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanBeMatchedWithMultipleShapes() ``` |

#### Return Value

Returns true if this Rebar can be matched with multiple Rebar Shapes, false otherwise.

# Remarks

A Free Form Rebar that has Workshop Instructions set to Bent is considered that can be matched with multiple shapes.

A Free Form Rebar that has Workshop Instructions set to Straight or a Shape Driven Rebar is considered that can be matched with only one shape.

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### ContainsKey Method

---

|  |
| --- |
| ExportLineweightTable Class   See Also |

Checks whether a line weight key exists in the table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public bool ContainsKey( 	ExportLineweightKey exportLineweightKey ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ContainsKey ( _ 	exportLineweightKey As ExportLineweightKey _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool ContainsKey( 	ExportLineweightKey^ exportLineweightKey ) ``` |

#### Parameters

exportLineweightKey
:   Type:  Autodesk.Revit.DB ExportLineweightKey
     The export line weight key.

#### Return Value

True if the line weight exists in the table.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLineweightTable Class

Autodesk.Revit.DB Namespace

#### ParametersMap Property

---

|  |
| --- |
| Element Class   See Also |

Retrieves a map containing all of the parameters that are contained within the element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ParameterMap ParametersMap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ParametersMap As ParameterMap 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ParameterMap^ ParametersMap { 	ParameterMap^ get (); } ``` |

# Remarks

The Parameters can be rapidly accessed by parameter name as a key. These parameters are displayed in the Element properties dialog in the Autodesk Revit interface. These parameters can be retrieved and set via the parameter objects stored in this map.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### TooShort Property

---

|  |
| --- |
| BuiltInFailures CurveFailures Class   See Also |

Line is too short.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TooShort { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TooShort As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TooShort { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurveFailures Class

Autodesk.Revit.DB Namespace

#### CurveElemLineAngle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Angle"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurveElemLineAngle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurveElemLineAngle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurveElemLineAngle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PrepareForCell Method

---

|  |
| --- |
| PointCloudFilter Class   See Also |

Informs the filter that a series of points within a given cell is about to be checked.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void PrepareForCell( 	XYZ min, 	XYZ max, 	int numTests ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PrepareForCell ( _ 	min As XYZ, _ 	max As XYZ, _ 	numTests As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PrepareForCell( 	XYZ^ min,  	XYZ^ max,  	int numTests ) ``` |

#### Parameters

min
:   Type:  Autodesk.Revit.DB XYZ
     The lower corner of the cell.

max
:   Type:  Autodesk.Revit.DB XYZ
     The upper corner of the cell.

numTests
:   Type:  System Int32
     The engine's estimate of the number of TestPoint() calls it is going to make for this cell.

# Remarks

This is a performance hook that the filter can use to minimize computational work per TestPoint() call within a given cell. The engine should guarantee that all points passed to TestPoint() calls will fall inside the (min, max) box specified here. This promise must be in effect until the next PrepareForCell() call.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PointCloudFilter Class

Autodesk.Revit.DB.PointClouds Namespace

#### PoundForceFeet Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pound force feet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PoundForceFeet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PoundForceFeet As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PoundForceFeet { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### RampAttrLeftBalusterAttachPt Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Left Baluster Location"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RampAttrLeftBalusterAttachPt { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RampAttrLeftBalusterAttachPt As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RampAttrLeftBalusterAttachPt { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| FormArray Class   See Also |

Retrieve a backward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual FormArrayIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As FormArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual FormArrayIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the array.

# See Also

FormArray Class

Autodesk.Revit.DB Namespace

#### MarginType Property

---

|  |
| --- |
| PrintParameters Class   See Also |

The print margin type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public MarginType MarginType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MarginType As MarginType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property MarginType MarginType { 	MarginType get (); 	void set (MarginType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument is out of range. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the PaperPlacement is not Margins type. |

# See Also

PrintParameters Class

Autodesk.Revit.DB Namespace

#### BoundaryValidation Class

---

|  |
| --- |
| Members   See Also |

Curve loop validators.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public class BoundaryValidation : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class BoundaryValidation _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class BoundaryValidation : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BoundaryValidation

# See Also

BoundaryValidation Members

Autodesk.Revit.DB Namespace

#### IsParameterModifiable Method

---

|  |
| --- |
| Subelement Class   See Also |

Checks if given parameter of this subelement is modifiable.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool IsParameterModifiable( 	ElementId parameterId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsParameterModifiable ( _ 	parameterId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsParameterModifiable( 	ElementId^ parameterId ) ``` |

#### Parameters

parameterId
:   Type:  Autodesk.Revit.DB ElementId
     Parameter id.

#### Return Value

True if given parameter of this subelement is modifiable, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Subelement Class

Autodesk.Revit.DB Namespace

#### GetRelinquishedWorksets Method

---

|  |
| --- |
| RelinquishedItems Class   See Also |

The elements that were relinquished by the current user.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ICollection<WorksetId> GetRelinquishedWorksets() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRelinquishedWorksets As ICollection(Of WorksetId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<WorksetId^>^ GetRelinquishedWorksets() ``` |

# See Also

RelinquishedItems Class

Autodesk.Revit.DB Namespace

#### StairNotEnoughBoundaryCurvesError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StairNotEnoughBoundaryCurvesError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairNotEnoughBoundaryCurvesError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StairNotEnoughBoundaryCurvesError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### ElementTransformUtils Class

---

|  |
| --- |
| Members   See Also |

A collection of utilities allowing transformation of elements (e.g. move, rotate, mirror and copy).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static class ElementTransformUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class ElementTransformUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class ElementTransformUtils abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementTransformUtils

# See Also

ElementTransformUtils Members

Autodesk.Revit.DB Namespace

#### LeaderAtachement Enumeration

---

|  |
| --- |
| See Also |

Supported types of vertical attachments of a leader to a text note.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2016
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum LeaderAtachement ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LeaderAtachement ``` |

| Visual C++ |
| --- |
| ``` public enum class LeaderAtachement ``` |

# Members

| Member name | Description |
| --- | --- |
| TopLine | Leaders are attached at the position of the top (first) line of the text box, and, unless the text's border is visible, the leader's shoulder line extends all the way to the text, minus the current value of text border offset. |
| Midpoint | Leaders are aligned vertically with the midpoint of the text box and their shoulder line always ends at the box' border regardless of whether the border is visible on not. |
| BottomLine | Leaders are attached at the position of the bottom (last) line of the text box, and, unless the text's border is visible, the leader's shoulder line extends all the way to the text, minus the current value of text border offset. |

# See Also

Autodesk.Revit.DB Namespace

#### ExportLineweightTable Constructor

---

|  |
| --- |
| ExportLineweightTable Class   See Also |

Constructs a new ExportLineweightTable with default settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ExportLineweightTable() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ExportLineweightTable() ``` |

# See Also

ExportLineweightTable Class

Autodesk.Revit.DB Namespace

#### IsComponentFlipped Property

---

|  |
| --- |
| DividedSurface Class   See Also |

Whether the pattern is flipped.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsComponentFlipped { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsComponentFlipped As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsComponentFlipped { 	bool get (); 	void set (bool value); } ``` |

# Remarks

This property has no effect unless a pattern is selected (the ObjectType property is not    a null reference (  Nothing  in Visual Basic)  ). Changing this flag effectively reflects the component through its XY-plane, which is equivalent to reflecting it through the original surface.

# See Also

DividedSurface Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, FabricationServiceButton, Double, Double, ElementId)

---

|  |
| --- |
| FabricationPart Class   See Also |

Creates a fabrication part element based on button and size.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static FabricationPart Create( 	Document document, 	FabricationServiceButton button, 	double width, 	double depth, 	ElementId levelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	button As FabricationServiceButton, _ 	width As Double, _ 	depth As Double, _ 	levelId As ElementId _ ) As FabricationPart ``` |

| Visual C++ |
| --- |
| ``` public: static FabricationPart^ Create( 	Document^ document,  	FabricationServiceButton^ button,  	double width,  	double depth,  	ElementId^ levelId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

button
:   Type:  Autodesk.Revit.DB FabricationServiceButton
     The fabrication service button to use. Matches button condition based on the specified size.

width
:   Type:  System Double
     The width of the part. Units are in feet (ft).

depth
:   Type:  System Double
     The depth of the part. Units are in feet (ft). It should be equal to width for round part.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The element identifier associated with the  Level  the  FabricationPart  will be created on.

#### Return Value

The new fabrication part.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Fabrication service button contains invalid fittings. -or- Please use FabricationPart.CreateHanger to create fabrication hanger. -or- The ElementId levelId is not a Level. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices. -or- failing to match a button condition based on specific size. |

# See Also

FabricationPart Class

Create Overload

Autodesk.Revit.DB Namespace

#### IsValidNonContinuousRailProfile Method

---

|  |
| --- |
| NonContinuousRailInfo Class   See Also |

Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool IsValidNonContinuousRailProfile( 	ElementId profileId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidNonContinuousRailProfile ( _ 	profileId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidNonContinuousRailProfile( 	ElementId^ profileId ) ``` |

#### Parameters

profileId
:   Type:  Autodesk.Revit.DB ElementId
     The profile Id to be checked.

#### Return Value

True if the ElementId refers to a valid NonContinuousRail profile, false otherwise.

# Remarks

InvalidElementId  is considered a valid NonContinuousRail profile (the default profile).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

NonContinuousRailInfo Class

Autodesk.Revit.DB.Architecture Namespace

#### IFCData Constructor

---

|  |
| --- |
| IFCData Class   See Also |

Creates a copy object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IFCData( 	IFCData from ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	from As IFCData _ ) ``` |

| Visual C++ |
| --- |
| ``` public: IFCData( 	IFCData^ from ) ``` |

#### Parameters

from
:   Type:  Autodesk.Revit.DB.IFC IFCData
     The IFCData object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace

#### SpacingLayoutn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Layout"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacingLayoutn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacingLayoutn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacingLayoutn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FabricationPartSizeMap Constructor (String, Double, Double, Boolean)

---

|  |
| --- |
| FabricationPartSizeMap Class   See Also |

Creates a new instance of the FabricationPartSizeMap class.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.2

# Syntax

| C# |
| --- |
| ``` public FabricationPartSizeMap( 	string size, 	double widthDiameter, 	double depth, 	bool isProductList ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	size As String, _ 	widthDiameter As Double, _ 	depth As Double, _ 	isProductList As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FabricationPartSizeMap( 	String^ size,  	double widthDiameter,  	double depth,  	bool isProductList ) ``` |

#### Parameters

size
:   Type:  System String
     The size display string for the straight that can be used by the user interface.

widthDiameter
:   Type:  System Double
     The width or diameter of the straight.

depth
:   Type:  System Double
     The depth of the straight.

isProductList
:   Type:  System Boolean
     Set if the straight a product list or not.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationPartSizeMap Class

FabricationPartSizeMap Overload

Autodesk.Revit.DB.Fabrication Namespace

#### ForceRegenSketch Property

---

|  |
| --- |
| BuiltInFailures RegenFailures Class   See Also |

Regen Sketch

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ForceRegenSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ForceRegenSketch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ForceRegenSketch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RegenFailures Class

Autodesk.Revit.DB Namespace

#### DeleteSubElement Method

---

|  |
| --- |
| Form Class   See Also |

Delete a face/edge/curve/vertex of the form, specified by a reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void DeleteSubElement( 	Reference subElementReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub DeleteSubElement ( _ 	subElementReference As Reference _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void DeleteSubElement( 	Reference^ subElementReference ) ``` |

#### Parameters

subElementReference
:   Type:  Autodesk.Revit.DB Reference
     The geometry reference of face/edge/curve/vertex

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### IfcApplicationVersion Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"IfcApplicationVersion"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IfcApplicationVersion { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IfcApplicationVersion As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IfcApplicationVersion { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AllUsersAddinsLocation Property

---

|  |
| --- |
| ControlledApplication Class   See Also |

The folder location for .addin files for all users.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string AllUsersAddinsLocation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AllUsersAddinsLocation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ AllUsersAddinsLocation { 	String^ get (); } ``` |

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### StairsShowDownText Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Show Down Text"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsShowDownText { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsShowDownText As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsShowDownText { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MajorLapSpliceFailure Property

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   See Also |

The lap splice in the major direction is greater than the half of the overall length.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MajorLapSpliceFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MajorLapSpliceFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MajorLapSpliceFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace

#### RebarMaximSuffix Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Maxim Suffix"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarMaximSuffix { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarMaximSuffix As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarMaximSuffix { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| CompoundStructure Class   See Also |

Checks whether this CompoundStructure is empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsEmpty { 	bool get (); } ``` |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### AreOptionsValidForTransientDirectShape Method

---

|  |
| --- |
| DirectShape Class   See Also |

Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool AreOptionsValidForTransientDirectShape( 	DirectShapeOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AreOptionsValidForTransientDirectShape ( _ 	options As DirectShapeOptions _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AreOptionsValidForTransientDirectShape( 	DirectShapeOptions^ options ) ``` |

#### Parameters

options
:   Type:  Autodesk.Revit.DB DirectShapeOptions
     The options object.

#### Return Value

True if the DirectShapeOptions are valid; false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShape Class

Autodesk.Revit.DB Namespace

#### ElementPhaseStatusFilter Constructor (ElementId, ICollection(ElementOnPhaseStatus), Boolean)

---

|  |
| --- |
| ElementPhaseStatusFilter Class   See Also |

Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option to match all elements that have a phase status other than the input statuses.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementPhaseStatusFilter( 	ElementId phaseId, 	ICollection<ElementOnPhaseStatus> phaseStatuses, 	bool inverted ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	phaseId As ElementId, _ 	phaseStatuses As ICollection(Of ElementOnPhaseStatus), _ 	inverted As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementPhaseStatusFilter( 	ElementId^ phaseId,  	ICollection<ElementOnPhaseStatus>^ phaseStatuses,  	bool inverted ) ``` |

#### Parameters

phaseId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the phase.

phaseStatuses
:   Type:  System.Collections.Generic ICollection   ElementOnPhaseStatus
     Target statuses.

inverted
:   Type:  System Boolean
     True to match all phase statuses other than the input statuses.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementPhaseStatusFilter Class

ElementPhaseStatusFilter Overload

Autodesk.Revit.DB Namespace

#### SteelElemHoleType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemHoleType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemHoleType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemHoleType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LessThan Operator

---

|  |
| --- |
| ForgeTypeId Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool operator <( 	ForgeTypeId lhs, 	ForgeTypeId rhs ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Operator < ( _ 	lhs As ForgeTypeId, _ 	rhs As ForgeTypeId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool operator <( 	ForgeTypeId^ lhs,  	ForgeTypeId^ rhs ) ``` |

#### Parameters

lhs
:   Type:  Autodesk.Revit.DB ForgeTypeId

rhs
:   Type:  Autodesk.Revit.DB ForgeTypeId

# See Also

ForgeTypeId Class

Autodesk.Revit.DB Namespace

#### CoordinateSystem Property

---

|  |
| --- |
| IConnector Interface   See Also |

The coordinate system of the connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` Transform CoordinateSystem { get; } ``` |

| Visual Basic |
| --- |
| ``` ReadOnly Property CoordinateSystem As Transform 	Get ``` |

| Visual C++ |
| --- |
| ``` property Transform^ CoordinateSystem { 	Transform^ get (); } ``` |

# Remarks

The Z axis of the coordinate system is the normal to the plane of the connector.

# See Also

IConnector Interface

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ExportLineweightTableIterator Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ExportLineweightTableIterator Class

Autodesk.Revit.DB Namespace

#### LitersPerSecond Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Liters per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LitersPerSecond { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LitersPerSecond As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LitersPerSecond { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### SpotSlopePrefix Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Prefix"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpotSlopePrefix { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotSlopePrefix As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpotSlopePrefix { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AlternateUnitsSuffix Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Alternate Units Suffix"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AlternateUnitsSuffix { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AlternateUnitsSuffix As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AlternateUnitsSuffix { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsDuctSystemTypeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"System Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsDuctSystemTypeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsDuctSystemTypeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsDuctSystemTypeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CurveTooShort Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Line is too short.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CurveTooShort { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurveTooShort As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CurveTooShort { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### CouplerTypeInvalid Property

---

|  |
| --- |
| BuiltInFailures RebarCouplerFailures Class   See Also |

This coupler type does not fit on the selected bar(s). Post error to delete the coupler.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CouplerTypeInvalid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CouplerTypeInvalid As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CouplerTypeInvalid { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarCouplerFailures Class

Autodesk.Revit.DB Namespace

#### LineColor Property

---

|  |
| --- |
| MEPSystemType Class   See Also |

Indicates the color that should override the line color for all components in the system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Color LineColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LineColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ LineColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

MEPSystemType Class

Autodesk.Revit.DB Namespace

#### Curve Property

---

|  |
| --- |
| Dimension Class   See Also |

A curve that represents the dimension line.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Curve Curve { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Curve As Curve 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Curve^ Curve { 	Curve^ get (); } ``` |

# See Also

Dimension Class

Autodesk.Revit.DB Namespace

#### MullionTypeSet Class

---

|  |
| --- |
| Members   See Also |

A set that contains mullion types.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class MullionTypeSet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class MullionTypeSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class MullionTypeSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB MullionTypeSet

# See Also

MullionTypeSet Members

Autodesk.Revit.DB Namespace

#### ProhibitSwitchToIssuedRevision Property

---

|  |
| --- |
| BuiltInFailures RevisionCloudFailures Class   See Also |

Can't add cloud to an Issued Revision.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ProhibitSwitchToIssuedRevision { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ProhibitSwitchToIssuedRevision As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ProhibitSwitchToIssuedRevision { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RevisionCloudFailures Class

Autodesk.Revit.DB Namespace

#### PointCloudColorSettings Constructor

---

|  |
| --- |
| PointCloudColorSettings Class   See Also |

Constructs color settings object with default colors.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public PointCloudColorSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: PointCloudColorSettings() ``` |

# See Also

PointCloudColorSettings Class

PointCloudColorSettings Overload

Autodesk.Revit.DB.PointClouds Namespace

#### CannotDivideCurtainGrid Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Can't divide Curtain Grid by Grid Line.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDivideCurtainGrid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDivideCurtainGrid As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDivideCurtainGrid { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### Unload Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

Unloads the Revit link.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Unload( 	ISaveSharedCoordinatesCallback callback ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Unload ( _ 	callback As ISaveSharedCoordinatesCallback _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Unload( 	ISaveSharedCoordinatesCallback^ callback ) ``` |

#### Parameters

callback
:   Type:  Autodesk.Revit.DB ISaveSharedCoordinatesCallback
     A callback indicating what to do if Revit encounters links which have changes in shared coordinates. If    a null reference (  Nothing  in Visual Basic)  , Revit will not save any shared coordinates changes to the link before unloading.

# Remarks

This function regenerates the document.

The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone. All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | The function is not permitted during dynamic update. |
| Autodesk.Revit.Exceptions InvalidOperationException | This RevitLinkType is not a top-level link. -or- The element "this RevitLinkType" is in a closed workset. -or- Revit could not save shared coordinates changes to the link or one of its nested links. -or- There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method. -or- The document is read-only. It cannot be modified. -or- The document is in an edit mode or is in family mode. -or- Revit cannot link a cloud model to non-cloud model |
| Autodesk.Revit.Exceptions RevitServerInternalException | Could be for any of the reasons that failed on service side. |
| Autodesk.Revit.Exceptions RevitServerUnauthenticatedUserException | User is not signed in with Autodesk id. |
| Autodesk.Revit.Exceptions RevitServerUnauthorizedException | User is not authorized to access the specified cloud model. |

# See Also

RevitLinkType Class

Autodesk.Revit.DB Namespace

#### DocumentReloadedLatest Event

---

|  |
| --- |
| Application Class   See Also |

Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentReloadedLatestEventArgs> DocumentReloadedLatest ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentReloadedLatest As EventHandler(Of DocumentReloadedLatestEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentReloadedLatestEventArgs^>^ DocumentReloadedLatest { 	void add (EventHandler<DocumentReloadedLatestEventArgs^>^ value); 	void remove (EventHandler<DocumentReloadedLatestEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished reloading latest changes from a central model. It is raised even when document reloading latest changes from a central model failed or was cancelled (during DocumentReloadingLatest event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' field in event's argument to see whether the action itself was successful or not.

This event is not cancellable, for the process of reloading latest changes from a central model has already been finished.

If the action was not successful, the document may not be modified and new transactions may not be started.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### CircularFramingDiameter Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Circular Diameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CircularFramingDiameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CircularFramingDiameter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CircularFramingDiameter { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ConceptualConstructionShadeType Enumeration

---

|  |
| --- |
| See Also |

ConceptualConstructionType values for Shades.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum ConceptualConstructionShadeType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConceptualConstructionShadeType ``` |

| Visual C++ |
| --- |
| ``` public enum class ConceptualConstructionShadeType ``` |

# Members

| Member name | Description |
| --- | --- |
| InvalidShadeTypeConstruction | Invalid value/not set Shade Type Construction |
| BasicShade | Basic Shade |
| NumShadeTypeConstruction | Total Number of Shade Type Constructions |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### StirrupTieBendDiameter Property

---

|  |
| --- |
| BarTypeDiameterOptions Class   See Also |

Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public double StirrupTieBendDiameter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StirrupTieBendDiameter As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double StirrupTieBendDiameter { 	double get (); 	void set (double value); } ``` |

# See Also

BarTypeDiameterOptions Class

Autodesk.Revit.DB Namespace

#### IsUnitLength Method

---

|  |
| --- |
| XYZ Class   See Also |

The boolean value that indicates whether this vector is of unit length.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsUnitLength() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsUnitLength As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsUnitLength() ``` |

# Remarks

A unit length vector has a length of one, and is considered normalized.

# See Also

XYZ Class

Autodesk.Revit.DB Namespace

#### ExportFontKey Constructor (String)

---

|  |
| --- |
| ExportFontKey Class   See Also |

Constructs a new ExportFontKey using an input font name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExportFontKey( 	string originalFontName ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	originalFontName As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ExportFontKey( 	String^ originalFontName ) ``` |

#### Parameters

originalFontName
:   Type:  System String
     The original font name.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportFontKey Class

ExportFontKey Overload

Autodesk.Revit.DB Namespace

#### ProfileSketch Property

---

|  |
| --- |
| Sweep Class   See Also |

The profile sketch of the sweep.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Sketch ProfileSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ProfileSketch As Sketch 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Sketch^ ProfileSketch { 	Sketch^ get (); } ``` |

# Remarks

If the profile is not based on sketched curves, this property is    a null reference (  Nothing  in Visual Basic)  .

# See Also

Sweep Class

Autodesk.Revit.DB Namespace

#### RbsFpSprinklerOrificeSizeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Orifice Size"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsFpSprinklerOrificeSizeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsFpSprinklerOrificeSizeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsFpSprinklerOrificeSizeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### UserHasGraphicOverrides Method

---

|  |
| --- |
| WorksharingDisplaySettings Class   See Also |

Checks whether there are graphic overrides that would apply to elements owned by the given user in the "Individual Owners" display mode.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool UserHasGraphicOverrides( 	string username ) ``` |

| Visual Basic |
| --- |
| ``` Public Function UserHasGraphicOverrides ( _ 	username As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool UserHasGraphicOverrides( 	String^ username ) ``` |

#### Parameters

username
:   Type:  System String
     The username to check

#### Return Value

True if there are graphic overrides assigned to the username, false otherwise.

# Remarks

There will always be graphic overrides for all users included in the user table. In addition, there may be other users who have been explicitly assigned overrides.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace

#### MultusegmentRampRiserError Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Ramp can't have multisegment Riser.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MultusegmentRampRiserError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MultusegmentRampRiserError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MultusegmentRampRiserError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### StairsDbgShowRunGeom Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Show Run Geometry"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsDbgShowRunGeom { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsDbgShowRunGeom As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsDbgShowRunGeom { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FailedToRemoveElement Property

---

|  |
| --- |
| BuiltInFailures ElementFailures Class   See Also |

Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FailedToRemoveElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FailedToRemoveElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FailedToRemoveElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElementFailures Class

Autodesk.Revit.DB Namespace

#### GetValidCategoriesForKeySchedule Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Gets a list of categories that can be used for a key schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetValidCategoriesForKeySchedule() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetValidCategoriesForKeySchedule As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetValidCategoriesForKeySchedule() ``` |

#### Return Value

The IDs of all valid categories.

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### FunctionId Property

---

|  |
| --- |
| ApplicationException Class   See Also |

The information of the function throwing the exception.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FunctionId FunctionId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FunctionId As FunctionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property FunctionId^ FunctionId { 	FunctionId^ get (); } ``` |

# See Also

ApplicationException Class

Autodesk.Revit.Exceptions Namespace

#### Intersecting Property

---

|  |
| --- |
| BuiltInFailures PlanRegionFailures Class   See Also |

The boundaries of the highlighted Plan Regions overlap.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId Intersecting { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Intersecting As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ Intersecting { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PlanRegionFailures Class

Autodesk.Revit.DB Namespace

#### IsVisibleParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Visible"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IsVisibleParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IsVisibleParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IsVisibleParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| BoundingBoxUV Class   See Also |

Releases all resources used by the  BoundingBoxUV

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

BoundingBoxUV Class

Autodesk.Revit.DB Namespace

#### RemoveTemperatureRatingType Method

---

|  |
| --- |
| WireMaterialType Class   See Also |

Remove an existing temperature rating type from this material type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void RemoveTemperatureRatingType( 	TemperatureRatingType temperatureRating ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveTemperatureRatingType ( _ 	temperatureRating As TemperatureRatingType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveTemperatureRatingType( 	TemperatureRatingType^ temperatureRating ) ``` |

#### Parameters

temperatureRating
:   Type:  Autodesk.Revit.DB.Electrical TemperatureRatingType
     The temperature rating type to be removed.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The last temperature rating type of project and any one used by a wire type can't be removed. |

# See Also

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace

#### RebarPresentationMode Enumeration

---

|  |
| --- |
| See Also |

Bar presentation mode

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum RebarPresentationMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RebarPresentationMode ``` |

| Visual C++ |
| --- |
| ``` public enum class RebarPresentationMode ``` |

# Members

| Member name | Description |
| --- | --- |
| All | All bars are presented. |
| FirstLast | The first and last bars are presented. |
| Middle | The middle bar is presented. |
| Select | Selected bars are presented. |

# See Also

Autodesk.Revit.DB.Structure Namespace

#### IsConnected Property

---

|  |
| --- |
| Connector Class   See Also |

Identifies if the connector is physically connected to a connector on another element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsConnected { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsConnected As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsConnected { 	bool get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the connector's type is LogicalConn. |

# See Also

Connector Class

Autodesk.Revit.DB Namespace

#### HVACLoadConstructionClass Enumeration

---

|  |
| --- |
| See Also |

Enumerated type listing options for construction class for HVAC analysis.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum HVACLoadConstructionClass ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration HVACLoadConstructionClass ``` |

| Visual C++ |
| --- |
| ``` public enum class HVACLoadConstructionClass ``` |

# Members

| Member name | Description |
| --- | --- |
| LooseConstruction | A loose construction has an infiltration level of approximately 0.076 cfm/sqft |
| MediumConstruction | A medium construction has an infiltration level of approximately 0.038 cfm/sqft |
| TightConstruction | A tight construction has an infiltration level of approximately 0.019 cfm/sqft |
| NoneConstruction | A none construction has an infiltration level of 0 cfm/sqft |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### ExportLineweightTableIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a set of line weight table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>> ``` |

| Visual Basic |
| --- |
| ``` Public Class ExportLineweightTableIterator _ 	Implements IEnumerator(Of KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo)) ``` |

| Visual C++ |
| --- |
| ``` public ref class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^>> ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExportLineweightTableIterator

# See Also

ExportLineweightTableIterator Members

Autodesk.Revit.DB Namespace

#### PhaseStatusPresentation Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing the options for element display in a phase filter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum PhaseStatusPresentation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PhaseStatusPresentation ``` |

| Visual C++ |
| --- |
| ``` public enum class PhaseStatusPresentation ``` |

# Members

| Member name | Description |
| --- | --- |
| DontShow | Don't show elements from the given phase status. |
| ShowByCategory | Show elements from the given phase status by category. |
| ShowOverriden | Show elements from the given phase status by graphics overrides. |

# See Also

Autodesk.Revit.DB Namespace

#### CeramicBump Property

---

|  |
| --- |
| Ceramic Class   See Also |

The property labeled "Type" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CeramicBump { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CeramicBump As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CeramicBump { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicBumpType".

# See Also

Ceramic Class

Autodesk.Revit.DB.Visual Namespace

#### RbsHvacloadWindowCoolingLoadParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Window Cooling Load"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsHvacloadWindowCoolingLoadParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsHvacloadWindowCoolingLoadParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsHvacloadWindowCoolingLoadParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| ReferenceArrayArray Class   See Also |

Retrieve a backward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual ReferenceArrayArrayIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As ReferenceArrayArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual ReferenceArrayArrayIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the array.

# See Also

ReferenceArrayArray Class

Autodesk.Revit.DB Namespace

#### PushExportState Method

---

|  |
| --- |
| ExporterIFC Class   See Also |

Sets the internal state of the exporter to process the geometry and properties of the input element.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void PushExportState( 	Element Elem, 	GeometryElement GRep ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PushExportState ( _ 	Elem As Element, _ 	GRep As GeometryElement _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PushExportState( 	Element^ Elem,  	GeometryElement^ GRep ) ``` |

#### Parameters

Elem
:   Type:  Autodesk.Revit.DB Element
     The element.

GRep
:   Type:  Autodesk.Revit.DB GeometryElement
     The geometry of the element. Optional, can be    a null reference (  Nothing  in Visual Basic)  .

# Remarks

The element will be assigned until PopExportState() is called.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace

#### Flipped Property

---

|  |
| --- |
| Wall Class   See Also |

Property to test whether the wall orientation is flipped.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Flipped { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Flipped As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool Flipped { 	bool get (); } ``` |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### OpenIFCDocument Method (String, IFCImportOptions)

---

|  |
| --- |
| Application Class   See Also |

Opens an IFC document from disk using custom options.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public Document OpenIFCDocument( 	string fileName, 	IFCImportOptions importOptions ) ``` |

| Visual Basic |
| --- |
| ``` Public Function OpenIFCDocument ( _ 	fileName As String, _ 	importOptions As IFCImportOptions _ ) As Document ``` |

| Visual C++ |
| --- |
| ``` public: Document^ OpenIFCDocument( 	String^ fileName,  	IFCImportOptions^ importOptions ) ``` |

#### Parameters

fileName
:   Type:  System String
     The IFC file to be opened.

importOptions
:   Type:  Autodesk.Revit.DB.IFC IFCImportOptions
     The options for this import.

#### Return Value

The newly created document containing the IFC file.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | If 'fileName' is an empty string. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | If the file specified by 'fileName' cannot be found. |
| Autodesk.Revit.Exceptions InvalidOperationException | If Revit is missing document templates or if the file cannot be opened. |

# See Also

Application Class

OpenIFCDocument Overload

Autodesk.Revit.ApplicationServices Namespace

#### FabricationPartDiameterIn Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Main Primary Diameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationPartDiameterIn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartDiameterIn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationPartDiameterIn { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SchedulableField Class

---

|  |
| --- |
| Members   See Also |

A non-calculated field eligible to be included in a schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class SchedulableField : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class SchedulableField _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class SchedulableField : IDisposable ``` |

# Remarks

The SchedulableField class represents a non-calculated field that is eligible to be included in a schedule. A list of fields that can be included in a schedule can be obtained from ScheduleDefinition.GetSchedulableFields.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB SchedulableField

# See Also

SchedulableField Members

Autodesk.Revit.DB Namespace

#### TextElementType Class

---

|  |
| --- |
| Members   See Also |

An object that represents a text style.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class TextElementType : LineAndTextAttrSymbol ``` |

| Visual Basic |
| --- |
| ``` Public Class TextElementType _ 	Inherits LineAndTextAttrSymbol ``` |

| Visual C++ |
| --- |
| ``` public ref class TextElementType : public LineAndTextAttrSymbol ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB LineAndTextAttrSymbol
  Autodesk.Revit.DB TextElementType
  Autodesk.Revit.DB TextNoteType

# See Also

TextElementType Members

Autodesk.Revit.DB Namespace

#### CreateViewTemplate Method

---

|  |
| --- |
| View Class   See Also |

Creates a new view template instance from this view instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public View CreateViewTemplate() ``` |

| Visual Basic |
| --- |
| ``` Public Function CreateViewTemplate As View ``` |

| Visual C++ |
| --- |
| ``` public: View^ CreateViewTemplate() ``` |

#### Return Value

New view template instance

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The view is not valid for view template creation. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| ExternalApplicationArray Class   See Also |

Insert the specified item into the array.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Insert( 	IExternalApplication item, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Insert ( _ 	item As IExternalApplication, _ 	index As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Insert( 	IExternalApplication^ item,  	int index ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.UI IExternalApplication
     The item to be inserted into the array.

index
:   Type:  System Int32
     The item will be inserted before this index.

#### Return Value

Returns whether the item was inserted into the array.

# See Also

ExternalApplicationArray Class

Autodesk.Revit.UI Namespace

#### AnalyticalMemberForceStartAllNonZero Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"All non 0 forces at start"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalMemberForceStartAllNonZero { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalMemberForceStartAllNonZero As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalMemberForceStartAllNonZero { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SurfaceDepreciationLossFactor Property

---

|  |
| --- |
| AdvancedLossFactor Class   See Also |

The surface depreciation loss factor.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double SurfaceDepreciationLossFactor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SurfaceDepreciationLossFactor As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SurfaceDepreciationLossFactor { 	double get (); 	void set (double value); } ``` |

#### Field Value

The loss factor as a numerical value between 0.0 and 1.0

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0. |

# See Also

AdvancedLossFactor Class

Autodesk.Revit.DB.Lighting Namespace

#### Current Property

---

|  |
| --- |
| DefinitionBindingMapIterator Class   See Also |

Retrieves the binding that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

DefinitionBindingMapIterator Class

Autodesk.Revit.DB Namespace

#### SetAttribute Method (String, String)

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

Sets the attribute value.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetAttribute( 	string name, 	string value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAttribute ( _ 	name As String, _ 	value As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAttribute( 	String^ name,  	String^ value ) ``` |

#### Parameters

name
:   Type:  System String
     The attribute name.

value
:   Type:  System String
     The value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace

#### GetFunctions Method

---

|  |
| --- |
| FormulaManager Class   See Also |

Gets list of function names supported by formula engine

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static IList<string> GetFunctions() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetFunctions As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<String^>^ GetFunctions() ``` |

# See Also

FormulaManager Class

Autodesk.Revit.DB Namespace

#### Color Property

---

|  |
| --- |
| ColorBackgroundSettings Class   See Also |

The color of the rendering background.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public Color Color { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Color As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ Color { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ColorBackgroundSettings Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| VoltageTypeSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

VoltageTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### HookAngle Property

---

|  |
| --- |
| RebarHookType Class   See Also |

The hook angle, measured in radians. Must be greater than 0 and no more than pi.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double HookAngle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property HookAngle As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double HookAngle { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The given value for hookAngle is not a number |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: hookAngle must be greater than 0 and no more than pi. |

# See Also

RebarHookType Class

Autodesk.Revit.DB.Structure Namespace

#### ShortCurveInSketch Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

The sketch contains an extremely short line.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ShortCurveInSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ShortCurveInSketch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ShortCurveInSketch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### ImportInstance Class

---

|  |
| --- |
| Members   See Also |

An element created during either import or link operation. It is an instance of CADLinkType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public class ImportInstance : Instance ``` |

| Visual Basic |
| --- |
| ``` Public Class ImportInstance _ 	Inherits Instance ``` |

| Visual C++ |
| --- |
| ``` public ref class ImportInstance : public Instance ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB Instance
  Autodesk.Revit.DB ImportInstance

# See Also

ImportInstance Members

Autodesk.Revit.DB Namespace

#### ControlledApplication Property

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Returns the database level ControlledApplication represented by this UI-level ControlledApplication.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ControlledApplication ControlledApplication { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ControlledApplication As ControlledApplication 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ControlledApplication^ ControlledApplication { 	ControlledApplication^ get (); } ``` |

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### ColumnHeaders Property

---

|  |
| --- |
| ViewScheduleExportOptions Class   See Also |

How to export column headers. Default is MultipleRows.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ExportColumnHeaders ColumnHeaders { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ColumnHeaders As ExportColumnHeaders 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ExportColumnHeaders ColumnHeaders { 	ExportColumnHeaders get (); 	void set (ExportColumnHeaders value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ViewScheduleExportOptions Class

Autodesk.Revit.DB Namespace

#### ReuseLocalPlacement Property

---

|  |
| --- |
| IFCExtrusionCreationData Class   See Also |

Allows re-use of local placement when creating a new local placement due to shifting of breps when moving towards the origin.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool ReuseLocalPlacement { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ReuseLocalPlacement As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ReuseLocalPlacement { 	bool get (); 	void set (bool value); } ``` |

# See Also

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace

#### AnalyticalModelTopExtensionMethod Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Extension Method"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalModelTopExtensionMethod { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalModelTopExtensionMethod As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalModelTopExtensionMethod { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LooseCurtainWallData Property

---

|  |
| --- |
| BuiltInFailures LooseDimensionFailures Class   See Also |

Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LooseCurtainWallData { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LooseCurtainWallData As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LooseCurtainWallData { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures LooseDimensionFailures Class

Autodesk.Revit.DB Namespace

#### IsProductList Property

---

|  |
| --- |
| FabricationPartSizeMap Class   See Also |

Are the sizes for a product listed fabrication part.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.2

# Syntax

| C# |
| --- |
| ``` public bool IsProductList { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsProductList As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsProductList { 	bool get (); 	void set (bool value); } ``` |

# See Also

FabricationPartSizeMap Class

Autodesk.Revit.DB.Fabrication Namespace

#### GetBoundaryFaceInfo Method

---

|  |
| --- |
| SpatialElementGeometryResults Class   See Also |

Query the spatial element boundary face information with the given face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<SpatialElementBoundarySubface> GetBoundaryFaceInfo( 	Face face ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBoundaryFaceInfo ( _ 	face As Face _ ) As IList(Of SpatialElementBoundarySubface) ``` |

| Visual C++ |
| --- |
| ``` public: IList<SpatialElementBoundarySubface^>^ GetBoundaryFaceInfo( 	Face^ face ) ``` |

#### Parameters

face
:   Type:  Autodesk.Revit.DB Face
     The face from the spatial element's geometry.

#### Return Value

Sub-faces related to the room bounding elements that define the spatial element face. Returns    a null reference (  Nothing  in Visual Basic)  if there is no corresponding boundary information with the given face.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SpatialElementGeometryResults Class

Autodesk.Revit.DB Namespace

#### AlignmentStationLabelSetOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Alignment Station Label Set Offset": The text is not used directly anywhere in the UI, instead the XAML specifies its own string for the value's label.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AlignmentStationLabelSetOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AlignmentStationLabelSetOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AlignmentStationLabelSetOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairsLandingBaseElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Relative Height": Height

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsLandingBaseElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsLandingBaseElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsLandingBaseElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralAnalyticalHardPoints Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Use hard-points"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralAnalyticalHardPoints { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralAnalyticalHardPoints As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralAnalyticalHardPoints { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SupportCheckDone Property

---

|  |
| --- |
| BuiltInFailures AnalyticalModelFailures Class   See Also |

Member support check is complete. No unsupported elements detected.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SupportCheckDone { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SupportCheckDone As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SupportCheckDone { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AnalyticalModelFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ScheduleField Class   See Also |

Releases all resources used by the  ScheduleField

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### CannotKeepAnalyticalAdjustment Property

---

|  |
| --- |
| BuiltInFailures AnalyticalModelFailures Class   See Also |

Analytical model Adjustment distance exceeds current Adjustment Snapping Distance. To adjust snap settings, go to the Structural Settings Dialog.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotKeepAnalyticalAdjustment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotKeepAnalyticalAdjustment As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotKeepAnalyticalAdjustment { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AnalyticalModelFailures Class

Autodesk.Revit.DB Namespace

#### TrussElementEnd0Elevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Start Level Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TrussElementEnd0Elevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrussElementEnd0Elevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TrussElementEnd0Elevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsConnectorDescription Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Connector Description"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsConnectorDescription { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsConnectorDescription As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsConnectorDescription { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Code Property

---

|  |
| --- |
| FabricationServiceButton Class   See Also |

The code of the button.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public string Code { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Code As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Code { 	String^ get (); } ``` |

# See Also

FabricationServiceButton Class

Autodesk.Revit.DB Namespace

#### FabricationOutOfSizeCondition Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The fabrication part size is not within the correct size range for the service button condition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationOutOfSizeCondition { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationOutOfSizeCondition As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationOutOfSizeCondition { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### GetRule Method

---

|  |
| --- |
| RoutingPreferenceManager Class   See Also |

Gets the specified rule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public RoutingPreferenceRule GetRule( 	RoutingPreferenceRuleGroupType groupType, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRule ( _ 	groupType As RoutingPreferenceRuleGroupType, _ 	index As Integer _ ) As RoutingPreferenceRule ``` |

| Visual C++ |
| --- |
| ``` public: RoutingPreferenceRule^ GetRule( 	RoutingPreferenceRuleGroupType groupType,  	int index ) ``` |

#### Parameters

groupType
:   Type:  Autodesk.Revit.DB RoutingPreferenceRuleGroupType
     The routing preference group type from which the rule should be returned.

index
:   Type:  System Int32
     The zero-based index where the rule should be returned.

#### Return Value

The rule at the specified group and zero-based index position.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | index is not a valid zero-based index within groupType. -or- Thrown if the index is out of bounds |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

RoutingPreferenceManager Class

Autodesk.Revit.DB Namespace

#### Voltage Property

---

|  |
| --- |
| AnalyticalTransferSwitchData Class   See Also |

The voltage value of the electrical analytical transfer switch.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public double Voltage { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Voltage As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Voltage { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The given value for voltage is not a number -or- When setting this property: The given value for voltage is not finite |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for voltage must be positive. |

# See Also

AnalyticalTransferSwitchData Class

Autodesk.Revit.DB.Electrical Namespace

#### StairsRunWinderBeginWithStraight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Begin with Straight Run": Winder begin with straight run

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRunWinderBeginWithStraight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRunWinderBeginWithStraight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRunWinderBeginWithStraight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarSystemBarTypeBottomDirn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Minor Bar Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemBarTypeBottomDirn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemBarTypeBottomDirn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemBarTypeBottomDirn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ParameterValueProvider Constructor

---

|  |
| --- |
| ParameterValueProvider Class   See Also |

Constructs an instance of ParameterValueProvider.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ParameterValueProvider( 	ElementId parameter ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	parameter As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ParameterValueProvider( 	ElementId^ parameter ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     The parameter used to provide a string, integer, and double-precision, or ElementId value on request for a given element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterValueProvider Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| CurtainGridSet Class   See Also |

Retrieve a backward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CurtainGridSetIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As CurtainGridSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual CurtainGridSetIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the set.

# See Also

CurtainGridSet Class

Autodesk.Revit.DB Namespace

#### MechanicalEquipmentSetIdParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mechanical Equipment Set"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MechanicalEquipmentSetIdParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MechanicalEquipmentSetIdParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MechanicalEquipmentSetIdParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SpotElevTickMarkPen Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Leader Arrowhead Line Weight"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpotElevTickMarkPen { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotElevTickMarkPen As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpotElevTickMarkPen { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CreateGreaterRule Method (ElementId, Int32)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether integer values from the document are greater than a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateGreaterRule( 	ElementId parameter, 	int value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateGreaterRule ( _ 	parameter As ElementId, _ 	value As Integer _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateGreaterRule( 	ElementId^ parameter,  	int value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     An integer-typed parameter used to get values from the document for a given element.

value
:   Type:  System Int32
     The user-supplied value against which values from the document will be compared.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateGreaterRule Overload

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| CitySet Class   See Also |

Returns the number of cities that are in the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

CitySet Class

Autodesk.Revit.DB Namespace

#### SteelElemPlateWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Width"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemPlateWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemPlateWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemPlateWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetOptions Method

---

|  |
| --- |
| ImporterIFC Class   See Also |

Gets the collection of named options set by the importer client.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IDictionary<string, string> GetOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetOptions As IDictionary(Of String, String) ``` |

| Visual C++ |
| --- |
| ``` public: IDictionary<String^, String^>^ GetOptions() ``` |

#### Return Value

The collection of named options.

# See Also

ImporterIFC Class

Autodesk.Revit.DB.IFC Namespace

#### Contains Method

---

|  |
| --- |
| PlanCircuitSet Class   See Also |

Tests for the existence of an item within the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Contains( 	PlanCircuit item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Contains ( _ 	item As PlanCircuit _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Contains( 	PlanCircuit^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB PlanCircuit
     The item to be searched for.

#### Return Value

The Contains method returns True if the item is within the set, otherwise False.

# See Also

PlanCircuitSet Class

Autodesk.Revit.DB Namespace

#### RampDoesntReachOffset Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The ramp is not long enough to reach the top constraint plus top offset. Change the slope or increase the length of the ramp.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RampDoesntReachOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RampDoesntReachOffset As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RampDoesntReachOffset { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### SurfaceNormal Property

---

|  |
| --- |
| AdvancedGlazing Class   See Also |

The property labeled "Image" from the "AdvancedGlazing" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static string SurfaceNormal { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceNormal As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SurfaceNormal { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

# See Also

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace

#### AnyPatternIdParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Fill Pattern"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnyPatternIdParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnyPatternIdParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnyPatternIdParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FramingShapeClassification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Framing Shape"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FramingShapeClassification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FramingShapeClassification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FramingShapeClassification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetFillPattern Method

---

|  |
| --- |
| FillPatternElement Class   See Also |

Sets the FillPattern associated to this element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetFillPattern( 	FillPattern newFillPattern ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFillPattern ( _ 	newFillPattern As FillPattern _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFillPattern( 	FillPattern^ newFillPattern ) ``` |

#### Parameters

newFillPattern
:   Type:  Autodesk.Revit.DB FillPattern
     The new FillPattern object.

# Remarks

The data stored inside the input FillPattern will be copied into this element. The input FillPattern itself will not be associated with the element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | newFillPattern does not have a valid Target. -or- newFillPattern does not have a valid Name. -or- newFillPattern is a solid fill pattern. -or- newFillPattern contains FillGrids with a zero Offset. -or- The name of the newFillPattern already exists. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The element is the build-in solid fill pattern element and can not be modified. |

# See Also

FillPatternElement Class

Autodesk.Revit.DB Namespace

#### Append Method

---

|  |
| --- |
| DimensionSegmentArray Class   See Also |

Add the item to the end of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Append( 	DimensionSegment item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Append ( _ 	item As DimensionSegment _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Append( 	DimensionSegment^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB DimensionSegment
     The item to be added.

# See Also

DimensionSegmentArray Class

Autodesk.Revit.DB Namespace

#### PathReinTypen1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Primary Bar - Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinTypen1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinTypen1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinTypen1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsWallJoinedToTop Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Checks if wall is joined to top.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool IsWallJoinedToTop( 	Wall wall ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsWallJoinedToTop ( _ 	wall As Wall _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsWallJoinedToTop( 	Wall^ wall ) ``` |

#### Parameters

wall
:   Type:  Autodesk.Revit.DB Wall
     The wall.

#### Return Value

True if wall is joined to top, false if not.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### SetValueAsDoubles Method

---

|  |
| --- |
| AssetPropertyDoubleArray4d Class   See Also |

Sets the value of the property.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public void SetValueAsDoubles( 	IList<double> value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetValueAsDoubles ( _ 	value As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetValueAsDoubles( 	IList<double>^ value ) ``` |

#### Parameters

value
:   Type:  System.Collections.Generic IList   Double
     The new value as doubles.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input value is invalid for this AssetPropertyDoubleArray4d property. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The asset property is not editable. |

# See Also

AssetPropertyDoubleArray4d Class

Autodesk.Revit.DB.Visual Namespace

#### CreateAnalysisDisplayStyle Method (Document, String, AnalysisDisplayVectorSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings)

---

|  |
| --- |
| AnalysisDisplayStyle Class   See Also |

Factory method - creates analysis display style object of type Vectors for the given document.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static AnalysisDisplayStyle CreateAnalysisDisplayStyle( 	Document document, 	string name, 	AnalysisDisplayVectorSettings vectorSettings, 	AnalysisDisplayColorSettings colorSettings, 	AnalysisDisplayLegendSettings legendSettings ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateAnalysisDisplayStyle ( _ 	document As Document, _ 	name As String, _ 	vectorSettings As AnalysisDisplayVectorSettings, _ 	colorSettings As AnalysisDisplayColorSettings, _ 	legendSettings As AnalysisDisplayLegendSettings _ ) As AnalysisDisplayStyle ``` |

| Visual C++ |
| --- |
| ``` public: static AnalysisDisplayStyle^ CreateAnalysisDisplayStyle( 	Document^ document,  	String^ name,  	AnalysisDisplayVectorSettings^ vectorSettings,  	AnalysisDisplayColorSettings^ colorSettings,  	AnalysisDisplayLegendSettings^ legendSettings ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     Document for which analysis display style object is created.

name
:   Type:  System String
     Name of the analysis display style within the %document%.

vectorSettings
:   Type:  Autodesk.Revit.DB.Analysis AnalysisDisplayVectorSettings
     Vector settings for the style.

colorSettings
:   Type:  Autodesk.Revit.DB.Analysis AnalysisDisplayColorSettings
     Color settings for the style.

legendSettings
:   Type:  Autodesk.Revit.DB.Analysis AnalysisDisplayLegendSettings
     Legend settings for the style.

#### Return Value

New analysis display style object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | document is a family. -or- name is not unique in document. |

# See Also

AnalysisDisplayStyle Class

CreateAnalysisDisplayStyle Overload

Autodesk.Revit.DB.Analysis Namespace

#### CutLineAngle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cut Line Angle"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CutLineAngle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CutLineAngle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CutLineAngle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TotalConnectedCurrent Property

---

|  |
| --- |
| AnalyticalPowerSourceData Class   See Also |

The total connected current of the analytical power source.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public double TotalConnectedCurrent { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TotalConnectedCurrent As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TotalConnectedCurrent { 	double get (); } ``` |

# See Also

AnalyticalPowerSourceData Class

Autodesk.Revit.DB.Electrical Namespace

#### StairsTopLevel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Level": The top level of stairs

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsTopLevel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsTopLevel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsTopLevel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetExportFontTable Method

---

|  |
| --- |
| BaseExportOptions Class   See Also |

Sets font table to option.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetExportFontTable( 	ExportFontTable fontTable ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetExportFontTable ( _ 	fontTable As ExportFontTable _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetExportFontTable( 	ExportFontTable^ fontTable ) ``` |

#### Parameters

fontTable
:   Type:  Autodesk.Revit.DB ExportFontTable
     The font table to be set.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

BaseExportOptions Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| RegenerationFailedException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

RegenerationFailedException Class

Autodesk.Revit.Exceptions Namespace

#### CableTray Class

---

|  |
| --- |
| Members   See Also |

This class represents a cable tray in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class CableTray : CableTrayConduitBase ``` |

| Visual Basic |
| --- |
| ``` Public Class CableTray _ 	Inherits CableTrayConduitBase ``` |

| Visual C++ |
| --- |
| ``` public ref class CableTray : public CableTrayConduitBase ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB HostObject
  Autodesk.Revit.DB MEPCurve
  Autodesk.Revit.DB.Electrical CableTrayConduitBase
  Autodesk.Revit.DB.Electrical CableTray

# See Also

CableTray Members

Autodesk.Revit.DB.Electrical Namespace

#### Current Property

---

|  |
| --- |
| ExportPatternTableIterator Class   See Also |

Gets the item at the current position of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual KeyValuePair<ExportPatternKey, ExportPatternInfo> Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportPatternKey, ExportPatternInfo) 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property KeyValuePair<ExportPatternKey^, ExportPatternInfo^> Current { 	KeyValuePair<ExportPatternKey^, ExportPatternInfo^> get (); } ``` |

#### Implements

 IEnumerator T Current

# Remarks

There is no current item if the iterator has not started yet or has been done.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | There is no current item in the iterator. |

# See Also

ExportPatternTableIterator Class

Autodesk.Revit.DB Namespace

#### VisibleByDefault Property

---

|  |
| --- |
| DockablePaneProviderData Class   See Also |

Controls the default visibility of the pane upon the first time the pane/plugin is loaded into Revit.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool VisibleByDefault { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property VisibleByDefault As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool VisibleByDefault { 	bool get (); 	void set (bool value); } ``` |

# Remarks

By default, panes will be created and shown in the Revit UI when Revit is launched for the first time. Subsequent loads of the Revit UI will determine the visibility of the panes based upon there state at the close of the previous Revit session. Providers can set this to false if they wish there panes to NOT be shown by default.

# See Also

DockablePaneProviderData Class

Autodesk.Revit.UI Namespace

#### ZoneLevelId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ZoneLevelId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZoneLevelId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ZoneLevelId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WorksharingDisplay Property

---

|  |
| --- |
| TemporaryViewModes Class   See Also |

The current state of the WorksharingDisplay mode in the associated view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public WorksharingDisplayMode WorksharingDisplay { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property WorksharingDisplay As WorksharingDisplayMode 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property WorksharingDisplayMode WorksharingDisplay { 	WorksharingDisplayMode get (); 	void set (WorksharingDisplayMode value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The WorksharingDisplay mode is either disabled or inapplicable in the associated view. |

# See Also

TemporaryViewModes Class

Autodesk.Revit.DB Namespace

#### GetParameters Method

---

|  |
| --- |
| FamilyManager Class   See Also |

Gets the parameters associated to family types in order.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IList<FamilyParameter> GetParameters() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetParameters As IList(Of FamilyParameter) ``` |

| Visual C++ |
| --- |
| ``` public: IList<FamilyParameter^>^ GetParameters() ``` |

#### Return Value

A collection containing all family parameters.

# Remarks

The parameters are family built-in parameters, category built-in parameters and shared parameters associated to the family types.

The collection consists of both visible and invisible parameters associated to the family types.

The parameters are returned in the order in which they appear in the Revit UI within a given group; however, parameters of different groups may be mixed within this output.

Currently the Revit UI order is determined first by group and next by the order of the individual parameters.

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace

#### CategorySet Class

---

|  |
| --- |
| Members   See Also |

A set that can contains Category objects.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class CategorySet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class CategorySet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class CategorySet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB CategorySet

# See Also

CategorySet Members

Autodesk.Revit.DB Namespace

#### AddBarGeometry Method (CurveLoop)

---

|  |
| --- |
| RebarCurvesData Class   See Also |

Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public RebarFreeFormValidationResult AddBarGeometry( 	CurveLoop curves ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddBarGeometry ( _ 	curves As CurveLoop _ ) As RebarFreeFormValidationResult ``` |

| Visual C++ |
| --- |
| ``` public: RebarFreeFormValidationResult AddBarGeometry( 	CurveLoop^ curves ) ``` |

#### Parameters

curves
:   Type:  Autodesk.Revit.DB CurveLoop
     Curves describing one bar in the set.

#### Return Value

Returns Success if everything is ok, otherwise the failure reason.

# Remarks

This function can fail due to following reasons:

* CurveLoop is empty.
* CurveLoop contains an unbounded curve.
* A rebar constructed from curves can't be bent according to the bending radius.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Incorrect number of bar geometry for the current layout. |

# See Also

RebarCurvesData Class

AddBarGeometry Overload

Autodesk.Revit.DB.Structure Namespace

#### GetBodyRowHeights Method

---

|  |
| --- |
| ScheduleHeightsOnSheet Class   See Also |

Returns each row's height of schedule body on sheet view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public IList<double> GetBodyRowHeights() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBodyRowHeights As IList(Of Double) ``` |

| Visual C++ |
| --- |
| ``` public: IList<double>^ GetBodyRowHeights() ``` |

#### Return Value

Each row's height of schedule body on sheet view.

# See Also

ScheduleHeightsOnSheet Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamExpCoeff3 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Thermal expansion coefficient Z"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamExpCoeff3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamExpCoeff3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamExpCoeff3 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetGraphicOverrides Method (WorksetId, WorksharingDisplayGraphicSettings)

---

|  |
| --- |
| WorksharingDisplaySettings Class   See Also |

Sets the graphic overrides assigned to elements in a particular user workset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetGraphicOverrides( 	WorksetId worksetId, 	WorksharingDisplayGraphicSettings overrides ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetGraphicOverrides ( _ 	worksetId As WorksetId, _ 	overrides As WorksharingDisplayGraphicSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetGraphicOverrides( 	WorksetId^ worksetId,  	WorksharingDisplayGraphicSettings^ overrides ) ``` |

#### Parameters

worksetId
:   Type:  Autodesk.Revit.DB WorksetId
     The workset of interest, which must be a user workset.

overrides
:   Type:  Autodesk.Revit.DB WorksharingDisplayGraphicSettings
     The desired graphic overrides for this workset.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | worksetId does not correspond to a user workset in the document containing this WorksharingDisplaySettings. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

WorksharingDisplaySettings Class

SetGraphicOverrides Overload

Autodesk.Revit.DB Namespace

#### ReferenceOtherViewUiToggle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Reference Other View": This is used to determine whether reference other view is enable or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ReferenceOtherViewUiToggle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ReferenceOtherViewUiToggle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ReferenceOtherViewUiToggle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralSectionCommonHeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionCommonHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionCommonHeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionCommonHeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| AreaBasedLoadType Class   See Also |

Creates an area based load type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static AreaBasedLoadType Create( 	Document document, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String _ ) As AreaBasedLoadType ``` |

| Visual C++ |
| --- |
| ``` public: static AreaBasedLoadType^ Create( 	Document^ document,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to create the area based load type.

name
:   Type:  System String
     The name of new area based load type. The actual name may be post-fixed if already exists.

#### Return Value

The newly created area based load type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

AreaBasedLoadType Class

Autodesk.Revit.DB.Electrical Namespace

#### MepZoneHotwaterLoop Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Heating Hot Water Loop"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepZoneHotwaterLoop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepZoneHotwaterLoop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepZoneHotwaterLoop { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetCategoryHidden Method

---

|  |
| --- |
| View Class   See Also |

Sets if elements of the given category will be visible in this view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetCategoryHidden( 	ElementId categoryId, 	bool hide ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCategoryHidden ( _ 	categoryId As ElementId, _ 	hide As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCategoryHidden( 	ElementId^ categoryId,  	bool hide ) ``` |

#### Parameters

categoryId
:   Type:  Autodesk.Revit.DB ElementId
     The ID of the category.

hide
:   Type:  System Boolean
     True to make elements of this category invisible, false to make them visible.

# Remarks

This affects only if the category is set visible or invisible individually. Other Revit mechanisms may also affect the visibility of elements of this category, including:

* The category classes settings for model categories, annotation categories, import categories or analytical model categories.
* View filters.
* Elements hidden individually in the view.

Thus setting this value may not affect the actual visibility of elements of this category in the view.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | categoryId does not correspond to a Category. -or- Category cannot be hidden. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### GetValidCategoriesForMaterialTakeoff Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Gets a list of categories that can be used for a material takeoff.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetValidCategoriesForMaterialTakeoff() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetValidCategoriesForMaterialTakeoff As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetValidCategoriesForMaterialTakeoff() ``` |

#### Return Value

The IDs of all valid categories.

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace